[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:22:22
 
     constructor(private dialog: MatDialog, private gameSocketService: GameSocketService, private vsOptionService: VsOptionService) {}
 
-    ngOnInit(): void {
-        this.vsOptionService.init(this.title);
-        this.buttonText = this.isInitiallyVsActive ? 'Rejoindre' : 'Créer';
-        this.vsOptionService.option.subscribe(this.changeDisplay);
-    }
+    ngOnInit(): void {}
 
     ngOnDestroy(): void {

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:28:25
         this.vsOptionService.option.subscribe(this.changeDisplay);
     }
 
-    ngOnDestroy(): void {
-        this.vsOptionService.destroy(this.title);
-    }
+    ngOnDestroy(): void {}
 
     startSolo() {

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:32:17
         this.vsOptionService.destroy(this.title);
     }
 
-    startSolo() {
-        this.openUsernamePopup('Jouer').subscribe((username) => {
-            if (username) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
-        });
-    }
+    startSolo() {}
 
     startVs() {

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:33:65
     }
 
     startSolo() {
-        this.openUsernamePopup('Jouer').subscribe((username) => {
-            if (username) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
-        });
+        this.openUsernamePopup('Jouer').subscribe((username) => {});
     }
 

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:34:17
 
     startSolo() {
         this.openUsernamePopup('Jouer').subscribe((username) => {
-            if (username) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
+            if (false) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
         });
     }

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:34:17
 
     startSolo() {
         this.openUsernamePopup('Jouer').subscribe((username) => {
-            if (username) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
+            if (true) this.gameSocketService.createGameSolo({ gameTitle: this.title, username });
         });
     }

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:38:15
         });
     }
 
-    startVs() {
-        this.openUsernamePopup(this.buttonText).subscribe((username) => {
-            if (username) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, this.buttonText === 'Créer');
-        });
-    }
+    startVs() {}
 
     private openUsernamePopup(option: string): Observable<string> {

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:39:73
     }
 
     startVs() {
-        this.openUsernamePopup(this.buttonText).subscribe((username) => {
-            if (username) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, this.buttonText === 'Créer');
-        });
+        this.openUsernamePopup(this.buttonText).subscribe((username) => {});
     }
 

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:40:100
 
     startVs() {
         this.openUsernamePopup(this.buttonText).subscribe((username) => {
-            if (username) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, this.buttonText === 'Créer');
+            if (username) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, true);
         });
     }

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:40:17
 
     startVs() {
         this.openUsernamePopup(this.buttonText).subscribe((username) => {
-            if (username) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, this.buttonText === 'Créer');
+            if (false) this.gameSocketService.createGameVs({ gameTitle: this.title, username }, this.buttonText === 'Créer');
         });
     }

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:44:67
         });
     }
 
-    private openUsernamePopup(option: string): Observable<string> {
-        this.dialogRef = this.dialog.open(UsernamePopUpComponent, { width: '30%', data: option, panelClass: 'container' });
-        this.dialogRef.afterClosed().subscribe(() => {
-            this.dialogRef = null;
-        });
-        return this.dialogRef.afterClosed();
-    }
+    private openUsernamePopup(option: string): Observable<string> {}
 
     private changeDisplay = (newOption: string) => {

[NoCoverage] StringLiteral
app/components/play-buttons/play-buttons.component.ts:45:109
     }
 
     private openUsernamePopup(option: string): Observable<string> {
-        this.dialogRef = this.dialog.open(UsernamePopUpComponent, { width: '30%', data: option, panelClass: 'container' });
+        this.dialogRef = this.dialog.open(UsernamePopUpComponent, { width: '30%', data: option, panelClass: "" });
         this.dialogRef.afterClosed().subscribe(() => {
             this.dialogRef = null;

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:46:54
 
     private openUsernamePopup(option: string): Observable<string> {
         this.dialogRef = this.dialog.open(UsernamePopUpComponent, { width: '30%', data: option, panelClass: 'container' });
-        this.dialogRef.afterClosed().subscribe(() => {
-            this.dialogRef = null;
-        });
+        this.dialogRef.afterClosed().subscribe(() => {});
         return this.dialogRef.afterClosed();
     }

[NoCoverage] BlockStatement
app/components/play-buttons/play-buttons.component.ts:52:52
         return this.dialogRef.afterClosed();
     }
 
-    private changeDisplay = (newOption: string) => {
-        this.buttonText = newOption;
-        if (this.dialogRef) this.dialogRef.componentInstance.data = newOption;
-    };
+    private changeDisplay = (newOption: string) => {};
 }
 

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:54:13
 
     private changeDisplay = (newOption: string) => {
         this.buttonText = newOption;
-        if (this.dialogRef) this.dialogRef.componentInstance.data = newOption;
+        if (false) this.dialogRef.componentInstance.data = newOption;
     };
 }

[NoCoverage] ConditionalExpression
app/components/play-buttons/play-buttons.component.ts:54:13
 
     private changeDisplay = (newOption: string) => {
         this.buttonText = newOption;
-        if (this.dialogRef) this.dialogRef.componentInstance.data = newOption;
+        if (true) this.dialogRef.componentInstance.data = newOption;
     };
 }
