[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:9:26
 
 import { CommunicationService } from '@app/services/communication.service';
 
-describe('Server', () => {
-    let service: CommunicationService;
-
-    beforeEach(() => {
-        TestBed.configureTestingModule({
-            imports: [HttpClientModule],
-        });
-        service = TestBed.inject(CommunicationService);
-    });
-
-    it('server should be running', async () => {
-        const history = await new Promise((resolve) => {
-            service.getHistory().subscribe((data) => resolve(data));
-        });
-        expect(history).toBeTruthy();
-    });
-});
+describe('Server', () => {});
 
 describe('CommunicationService Fuzzing', () => {

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:12:22
 describe('Server', () => {
     let service: CommunicationService;
 
-    beforeEach(() => {
-        TestBed.configureTestingModule({
-            imports: [HttpClientModule],
-        });
-        service = TestBed.inject(CommunicationService);
-    });
+    beforeEach(() => {});
 
     it('server should be running', async () => {

[NoCoverage] ObjectLiteral
src/app/services/communication.service.fuzzing.ts:13:40
     let service: CommunicationService;
 
     beforeEach(() => {
-        TestBed.configureTestingModule({
-            imports: [HttpClientModule],
-        });
+        TestBed.configureTestingModule({});
         service = TestBed.inject(CommunicationService);
     });

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:19:48
         service = TestBed.inject(CommunicationService);
     });
 
-    it('server should be running', async () => {
-        const history = await new Promise((resolve) => {
-            service.getHistory().subscribe((data) => resolve(data));
-        });
-        expect(history).toBeTruthy();
-    });
+    it('server should be running', async () => {});
 });
 

[NoCoverage] StringLiteral
src/app/services/communication.service.fuzzing.ts:19:8
         service = TestBed.inject(CommunicationService);
     });
 
-    it('server should be running', async () => {
+    it("", async () => {
         const history = await new Promise((resolve) => {
             service.getHistory().subscribe((data) => resolve(data));

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:20:56
     });
 
     it('server should be running', async () => {
-        const history = await new Promise((resolve) => {
-            service.getHistory().subscribe((data) => resolve(data));
-        });
+        const history = await new Promise((resolve) => {});
         expect(history).toBeTruthy();
     });

[NoCoverage] ArrowFunction
src/app/services/communication.service.fuzzing.ts:21:44
 
     it('server should be running', async () => {
         const history = await new Promise((resolve) => {
-            service.getHistory().subscribe((data) => resolve(data));
+            service.getHistory().subscribe(() => undefined);
         });
         expect(history).toBeTruthy();

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:39:38
 
     afterEach(() => {});
 
-    it('titleExistsGet', async () => {
-        console.log('titleExistsGet');
-        const titleExistsGet = async (title: string) => {
-            return await firstValueFrom(service.titleExistsGet(title));
-        };
-
-        let errors = await fuzz(titleExistsGet).string().errors();
-        console.log(`Errors founds: ${errors.length}`);
-        console.log(errors);
-        expect(errors.length).toEqual(0);
-    });
+    it('titleExistsGet', async () => {});
 
     it('getGameFile', async () => {

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:41:57
 
     it('titleExistsGet', async () => {
         console.log('titleExistsGet');
-        const titleExistsGet = async (title: string) => {
-            return await firstValueFrom(service.titleExistsGet(title));
-        };
+        const titleExistsGet = async (title: string) => {};
 
         let errors = await fuzz(titleExistsGet).string().errors();

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:51:35
         expect(errors.length).toEqual(0);
     });
 
-    it('getGameFile', async () => {
-        console.log('getGameFile');
-        const getGameFile = async (title: string, original: boolean) => {
-            return await firstValueFrom(service.getGameFile(title, original));
-        };
-        const errors = await fuzz(getGameFile).under(preset.string(), preset.boolean()).errors();
-        console.log(`Errors founds: ${errors.length}`);
-        console.log(errors);
-        expect(errors.length).toEqual(0);
-    });
+    it('getGameFile', async () => {});
 
     it('getGameFiles', async () => {

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:53:73
 
     it('getGameFile', async () => {
         console.log('getGameFile');
-        const getGameFile = async (title: string, original: boolean) => {
-            return await firstValueFrom(service.getGameFile(title, original));
-        };
+        const getGameFile = async (title: string, original: boolean) => {};
         const errors = await fuzz(getGameFile).under(preset.string(), preset.boolean()).errors();
         console.log(`Errors founds: ${errors.length}`);

[NoCoverage] StringLiteral
src/app/services/communication.service.fuzzing.ts:57:21
             return await firstValueFrom(service.getGameFile(title, original));
         };
         const errors = await fuzz(getGameFile).under(preset.string(), preset.boolean()).errors();
-        console.log(`Errors founds: ${errors.length}`);
+        console.log(``);
         console.log(errors);
         expect(errors.length).toEqual(0);

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:62:36
         expect(errors.length).toEqual(0);
     });
 
-    it('getGameFiles', async () => {
-        console.log('getGameFiles');
-        const getGameFiles = async (title: string) => {
-            return await firstValueFrom(service.getGameFiles(title));
-        };
-        const errors = await fuzz(getGameFiles).string().errors();
-        console.log(`Errors founds: ${errors.length}`);
-        console.log(errors);
-        expect(errors.length).toEqual(0);
-    });
+    it('getGameFiles', async () => {});
 
     it('getGames', async () => {

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:64:55
 
     it('getGameFiles', async () => {
         console.log('getGameFiles');
-        const getGameFiles = async (title: string) => {
-            return await firstValueFrom(service.getGameFiles(title));
-        };
+        const getGameFiles = async (title: string) => {};
         const errors = await fuzz(getGameFiles).string().errors();
         console.log(`Errors founds: ${errors.length}`);

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:73:32
         expect(errors.length).toEqual(0);
     });
 
-    it('getGames', async () => {
-        console.log('getGames');
-        const getGames = async (pageIndex: number) => {
-            return await firstValueFrom(service.getGames(pageIndex));
-        };
-        const errors = await fuzz(getGames).number().errors();
-        console.log(`Errors founds: ${errors.length}`);
-        console.log(errors);
-        expect(errors.length).toEqual(0);
-    });
+    it('getGames', async () => {});
 
     it('createGamePost', async () => {

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:75:55
 
     it('getGames', async () => {
         console.log('getGames');
-        const getGames = async (pageIndex: number) => {
-            return await firstValueFrom(service.getGames(pageIndex));
-        };
+        const getGames = async (pageIndex: number) => {};
         const errors = await fuzz(getGames).number().errors();
         console.log(`Errors founds: ${errors.length}`);

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:94:14
             playerName: string,
             time: number,
             isHard: boolean,
-        ) => {
-            return await firstValueFrom(
-                service.createGamePost({
-                    title,
-                    image1,
-                    image2,
-                    differences,
-                    bestTimes: {
-                        solo: [{ playerName, time }],
-                        versus: [{ playerName, time }],
-                    },
-                    isHard,
-                }),
-            );
-        };
+        ) => {};
         const errors = await fuzz(createGamePost)
             .under(preset.string(), preset.string(), preset.string(), [], preset.string(), preset.number(), preset.boolean())

[NoCoverage] ObjectLiteral
src/app/services/communication.service.fuzzing.ts:96:40
             isHard: boolean,
         ) => {
             return await firstValueFrom(
-                service.createGamePost({
-                    title,
-                    image1,
-                    image2,
-                    differences,
-                    bestTimes: {
-                        solo: [{ playerName, time }],
-                        versus: [{ playerName, time }],
-                    },
-                    isHard,
-                }),
+                service.createGamePost({}),
             );
         };

[NoCoverage] ArrayDeclaration
src/app/services/communication.service.fuzzing.ts:103:33
                     differences,
                     bestTimes: {
                         solo: [{ playerName, time }],
-                        versus: [{ playerName, time }],
+                        versus: [],
                     },
                     isHard,

[NoCoverage] ArrayDeclaration
src/app/services/communication.service.fuzzing.ts:110:71
             );
         };
         const errors = await fuzz(createGamePost)
-            .under(preset.string(), preset.string(), preset.string(), [], preset.string(), preset.number(), preset.boolean())
+            .under(preset.string(), preset.string(), preset.string(), ["Stryker was here"], preset.string(), preset.number(), preset.boolean())
             .errors();
         console.log(`Errors founds: ${errors.length}`);

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:117:34
         expect(errors.length).toEqual(0);
     });
 
-    it('deleteGame', async () => {
-        console.log('deleteGame');
-        const deleteGame = async (title: string) => {
-            return await firstValueFrom(service.deleteGame(title));
-        };
-        const errors = await fuzz(deleteGame).string().errors();
-        console.log(`Errors founds: ${errors.length}`);
-        console.log(errors);
-        expect(errors.length).toEqual(0);
-    });
+    it('deleteGame', async () => {});
 });
 

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:119:53
 
     it('deleteGame', async () => {
         console.log('deleteGame');
-        const deleteGame = async (title: string) => {
-            return await firstValueFrom(service.deleteGame(title));
-        };
+        const deleteGame = async (title: string) => {};
         const errors = await fuzz(deleteGame).string().errors();
         console.log(`Errors founds: ${errors.length}`);

[NoCoverage] StringLiteral
src/app/services/communication.service.fuzzing.ts:123:21
             return await firstValueFrom(service.deleteGame(title));
         };
         const errors = await fuzz(deleteGame).string().errors();
-        console.log(`Errors founds: ${errors.length}`);
+        console.log(``);
         console.log(errors);
         expect(errors.length).toEqual(0);
