[Killed] BlockStatement
src/app/services/game-socket.service.ts:55:7
         private sheetContainerService: SheetContainerService, // Needed to update sheets best time display
         public gameFeedbackService: GameFeedbackService, // Needed to call game logic on server message
         private saveReplay: SaveReplayService, // Needed to save any server message to replicate game on replay
-    ) {
-        this.isOngoing = false;
-        this.isValidUsername = new Subject<boolean>();
-        this.messages = [];
-        this.audio = new Audio();
-        this.frozenByError = false;
-        this.settingsValue = new BehaviorSubject({ initialTime: 30, penaltyTime: 5, bonusTime: 5 });
-        this.serverTimer = new BehaviorSubject<number>(0);
-        this.errorDelay = Time.SecToMs;
-        this.connect();
-
-        this.serverTimer.subscribe((currentTime) => {
-            this.currentTime = currentTime;
-        });
-    }
+    ) {}
 
     ngOnDestroy(): void {
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:56:26
         public gameFeedbackService: GameFeedbackService, // Needed to call game logic on server message
         private saveReplay: SaveReplayService, // Needed to save any server message to replicate game on replay
     ) {
-        this.isOngoing = false;
+        this.isOngoing = true;
         this.isValidUsername = new Subject<boolean>();
         this.messages = [];

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:60:30
         this.isValidUsername = new Subject<boolean>();
         this.messages = [];
         this.audio = new Audio();
-        this.frozenByError = false;
+        this.frozenByError = true;
         this.settingsValue = new BehaviorSubject({ initialTime: 30, penaltyTime: 5, bonusTime: 5 });
         this.serverTimer = new BehaviorSubject<number>(0);

[Survived] BlockStatement
src/app/services/game-socket.service.ts:66:53
         this.errorDelay = Time.SecToMs;
         this.connect();
 
-        this.serverTimer.subscribe((currentTime) => {
-            this.currentTime = currentTime;
-        });
+        this.serverTimer.subscribe((currentTime) => {});
     }
 

[Survived] BlockStatement
src/app/services/game-socket.service.ts:71:25
         });
     }
 
-    ngOnDestroy(): void {
-        this.socketService.disconnect();
-    }
+    ngOnDestroy(): void {}
 
     connect() {

[Killed] BlockStatement
src/app/services/game-socket.service.ts:75:15
         this.socketService.disconnect();
     }
 
-    connect() {
-        if (!this.socketService.isSocketAlive()) {
-            this.socketService.connect();
-            this.configureBaseSocketFeatures();
-        }
-    }
+    connect() {}
 
     setErrorDelay(delay: number) {
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:76:13
     }
 
     connect() {
-        if (!this.socketService.isSocketAlive()) {
+        if (false) {
             this.socketService.connect();
             this.configureBaseSocketFeatures();
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:76:13
     }
 
     connect() {
-        if (!this.socketService.isSocketAlive()) {
+        if (this.socketService.isSocketAlive()) {
             this.socketService.connect();
             this.configureBaseSocketFeatures();
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Killed] BlockStatement
src/app/services/game-socket.service.ts:82:34
         }
     }
 
-    setErrorDelay(delay: number) {
-        this.errorDelay = Time.SecToMs / delay;
-    }
+    setErrorDelay(delay: number) {}
 
     configureBaseSocketFeatures() {
killedBy: GameSocketService non-socket functions setErrorDelay should set errorDelay
statusReason: Expected 1000 to equal 10.

[Killed] ArithmeticOperator
src/app/services/game-socket.service.ts:83:27
     }
 
     setErrorDelay(delay: number) {
-        this.errorDelay = Time.SecToMs / delay;
+        this.errorDelay = Time.SecToMs * delay;
     }
 
killedBy: GameSocketService non-socket functions setErrorDelay should set errorDelay
statusReason: Expected 100000 to equal 10.

[Survived] BlockStatement
src/app/services/game-socket.service.ts:87:51
     }
 
     configureBaseSocketFeatures() {
-        this.socketService.on('disconnect', () => {
-            this.gameFeedbackService.isCheating = false;
-        });
+        this.socketService.on('disconnect', () => {});
         this.socketService.on('initSettings', (settings: GameSettings) => {
             this.settingsValue.next(settings);

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:88:51
 
     configureBaseSocketFeatures() {
         this.socketService.on('disconnect', () => {
-            this.gameFeedbackService.isCheating = false;
+            this.gameFeedbackService.isCheating = true;
         });
         this.socketService.on('initSettings', (settings: GameSettings) => {
killedBy: GameSocketService Receiving events should handle disconnect event
statusReason: Expected true to equal false.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:90:75
         this.socketService.on('disconnect', () => {
             this.gameFeedbackService.isCheating = false;
         });
-        this.socketService.on('initSettings', (settings: GameSettings) => {
-            this.settingsValue.next(settings);
-        });
+        this.socketService.on('initSettings', (settings: GameSettings) => {});
         /*
          * The client receives the game instance from the server and navigates to the game page
killedBy: GameSocketService Receiving events should init settings 
statusReason: Expected $.initialTime = 30 to equal 40.
Expected $.penaltyTime = 5 to equal 10.
Expected $.bonusTime = 5 to equal 10.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:96:70
         /*
          * The client receives the game instance from the server and navigates to the game page
          */
-        this.socketService.on('gameCreated', (game: GameInstance) => {
-            this.isOngoing = true;
-            this.messages = [];
-            this.dialog.closeAll();
-            this.gameInstance = game;
-            this.gameFeedbackService.nbClues = 3;
-            this.errorDelay = Time.SecToMs;
-            this.communicationService.getGameFiles(game.title).subscribe((data) => {
-                this.image1 = data[0];
-                this.image2 = data[1];
-                this.router.navigate(['/game']);
-            });
-        });
+        this.socketService.on('gameCreated', (game: GameInstance) => {});
 
         /*
killedBy: GameSocketService Receiving events should createGame on gameCreated event
statusReason: Expected spy unknown to have been called.

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:97:30
          * The client receives the game instance from the server and navigates to the game page
          */
         this.socketService.on('gameCreated', (game: GameInstance) => {
-            this.isOngoing = true;
+            this.isOngoing = false;
             this.messages = [];
             this.dialog.closeAll();

[Killed] BlockStatement
src/app/services/game-socket.service.ts:103:84
             this.gameInstance = game;
             this.gameFeedbackService.nbClues = 3;
             this.errorDelay = Time.SecToMs;
-            this.communicationService.getGameFiles(game.title).subscribe((data) => {
-                this.image1 = data[0];
-                this.image2 = data[1];
-                this.router.navigate(['/game']);
-            });
+            this.communicationService.getGameFiles(game.title).subscribe((data) => {});
         });
 
killedBy: GameSocketService Receiving events should createGame on gameCreated event
statusReason: Expected undefined to equal 'test1'.

[Killed] ArrayDeclaration
src/app/services/game-socket.service.ts:106:38
             this.communicationService.getGameFiles(game.title).subscribe((data) => {
                 this.image1 = data[0];
                 this.image2 = data[1];
-                this.router.navigate(['/game']);
+                this.router.navigate([]);
             });
         });
killedBy: GameSocketService Receiving events should createGame on gameCreated event
statusReason: Expected spy Router.navigate to have been called with:
  [ [ '/game' ] ]
but actual calls were:
  [ [  ] ].

Call 0:
  Expected $[0].length = 0 to equal 1.
  Expected $[0][0] = undefined to equal '/game'.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:114:73
          * Sets the username validity to true or false depending on the server response
          * (the server verifies if the username is already taken)
          */
-        this.socketService.on('usernameValidity', (isValid: boolean) => {
-            this.isValidUsername.next(isValid);
-        });
+        this.socketService.on('usernameValidity', (isValid: boolean) => {});
 
         /*
killedBy: GameSocketService Receiving events should call next on usernameValidity
statusReason: Expected spy unknown to have been called with:
  [ true ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:114:31
          * Sets the username validity to true or false depending on the server response
          * (the server verifies if the username is already taken)
          */
-        this.socketService.on('usernameValidity', (isValid: boolean) => {
+        this.socketService.on("", (isValid: boolean) => {
             this.isValidUsername.next(isValid);
         });
killedBy: GameSocketService Receiving events should call next on usernameValidity
statusReason: Expected spy unknown to have been called with:
  [ true ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:127:54
         /*
          * The client is refused by the host
          */
-        this.socketService.on('playerRefused', () => {
-            this.waitingRoomRef.componentInstance.data.prompt = "L'hôte a refusé la partie.";
-        });
+        this.socketService.on('playerRefused', () => {});
 
         this.socketService.on('kicked', () => {
killedBy: GameSocketService Receiving events should update prompt on refused
statusReason: Expected '' to be 'L'hôte a refusé la partie.'.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:131:47
             this.waitingRoomRef.componentInstance.data.prompt = "L'hôte a refusé la partie.";
         });
 
-        this.socketService.on('kicked', () => {
-            this.dialog
-                .open(WaitingRoomPopupComponent, {
-                    width: '20%',
-                    data: { gameTitle: '', prompt: "La partie n'existe plus." },
-                    disableClose: true,
-                    panelClass: 'container',
-                    autoFocus: false,
-                })
-                .afterClosed()
-                .subscribe(() => {
-                    this.reload();
-                });
-        });
+        this.socketService.on('kicked', () => {});
 
         /*
killedBy: GameSocketService Receiving events should open dialog on kicked
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:135:52
             this.dialog
                 .open(WaitingRoomPopupComponent, {
                     width: '20%',
-                    data: { gameTitle: '', prompt: "La partie n'existe plus." },
+                    data: { gameTitle: '', prompt: "" },
                     disableClose: true,
                     panelClass: 'container',
killedBy: GameSocketService Receiving events should open dialog on kicked
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: '' }), disableClose: true, panelClass: 'container', autoFocus: false }) ].

[Killed] ObjectLiteral
src/app/services/game-socket.service.ts:135:27
             this.dialog
                 .open(WaitingRoomPopupComponent, {
                     width: '20%',
-                    data: { gameTitle: '', prompt: "La partie n'existe plus." },
+                    data: {},
                     disableClose: true,
                     panelClass: 'container',
killedBy: GameSocketService Receiving events should open dialog on kicked
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '20%', data: Object({  }), disableClose: true, panelClass: 'container', autoFocus: false }) ].

Call 0:
  Expected $[1].

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:136:35
                 .open(WaitingRoomPopupComponent, {
                     width: '20%',
                     data: { gameTitle: '', prompt: "La partie n'existe plus." },
-                    disableClose: true,
+                    disableClose: false,
                     panelClass: 'container',
                     autoFocus: false,
killedBy: GameSocketService Receiving events should open dialog on kicked
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: false, panelClass: 'container'

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:138:32
                     data: { gameTitle: '', prompt: "La partie n'existe plus." },
                     disableClose: true,
                     panelClass: 'container',
-                    autoFocus: false,
+                    autoFocus: true,
                 })
                 .afterClosed()
killedBy: GameSocketService Receiving events should open dialog on kicked
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: '', prompt: 'La partie n'existe plus.' }), disableClose: true, panelClass: 'container',

[Survived] BlockStatement
src/app/services/game-socket.service.ts:141:34
                     autoFocus: false,
                 })
                 .afterClosed()
-                .subscribe(() => {
-                    this.reload();
-                });
+                .subscribe(() => {});
         });
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:149:75
         /*
          * The host receives the request to join the game and opens a popup to accept or refuse the request
          */
-        this.socketService.on('playerRequestJoin', (user: PlayingUser) => {
-            this.dialog
-                .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: false })
-                .afterClosed()
-                .subscribe((accepted: boolean) => {
-                    this.socketService.send(accepted ? 'acceptPlayer2' : 'refusePlayer2');
-                });
-        });
+        this.socketService.on('playerRequestJoin', (user: PlayingUser) => {});
 
         /*
killedBy: GameSocketService Receiving events should open dialog on playerRequestJoin
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: 'container', autoFocus: false }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:149:31
         /*
          * The host receives the request to join the game and opens a popup to accept or refuse the request
          */
-        this.socketService.on('playerRequestJoin', (user: PlayingUser) => {
+        this.socketService.on("", (user: PlayingUser) => {
             this.dialog
                 .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: false })
killedBy: GameSocketService Receiving events should open dialog on playerRequestJoin
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: 'container', autoFocus: false }) ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:151:114
          */
         this.socketService.on('playerRequestJoin', (user: PlayingUser) => {
             this.dialog
-                .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: false })
+                .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: true })
                 .afterClosed()
                 .subscribe((accepted: boolean) => {
killedBy: GameSocketService Receiving events should open dialog on playerRequestJoin
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: 'container', autoFocus: true }) ].

Call 0:
  Expected $[1].autoFocus = true to equal false.
Error

[Killed] StringLiteral
src/app/services/game-socket.service.ts:151:90
          */
         this.socketService.on('playerRequestJoin', (user: PlayingUser) => {
             this.dialog
-                .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: false })
+                .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: "", autoFocus: false })
                 .afterClosed()
                 .subscribe((accepted: boolean) => {
killedBy: GameSocketService Receiving events should open dialog on playerRequestJoin
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', data: Object({ card: 'test', user: 'user' }), panelClass: '', autoFocus: false }) ].

Call 0:
  Expected $[1].panelClass = '' to equal 'container'.
Error: E

[Killed] BlockStatement
src/app/services/game-socket.service.ts:153:51
             this.dialog
                 .open(JoinRequestPopupComponent, { width: '30%', data: user, panelClass: 'container', autoFocus: false })
                 .afterClosed()
-                .subscribe((accepted: boolean) => {
-                    this.socketService.send(accepted ? 'acceptPlayer2' : 'refusePlayer2');
-                });
+                .subscribe((accepted: boolean) => {});
         });
 
killedBy: GameSocketService Receiving events should send refuse to server if host refuses
statusReason: Expected spy send to have been called with:
  [ 'refusePlayer2' ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:162:31
          * The client receives an error from the server if he clicked on the wrong pixel
          * and draws the error on the canvas for a second
          */
-        this.socketService.on('errorClick', this.handleErrorClick);
+        this.socketService.on("", this.handleErrorClick);
 
         /*
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected spy playFeedbackSound to have been called with:
  [ false ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:167:94
         /*
          * The client receives receives that the game is finished and opens a popup to display the winner
          */
-        this.socketService.on('gameFinished', (data: { prompt: string; details: string }) => {
-            this.gameFeedbackService.isCheating = false;
-            this.isOngoing = false;
-            this.dialog.closeAll();
-            this.dialog.open(EndgamePopUpComponent, {
-                data,
-                width: '30%',
-                panelClass: 'container',
-                disableClose: true,
-                autoFocus: false,
-            });
-        });
+        this.socketService.on('gameFinished', (data: { prompt: string; details: string }) => {});
 
         /*
killedBy: GameSocketService Receiving events should open endgame pop-up on gameFinished
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:167:31
         /*
          * The client receives receives that the game is finished and opens a popup to display the winner
          */
-        this.socketService.on('gameFinished', (data: { prompt: string; details: string }) => {
+        this.socketService.on("", (data: { prompt: string; details: string }) => {
             this.gameFeedbackService.isCheating = false;
             this.isOngoing = false;
killedBy: GameSocketService Receiving events should open endgame pop-up on gameFinished
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but it was never called.

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:168:51
          * The client receives receives that the game is finished and opens a popup to display the winner
          */
         this.socketService.on('gameFinished', (data: { prompt: string; details: string }) => {
-            this.gameFeedbackService.isCheating = false;
+            this.gameFeedbackService.isCheating = true;
             this.isOngoing = false;
             this.dialog.closeAll();

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:169:30
          */
         this.socketService.on('gameFinished', (data: { prompt: string; details: string }) => {
             this.gameFeedbackService.isCheating = false;
-            this.isOngoing = false;
+            this.isOngoing = true;
             this.dialog.closeAll();
             this.dialog.open(EndgamePopUpComponent, {

[Killed] StringLiteral
src/app/services/game-socket.service.ts:174:29
             this.dialog.open(EndgamePopUpComponent, {
                 data,
                 width: '30%',
-                panelClass: 'container',
+                panelClass: "",
                 disableClose: true,
                 autoFocus: false,
killedBy: GameSocketService Receiving events should open endgame pop-up on gameFinished
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: '', disableClose: true, autoFocus: false }) ].

Call 0:
  Expected $[1

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:175:31
                 data,
                 width: '30%',
                 panelClass: 'container',
-                disableClose: true,
+                disableClose: false,
                 autoFocus: false,
             });
killedBy: GameSocketService Receiving events should open endgame pop-up on gameFinished
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: false, autoFocus: false }) ].

Call 0:
  Ex

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:176:28
                 width: '30%',
                 panelClass: 'container',
                 disableClose: true,
-                autoFocus: false,
+                autoFocus: true,
             });
         });
killedBy: GameSocketService Receiving events should open endgame pop-up on gameFinished
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ data: Object({ user: 'Vous', abandoned: false }), width: '30%', panelClass: 'container', disableClose: true, autoFocus: true }) ].

Call 0:
  Expe

[Killed] BlockStatement
src/app/services/game-socket.service.ts:183:51
         /*
          * The client receives that the host has left the game and the next client in line becomes the host
          */
-        this.socketService.on('becameHost', () => {
-            this.waitingRoomRef.componentInstance.data.prompt = "En attente d'un joueur...";
-        });
+        this.socketService.on('becameHost', () => {});
 
         this.socketService.on('serverMessage', this.handleServerMessage);
killedBy: GameSocketService Receiving events becameHost should prompt right string
statusReason: Expected '' to be 'En attente d'un joueur...'.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:193:78
 
         this.socketService.on('newBestTimeMessage', this.handleNewBestTimeMessage);
 
-        this.socketService.on('settingsChanged', (settings: GameSettings) => {
-            this.settingsValue.next(settings);
-        });
+        this.socketService.on('settingsChanged', (settings: GameSettings) => {});
 
         this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
killedBy: GameSocketService Receiving events should update settings 
statusReason: Expected $.initialTime = 30 to equal 40.
Expected $.penaltyTime = 5 to equal 10.
Expected $.bonusTime = 5 to equal 10.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:193:31
 
         this.socketService.on('newBestTimeMessage', this.handleNewBestTimeMessage);
 
-        this.socketService.on('settingsChanged', (settings: GameSettings) => {
+        this.socketService.on("", (settings: GameSettings) => {
             this.settingsValue.next(settings);
         });
killedBy: GameSocketService Receiving events should update settings 
statusReason: Expected $.initialTime = 30 to equal 40.
Expected $.penaltyTime = 5 to equal 10.
Expected $.bonusTime = 5 to equal 10.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:197:82
             this.settingsValue.next(settings);
         });
 
-        this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
-            const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
-            if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
-        });
+        this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {});
 
         this.socketService.on('updateAllBestTimes', (bestTimes: Game['bestTimes']) => {
killedBy: GameSocketService Receiving events should update bestTime 
statusReason: Expected $.bestTimes.solo[0].time = 100 to equal 10.
Expected $.bestTimes.solo[1].time = 100 to equal 10.
Expected $.bestTimes.solo[2].time = 100 to equal 10.
Expected $.bestTimes.versus[0].time = 100 to equal 10.
Expected $.bestTimes.versus[1].time = 100 to equal 10.
Expected $.bestTimes.versus[2].time = 100 to equal 10.
