[Killed] BlockStatement
app/components/game-sheet/game-sheet.component.ts:16:34
 
     constructor(private sanitizer: DomSanitizer) {}
 
-    sanitize(url: string | null) {
-        return url ? this.sanitizer.bypassSecurityTrustUrl(url) : null;
-    }
+    sanitize(url: string | null) {}
 
     formatTime(time: number): string {
killedBy: GameSheetComponent sanitize method should return null on null URL
statusReason: Expected undefined to equal null.

[Killed] BlockStatement
app/components/game-sheet/game-sheet.component.ts:20:38
         return url ? this.sanitizer.bypassSecurityTrustUrl(url) : null;
     }
 
-    formatTime(time: number): string {
-        const minutes = Math.floor(time / Time.MinToSec);
-        const seconds = time - minutes * Time.MinToSec;
-        return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
-    }
+    formatTime(time: number): string {}
 }
 
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected undefined to equal '1:01'.

[Killed] ArithmeticOperator
app/components/game-sheet/game-sheet.component.ts:21:36
     }
 
     formatTime(time: number): string {
-        const minutes = Math.floor(time / Time.MinToSec);
+        const minutes = Math.floor(time * Time.MinToSec);
         const seconds = time - minutes * Time.MinToSec;
         return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected '3660:0-219539' to equal '1:01'.

[Killed] ArithmeticOperator
app/components/game-sheet/game-sheet.component.ts:22:32
 
     formatTime(time: number): string {
         const minutes = Math.floor(time / Time.MinToSec);
-        const seconds = time - minutes * Time.MinToSec;
+        const seconds = time - minutes / Time.MinToSec;
         return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
     }
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected '1:60.983333333333334' to equal '1:01'.

[Killed] ArithmeticOperator
app/components/game-sheet/game-sheet.component.ts:22:25
 
     formatTime(time: number): string {
         const minutes = Math.floor(time / Time.MinToSec);
-        const seconds = time - minutes * Time.MinToSec;
+        const seconds = time + minutes * Time.MinToSec;
         return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
     }
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected '1:121' to equal '1:01'.

[Killed] ConditionalExpression
app/components/game-sheet/game-sheet.component.ts:23:33
     formatTime(time: number): string {
         const minutes = Math.floor(time / Time.MinToSec);
         const seconds = time - minutes * Time.MinToSec;
-        return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
+        return minutes + ':' + (false ? '0' + seconds : seconds);
     }
 }
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected '1:1' to equal '1:01'.

[Killed] ArithmeticOperator
app/components/game-sheet/game-sheet.component.ts:23:43
     formatTime(time: number): string {
         const minutes = Math.floor(time / Time.MinToSec);
         const seconds = time - minutes * Time.MinToSec;
-        return minutes + ':' + (seconds < Time.SecToMs / Time.Delay ? '0' + seconds : seconds);
+        return minutes + ':' + (seconds < Time.SecToMs * Time.Delay ? '0' + seconds : seconds);
     }
 }
killedBy: GameSheetComponent sanitize method should return correct format of time
statusReason: Expected '1:015' to equal '1:15'.
