[Killed] StringLiteral
src/app/services/game-socket.service.ts:197:31
             this.settingsValue.next(settings);
         });
 
-        this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
+        this.socketService.on("", (gameBestTime: Partial<Game>) => {
             const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
             if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
killedBy: GameSocketService Receiving events should update bestTime 
statusReason: Expected $.bestTimes.solo[0].time = 100 to equal 10.
Expected $.bestTimes.solo[1].time = 100 to equal 10.
Expected $.bestTimes.solo[2].time = 100 to equal 10.
Expected $.bestTimes.versus[0].time = 100 to equal 10.
Expected $.bestTimes.versus[1].time = 100 to equal 10.
Expected $.bestTimes.versus[2].time = 100 to equal 10.

[Killed] ArrowFunction
src/app/services/game-socket.service.ts:198:71
         });
 
         this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
-            const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
+            const game = this.sheetContainerService.currentGames.find(() => undefined);
             if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
         });
killedBy: GameSocketService Receiving events should update bestTime 
statusReason: Expected $.bestTimes.solo[0].time = 100 to equal 10.
Expected $.bestTimes.solo[1].time = 100 to equal 10.
Expected $.bestTimes.solo[2].time = 100 to equal 10.
Expected $.bestTimes.versus[0].time = 100 to equal 10.
Expected $.bestTimes.versus[1].time = 100 to equal 10.
Expected $.bestTimes.versus[2].time = 100 to equal 10.

[Killed] EqualityOperator
src/app/services/game-socket.service.ts:198:78
         });
 
         this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
-            const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
+            const game = this.sheetContainerService.currentGames.find((g) => g.title !== gameBestTime.title);
             if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
         });
killedBy: GameSocketService Receiving events should update bestTime 
statusReason: Expected $.bestTimes.solo[0].time = 100 to equal 10.
Expected $.bestTimes.solo[1].time = 100 to equal 10.
Expected $.bestTimes.solo[2].time = 100 to equal 10.
Expected $.bestTimes.versus[0].time = 100 to equal 10.
Expected $.bestTimes.versus[1].time = 100 to equal 10.
Expected $.bestTimes.versus[2].time = 100 to equal 10.

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:199:17
 
         this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
             const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
-            if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
+            if (false) game.bestTimes = gameBestTime.bestTimes;
         });
 
killedBy: GameSocketService Receiving events should update bestTime 
statusReason: Expected $.bestTimes.solo[0].time = 100 to equal 10.
Expected $.bestTimes.solo[1].time = 100 to equal 10.
Expected $.bestTimes.solo[2].time = 100 to equal 10.
Expected $.bestTimes.versus[0].time = 100 to equal 10.
Expected $.bestTimes.versus[1].time = 100 to equal 10.
Expected $.bestTimes.versus[2].time = 100 to equal 10.

[Survived] LogicalOperator
src/app/services/game-socket.service.ts:199:17
 
         this.socketService.on('updateBestTime', (gameBestTime: Partial<Game>) => {
             const game = this.sheetContainerService.currentGames.find((g) => g.title === gameBestTime.title);
-            if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
+            if (game || gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
         });
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:202:87
             if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
         });
 
-        this.socketService.on('updateAllBestTimes', (bestTimes: Game['bestTimes']) => {
-            this.sheetContainerService.currentGames.forEach((game) => {
-                game.bestTimes = bestTimes;
-            });
-        });
+        this.socketService.on('updateAllBestTimes', (bestTimes: Game['bestTimes']) => {});
 
         this.socketService.on('gameHistoryAdded', async () => {
killedBy: GameSocketService Receiving events should update best times
statusReason: Expected $.solo[0].time = 100 to equal 10.
Expected $.solo[1].time = 100 to equal 10.
Expected $.solo[2].time = 100 to equal 10.
Expected $.versus[0].time = 100 to equal 10.
Expected $.versus[1].time = 100 to equal 10.
Expected $.versus[2].time = 100 to equal 10.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:202:31
             if (game && gameBestTime.bestTimes) game.bestTimes = gameBestTime.bestTimes;
         });
 
-        this.socketService.on('updateAllBestTimes', (bestTimes: Game['bestTimes']) => {
+        this.socketService.on("", (bestTimes: Game['bestTimes']) => {
             this.sheetContainerService.currentGames.forEach((game) => {
                 game.bestTimes = bestTimes;
killedBy: GameSocketService Receiving events should update best times
statusReason: Expected $.solo[0].time = 100 to equal 10.
Expected $.solo[1].time = 100 to equal 10.
Expected $.solo[2].time = 100 to equal 10.
Expected $.versus[0].time = 100 to equal 10.
Expected $.versus[1].time = 100 to equal 10.
Expected $.versus[2].time = 100 to equal 10.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:203:71
         });
 
         this.socketService.on('updateAllBestTimes', (bestTimes: Game['bestTimes']) => {
-            this.sheetContainerService.currentGames.forEach((game) => {
-                game.bestTimes = bestTimes;
-            });
+            this.sheetContainerService.currentGames.forEach((game) => {});
         });
 
killedBy: GameSocketService Receiving events should update best times
statusReason: Expected $.solo[0].time = 100 to equal 10.
Expected $.solo[1].time = 100 to equal 10.
Expected $.solo[2].time = 100 to equal 10.
Expected $.versus[0].time = 100 to equal 10.
Expected $.versus[1].time = 100 to equal 10.
Expected $.versus[2].time = 100 to equal 10.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:208:63
             });
         });
 
-        this.socketService.on('gameHistoryAdded', async () => {
-            await this.sheetContainerService.getHistory();
-        });
+        this.socketService.on('gameHistoryAdded', async () => {});
 
         this.socketService.on('deleteHistory', () => {
killedBy: GameSocketService Receiving events gameHistoryAdded should call gethistory of sheetContainerService
statusReason: Expected spy gethistory to have been called.

[Survived] BlockStatement
src/app/services/game-socket.service.ts:212:54
             await this.sheetContainerService.getHistory();
         });
 
-        this.socketService.on('deleteHistory', () => {
-            this.sheetContainerService.currentHistory = [];
-        });
+        this.socketService.on('deleteHistory', () => {});
 
         this.socketService.on('cluePixelPos', (pixels: Pixel[]) => {

[Killed] ArrayDeclaration
src/app/services/game-socket.service.ts:213:57
         });
 
         this.socketService.on('deleteHistory', () => {
-            this.sheetContainerService.currentHistory = [];
+            this.sheetContainerService.currentHistory = ["Stryker was here"];
         });
 
killedBy: GameSocketService Receiving events delete History should set sheetContainer.currentHistory to []
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = 'Stryker was here' in array.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:216:68
             this.sheetContainerService.currentHistory = [];
         });
 
-        this.socketService.on('cluePixelPos', (pixels: Pixel[]) => {
-            this.gameFeedbackService.useClue(pixels);
-            this.saveReplay.saveAction(this.currentTime, 'clue', pixels);
-            this.saveReplay.saveAction(
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
-                'time',
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
-            );
-        });
+        this.socketService.on('cluePixelPos', (pixels: Pixel[]) => {});
     }
 
killedBy: GameSocketService Receiving events cluePixelPos should call useClue
statusReason: Expected spy useClue to have been called.

[Survived] ArithmeticOperator
src/app/services/game-socket.service.ts:220:28
             this.gameFeedbackService.useClue(pixels);
             this.saveReplay.saveAction(this.currentTime, 'clue', pixels);
             this.saveReplay.saveAction(
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
+                Math.floor(this.currentTime - this.gameInstance.hintPenalty * Time.SecToMs),
                 'time',
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),

[Survived] ArithmeticOperator
src/app/services/game-socket.service.ts:220:47
             this.gameFeedbackService.useClue(pixels);
             this.saveReplay.saveAction(this.currentTime, 'clue', pixels);
             this.saveReplay.saveAction(
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
+                Math.floor(this.currentTime + this.gameInstance.hintPenalty / Time.SecToMs),
                 'time',
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),

[Survived] StringLiteral
src/app/services/game-socket.service.ts:221:17
             this.saveReplay.saveAction(this.currentTime, 'clue', pixels);
             this.saveReplay.saveAction(
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
-                'time',
+                "",
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
             );

[Survived] ArithmeticOperator
src/app/services/game-socket.service.ts:222:28
             this.saveReplay.saveAction(
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
                 'time',
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
+                Math.floor(this.currentTime - this.gameInstance.hintPenalty * Time.SecToMs),
             );
         });

[Survived] ArithmeticOperator
src/app/services/game-socket.service.ts:222:47
             this.saveReplay.saveAction(
                 Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
                 'time',
-                Math.floor(this.currentTime + this.gameInstance.hintPenalty * Time.SecToMs),
+                Math.floor(this.currentTime + this.gameInstance.hintPenalty / Time.SecToMs),
             );
         });

[Killed] BlockStatement
src/app/services/game-socket.service.ts:227:19
         });
     }
 
-    requestClue() {
-        this.socketService.send('useClue');
-    }
+    requestClue() {}
 
     /**
killedBy: GameSocketService Emiting events should send useClue
statusReason: Expected spy send to have been called with:
  [ 'useClue' ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:237:63
      * @param p the pixel the client clicked
      * @param currentCtx the canvas context of the current canvas
      */
-    sendClick(p: Pixel, currentCtx: CanvasRenderingContext2D) {
-        if (!this.frozenByError) {
-            this.gameFeedbackService.currentErrorCtx = currentCtx;
-            this.socketService.send('sendClick', p);
-        }
-    }
+    sendClick(p: Pixel, currentCtx: CanvasRenderingContext2D) {}
 
     /**
killedBy: GameSocketService Emiting events should send a click to server
statusReason: Expected spy send to have been called with:
  [ 'sendClick', Object({ x: 50, y: 50 }) ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:238:13
      * @param currentCtx the canvas context of the current canvas
      */
     sendClick(p: Pixel, currentCtx: CanvasRenderingContext2D) {
-        if (!this.frozenByError) {
+        if (this.frozenByError) {
             this.gameFeedbackService.currentErrorCtx = currentCtx;
             this.socketService.send('sendClick', p);
killedBy: GameSocketService Emiting events should send a click to server
statusReason: Expected spy send to have been called with:
  [ 'sendClick', Object({ x: 50, y: 50 }) ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:238:13
      * @param currentCtx the canvas context of the current canvas
      */
     sendClick(p: Pixel, currentCtx: CanvasRenderingContext2D) {
-        if (!this.frozenByError) {
+        if (false) {
             this.gameFeedbackService.currentErrorCtx = currentCtx;
             this.socketService.send('sendClick', p);
killedBy: GameSocketService Emiting events should send a click to server
statusReason: Expected spy send to have been called with:
  [ 'sendClick', Object({ x: 50, y: 50 }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:240:37
     sendClick(p: Pixel, currentCtx: CanvasRenderingContext2D) {
         if (!this.frozenByError) {
             this.gameFeedbackService.currentErrorCtx = currentCtx;
-            this.socketService.send('sendClick', p);
+            this.socketService.send("", p);
         }
     }
killedBy: GameSocketService Emiting events should send a click to server
statusReason: Expected spy send to have been called with:
  [ 'sendClick', Object({ x: 50, y: 50 }) ]
but actual calls were:
  [ '', Object({ x: 50, y: 50 }) ].

Call 0:
  Expected $[0] = '' to equal 'sendClick'.
Error: Expected spy send to have been called with:

[Killed] BlockStatement
src/app/services/game-socket.service.ts:249:40
      *
      * @param username the username the client wants to use
      */
-    validateUsername(username: string) {
-        this.socketService.send('validateUsername', username);
-    }
+    validateUsername(username: string) {}
 
     /**
killedBy: GameSocketService Emiting events validateUsername should send a validateUsername event 
statusReason: Expected spy send to have been called with:
  [ 'validateUsername', 'user' ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:259:56
      * @param player Client's username and game title
      * @param isHost true if the client is the host, false otherwise
      */
-    createGameVs(player: PlayingUser, isHost: boolean) {
-        this.username = player.username;
-        this.socketService.send('startGameVs', player);
-        this.waitingRoomRef = this.dialog.open(WaitingRoomPopupComponent, {
-            width: '20%',
-            data: { gameTitle: player.gameTitle, prompt: isHost ? "En attente d'un joueur..." : "En attente de l'hôte..." },
-            disableClose: true,
-            panelClass: 'container',
-            autoFocus: false,
-        });
-        this.waitingRoomRef.afterClosed().subscribe(() => {
-            this.socketService.send('cancelWaitingRoom');
-        });
-    }
+    createGameVs(player: PlayingUser, isHost: boolean) {}
 
     /**
killedBy: GameSocketService Emiting events should send createGameVs on startGame
statusReason: Expected spy send to have been called with:
  [ 'startGameVs', Object({ username: 'test', gameTitle: 'test game' }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:261:33
      */
     createGameVs(player: PlayingUser, isHost: boolean) {
         this.username = player.username;
-        this.socketService.send('startGameVs', player);
+        this.socketService.send("", player);
         this.waitingRoomRef = this.dialog.open(WaitingRoomPopupComponent, {
             width: '20%',
killedBy: GameSocketService Emiting events should send createGameVs on startGame
statusReason: Expected spy send to have been called with:
  [ 'startGameVs', Object({ username: 'test', gameTitle: 'test game' }) ]
but actual calls were:
  [ '', Object({ username: 'test', gameTitle: 'test game' }) ],
  [ 'cancelWaitingRoom' ].

Call 0:
  Expected $[0] = '' to equal 'startGameVs'.

[Survived] StringLiteral
src/app/services/game-socket.service.ts:263:20
         this.username = player.username;
         this.socketService.send('startGameVs', player);
         this.waitingRoomRef = this.dialog.open(WaitingRoomPopupComponent, {
-            width: '20%',
+            width: "",
             data: { gameTitle: player.gameTitle, prompt: isHost ? "En attente d'un joueur..." : "En attente de l'hôte..." },
             disableClose: true,

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:265:27
         this.waitingRoomRef = this.dialog.open(WaitingRoomPopupComponent, {
             width: '20%',
             data: { gameTitle: player.gameTitle, prompt: isHost ? "En attente d'un joueur..." : "En attente de l'hôte..." },
-            disableClose: true,
+            disableClose: false,
             panelClass: 'container',
             autoFocus: false,

[Survived] StringLiteral
src/app/services/game-socket.service.ts:266:25
             width: '20%',
             data: { gameTitle: player.gameTitle, prompt: isHost ? "En attente d'un joueur..." : "En attente de l'hôte..." },
             disableClose: true,
-            panelClass: 'container',
+            panelClass: "",
             autoFocus: false,
         });

[Survived] BlockStatement
src/app/services/game-socket.service.ts:269:59
             panelClass: 'container',
             autoFocus: false,
         });
-        this.waitingRoomRef.afterClosed().subscribe(() => {
-            this.socketService.send('cancelWaitingRoom');
-        });
+        this.waitingRoomRef.afterClosed().subscribe(() => {});
     }
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:277:19
     /**
      * Requests the server to abandon the game when the client leaves the game page
      */
-    abandonGame() {
-        this.gameFeedbackService.isCheating = false;
-        this.socketService.send('abandonGame');
-    }
+    abandonGame() {}
 
     /**
killedBy: GameSocketService Emiting events abandonGame should send abandonGame
statusReason: Expected spy send to have been called.

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:278:47
      * Requests the server to abandon the game when the client leaves the game page
      */
     abandonGame() {
-        this.gameFeedbackService.isCheating = false;
+        this.gameFeedbackService.isCheating = true;
         this.socketService.send('abandonGame');
     }

[Killed] BlockStatement
src/app/services/game-socket.service.ts:287:41
      *
      * @param player Client's username and game title
      */
-    createGameSolo(player: PlayingUser) {
-        this.username = player.username;
-        this.socketService.send('startGameSolo', player);
-    }
+    createGameSolo(player: PlayingUser) {}
 
     createGameLimitedTime(username: string, buttonText: string) {
killedBy: GameSocketService Emiting events should send startGameSolo to server when gameMode is solo
statusReason: Expected spy send to have been called with:
  [ 'startGameSolo', Object({ gameTitle: 'test', username: 'user' }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:289:33
      */
     createGameSolo(player: PlayingUser) {
         this.username = player.username;
-        this.socketService.send('startGameSolo', player);
+        this.socketService.send("", player);
     }
 
killedBy: GameSocketService Emiting events should send startGameSolo to server when gameMode is solo
statusReason: Expected spy send to have been called with:
  [ 'startGameSolo', Object({ gameTitle: 'test', username: 'user' }) ]
but actual calls were:
  [ '', Object({ gameTitle: 'test', username: 'user' }) ].

Call 0:
  Expected $[0] = '' to equal 'startGameSolo'.
Error: Expected spy send to have been called with:

[Killed] BlockStatement
src/app/services/game-socket.service.ts:292:65
         this.socketService.send('startGameSolo', player);
     }
 
-    createGameLimitedTime(username: string, buttonText: string) {
-        this.username = username;
-        this.socketService.send('startGameLimitedTime' + buttonText.replace(/^\w/, (c) => c.toUpperCase()), username);
-    }
+    createGameLimitedTime(username: string, buttonText: string) {}
 
     /**
killedBy: GameSocketService Emiting events createGameLimitedTime should send startGameLimitedTime
statusReason: Expected spy send to have been called.

[Survived] ArrowFunction
src/app/services/game-socket.service.ts:294:84
 
     createGameLimitedTime(username: string, buttonText: string) {
         this.username = username;
-        this.socketService.send('startGameLimitedTime' + buttonText.replace(/^\w/, (c) => c.toUpperCase()), username);
+        this.socketService.send('startGameLimitedTime' + buttonText.replace(/^\w/, () => undefined), username);
     }
 

[Survived] MethodExpression
src/app/services/game-socket.service.ts:294:91
 
     createGameLimitedTime(username: string, buttonText: string) {
         this.username = username;
-        this.socketService.send('startGameLimitedTime' + buttonText.replace(/^\w/, (c) => c.toUpperCase()), username);
+        this.socketService.send('startGameLimitedTime' + buttonText.replace(/^\w/, (c) => c.toLowerCase()), username);
     }
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:302:51
      *
      * @param isDifferenceFound true if the client clicked on the right pixel, false otherwise
      */
-    playFeedbackSound(isDifferenceFound: boolean) {
-        this.audio.pause();
-        this.audio.currentTime = 0;
-        this.audio.src = isDifferenceFound ? './assets/right-answer.mp3' : './assets/wrong-answer.mp3';
-        this.audio.play();
-    }
+    playFeedbackSound(isDifferenceFound: boolean) {}
 
     /**
killedBy: GameSocketService non-socket functions playFeedbackSound should play right noise
statusReason: Expected '' to contain '/assets/wrong-answer.mp3'.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:305:76
     playFeedbackSound(isDifferenceFound: boolean) {
         this.audio.pause();
         this.audio.currentTime = 0;
-        this.audio.src = isDifferenceFound ? './assets/right-answer.mp3' : './assets/wrong-answer.mp3';
+        this.audio.src = isDifferenceFound ? './assets/right-answer.mp3' : "";
         this.audio.play();
     }
killedBy: GameSocketService non-socket functions playFeedbackSound should play right noise
statusReason: Expected 'http://localhost:9877/' to contain '/assets/wrong-answer.mp3'.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:312:25
     /**
      * Requests the server to join the selection room
      */
-    joinSelectionRoom() {
-        this.socketService.send('joinSelectionRoom');
-    }
+    joinSelectionRoom() {}
 
     /**
killedBy: GameSocketService Emiting events should send joinselectionroom
statusReason: Expected spy send to have been called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:321:89
      *
      * @param text the text the client wants to send
      */
-    handleChatMessageSent(text: string, isReplay?: boolean, message?: MessageComponent) {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.Sent;
-            message.message = { sender: this.username, text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
-        this.messages.unshift(message);
-        this.socketService.send('chatMessage', text);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageSent', message);
-    }
+    handleChatMessageSent(text: string, isReplay?: boolean, message?: MessageComponent) {}
 
     /**
killedBy: GameSocketService Emiting events sendChatMessage should send a chatMessage event 
statusReason: Expected spy send to have been called with:
  [ 'chatMessage', 'test' ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:322:13
      * @param text the text the client wants to send
      */
     handleChatMessageSent(text: string, isReplay?: boolean, message?: MessageComponent) {
-        if (!message) {
+        if (false) {
             message = new MessageComponent();
             message.color = ChatColor.Sent;
killedBy: GameSocketService Emiting events sendChatMessage should send a chatMessage event 
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#F0F81E', message: Object({ sender: 'user', text: 'test' }), date: <jasmine.any(String)> }).

[Killed] BlockStatement
src/app/services/game-socket.service.ts:322:23
      * @param text the text the client wants to send
      */
     handleChatMessageSent(text: string, isReplay?: boolean, message?: MessageComponent) {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.Sent;
-            message.message = { sender: this.username, text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
+        if (!message) {}
         this.messages.unshift(message);
         this.socketService.send('chatMessage', text);
killedBy: GameSocketService Emiting events sendChatMessage should send a chatMessage event 
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#F0F81E', message: Object({ sender: 'user', text: 'test' }), date: <jasmine.any(String)> }).

[Killed] StringLiteral
src/app/services/game-socket.service.ts:326:58
             message = new MessageComponent();
             message.color = ChatColor.Sent;
             message.message = { sender: this.username, text };
-            message.date = new Date().toLocaleTimeString('it-IT');
+            message.date = new Date().toLocaleTimeString("");
         }
         this.messages.unshift(message);
killedBy: GameSocketService Emiting events sendChatMessage should send a chatMessage event 
statusReason: RangeError: Incorrect locale information provided

[Survived] ConditionalExpression
src/app/services/game-socket.service.ts:330:13
         }
         this.messages.unshift(message);
         this.socketService.send('chatMessage', text);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageSent', message);
+        if (true) this.saveReplay.saveAction(this.currentTime, 'chatMessageSent', message);
     }
 

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:330:13
         }
         this.messages.unshift(message);
         this.socketService.send('chatMessage', text);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageSent', message);
+        if (isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageSent', message);
     }
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:339:111
      * @param messageReceived the message the other player sent
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
-    handleChatMessageReceived = (messageReceived: Message, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.message = messageReceived;
-            message.color = ChatColor.Received;
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
-        this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
-    };
+    handleChatMessageReceived = (messageReceived: Message, isReplay?: boolean, message?: MessageComponent) => {};
 
     /**
killedBy: GameSocketService Receiving events chatMessageToRoom should add chatMessage
statusReason: Expected [  ] to contain MessageComponent({ message: Object({ sender: 'SERVEUR', text: 'test' }), color: '#50FEAE', date: <jasmine.any(String)> }).

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:340:13
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
     handleChatMessageReceived = (messageReceived: Message, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
+        if (message) {
             message = new MessageComponent();
             message.message = messageReceived;
killedBy: GameSocketService Receiving events chatMessageToRoom should add chatMessage
statusReason: Expected [ undefined ] to contain MessageComponent({ message: Object({ sender: 'SERVEUR', text: 'test' }), color: '#50FEAE', date: <jasmine.any(String)> }).
