[Killed] BlockStatement
src/app/services/game-socket.service.ts:340:23
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
     handleChatMessageReceived = (messageReceived: Message, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.message = messageReceived;
-            message.color = ChatColor.Received;
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
+        if (!message) {}
         this.messages.unshift(message);
         if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
killedBy: GameSocketService Receiving events chatMessageToRoom should add chatMessage
statusReason: Expected [ undefined ] to contain MessageComponent({ message: Object({ sender: 'SERVEUR', text: 'test' }), color: '#50FEAE', date: <jasmine.any(String)> }).

[Survived] ConditionalExpression
src/app/services/game-socket.service.ts:347:13
             message.date = new Date().toLocaleTimeString('it-IT');
         }
         this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
+        if (false) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
     };
 

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:347:13
             message.date = new Date().toLocaleTimeString('it-IT');
         }
         this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
+        if (isReplay) this.saveReplay.saveAction(this.currentTime, 'chatMessageReceived', message);
     };
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:356:93
      * @param text the text the server wants to send
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
-    handleServerMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.Server;
-            message.message = { sender: 'SERVEUR', text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
-        this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
-    };
+    handleServerMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {};
 
     /**
killedBy: GameSocketService Receiving events serverMessage should add message to messages
statusReason: Expected [  ] to contain MessageComponent({ color: '#FFFFFF', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:357:13
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
     handleServerMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
+        if (message) {
             message = new MessageComponent();
             message.color = ChatColor.Server;
killedBy: GameSocketService Receiving events serverMessage should add message to messages
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#FFFFFF', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] BlockStatement
src/app/services/game-socket.service.ts:357:23
      * @param isReplay true if the message is sent during a replay, false otherwise
      */
     handleServerMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.Server;
-            message.message = { sender: 'SERVEUR', text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
+        if (!message) {}
         this.messages.unshift(message);
         if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
killedBy: GameSocketService Receiving events serverMessage should add message to messages
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#FFFFFF', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] ObjectLiteral
src/app/services/game-socket.service.ts:360:31
         if (!message) {
             message = new MessageComponent();
             message.color = ChatColor.Server;
-            message.message = { sender: 'SERVEUR', text };
+            message.message = {};
             message.date = new Date().toLocaleTimeString('it-IT');
         }
killedBy: GameSocketService Receiving events serverMessage should add message to messages
statusReason: Expected [ MessageComponent({ color: '#FFFFFF', message: Object({  }), date: '20:22:23' }) ] to contain MessageComponent({ color: '#FFFFFF', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] StringLiteral
src/app/services/game-socket.service.ts:361:58
             message = new MessageComponent();
             message.color = ChatColor.Server;
             message.message = { sender: 'SERVEUR', text };
-            message.date = new Date().toLocaleTimeString('it-IT');
+            message.date = new Date().toLocaleTimeString("");
         }
         this.messages.unshift(message);
killedBy: GameSocketService Receiving events serverMessage should add message to messages
statusReason: RangeError: Incorrect locale information provided

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:364:13
             message.date = new Date().toLocaleTimeString('it-IT');
         }
         this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
+        if (isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
     };
 

[Survived] ConditionalExpression
src/app/services/game-socket.service.ts:364:13
             message.date = new Date().toLocaleTimeString('it-IT');
         }
         this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
+        if (true) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
     };
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:374:98
      * @param isReplay true if the message is sent during a replay, false otherwise
      * @param message the message to display
      */
-    handleNewBestTimeMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.BestTime;
-            message.message = { sender: 'SERVEUR', text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
-        this.messages.unshift(message);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
-    };
+    handleNewBestTimeMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {};
 
     /**
killedBy: GameSocketService Receiving events newBestTimeMessage should add chatMessage
statusReason: Expected [  ] to contain MessageComponent({ color: '#50E9FE', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:375:13
      * @param message the message to display
      */
     handleNewBestTimeMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
+        if (false) {
             message = new MessageComponent();
             message.color = ChatColor.BestTime;
killedBy: GameSocketService Receiving events newBestTimeMessage should add chatMessage
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#50E9FE', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:375:13
      * @param message the message to display
      */
     handleNewBestTimeMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
+        if (message) {
             message = new MessageComponent();
             message.color = ChatColor.BestTime;
killedBy: GameSocketService Receiving events newBestTimeMessage should add chatMessage
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#50E9FE', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).

[Killed] BlockStatement
src/app/services/game-socket.service.ts:391:67
      * @param time the time the server sends
      * @param isReplay true if the time is sent during a replay, false otherwise
      */
-    handleGameTimeUpdated = (time: number, isReplay?: boolean) => {
-        this.serverTimer.next(time);
-        if (this.currentTime % PlaybackConstants.MsInSec === 0 && !isReplay) {
-            this.saveReplay.saveAction(this.currentTime, 'time', time);
-        }
-    };
+    handleGameTimeUpdated = (time: number, isReplay?: boolean) => {};
 
     /**
killedBy: GameSocketService Receiving events should update time on gameTimeUpdated
statusReason: Expected spy unknown to have been called with:
  [ 10 ]
but it was never called.

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:393:67
      */
     handleGameTimeUpdated = (time: number, isReplay?: boolean) => {
         this.serverTimer.next(time);
-        if (this.currentTime % PlaybackConstants.MsInSec === 0 && !isReplay) {
+        if (this.currentTime % PlaybackConstants.MsInSec === 0 && isReplay) {
             this.saveReplay.saveAction(this.currentTime, 'time', time);
         }

[Survived] ArithmeticOperator
src/app/services/game-socket.service.ts:393:13
      */
     handleGameTimeUpdated = (time: number, isReplay?: boolean) => {
         this.serverTimer.next(time);
-        if (this.currentTime % PlaybackConstants.MsInSec === 0 && !isReplay) {
+        if (this.currentTime * PlaybackConstants.MsInSec === 0 && !isReplay) {
             this.saveReplay.saveAction(this.currentTime, 'time', time);
         }

[Survived] StringLiteral
src/app/services/game-socket.service.ts:394:58
     handleGameTimeUpdated = (time: number, isReplay?: boolean) => {
         this.serverTimer.next(time);
         if (this.currentTime % PlaybackConstants.MsInSec === 0 && !isReplay) {
-            this.saveReplay.saveAction(this.currentTime, 'time', time);
+            this.saveReplay.saveAction(this.currentTime, "", time);
         }
     };

[Killed] BlockStatement
src/app/services/game-socket.service.ts:404:60
      * @param pos the pixel the client clicked
      * @param isReplay true if the click is sent during a replay, false otherwise
      */
-    handleErrorClick = (pos: Pixel, isReplay?: boolean) => {
-        this.playFeedbackSound(false);
-        this.frozenByError = true;
-        this.gameFeedbackService.drawError(pos);
-        setTimeout(() => {
-            this.frozenByError = false;
-            this.gameFeedbackService.clearError();
-        }, this.errorDelay);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
-    };
+    handleErrorClick = (pos: Pixel, isReplay?: boolean) => {};
 
     handleCheating() {
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected spy playFeedbackSound to have been called with:
  [ false ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:405:32
      * @param isReplay true if the click is sent during a replay, false otherwise
      */
     handleErrorClick = (pos: Pixel, isReplay?: boolean) => {
-        this.playFeedbackSound(false);
+        this.playFeedbackSound(true);
         this.frozenByError = true;
         this.gameFeedbackService.drawError(pos);
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected spy playFeedbackSound to have been called with:
  [ false ]
but actual calls were:
  [ true ].

Call 0:
  Expected $[0] = true to equal false.
Error: Expected spy playFeedbackSound to have been called with:

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:406:30
      */
     handleErrorClick = (pos: Pixel, isReplay?: boolean) => {
         this.playFeedbackSound(false);
-        this.frozenByError = true;
+        this.frozenByError = false;
         this.gameFeedbackService.drawError(pos);
         setTimeout(() => {
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected false to be true.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:408:26
         this.playFeedbackSound(false);
         this.frozenByError = true;
         this.gameFeedbackService.drawError(pos);
-        setTimeout(() => {
-            this.frozenByError = false;
-            this.gameFeedbackService.clearError();
-        }, this.errorDelay);
+        setTimeout(() => {}, this.errorDelay);
         if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
     };
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected true to be false.

[Killed] BooleanLiteral
src/app/services/game-socket.service.ts:409:34
         this.frozenByError = true;
         this.gameFeedbackService.drawError(pos);
         setTimeout(() => {
-            this.frozenByError = false;
+            this.frozenByError = true;
             this.gameFeedbackService.clearError();
         }, this.errorDelay);
killedBy: GameSocketService Receiving events should handle errorClick
statusReason: Expected true to be false.

[Survived] BooleanLiteral
src/app/services/game-socket.service.ts:412:13
             this.frozenByError = false;
             this.gameFeedbackService.clearError();
         }, this.errorDelay);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
+        if (isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
     };
 

[Survived] ConditionalExpression
src/app/services/game-socket.service.ts:412:13
             this.frozenByError = false;
             this.gameFeedbackService.clearError();
         }, this.errorDelay);
-        if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
+        if (false) this.saveReplay.saveAction(this.currentTime, 'error', pos);
     };
 

[Killed] BlockStatement
src/app/services/game-socket.service.ts:415:22
         if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'error', pos);
     };
 
-    handleCheating() {
-        this.saveReplay.saveAction(this.currentTime, 'cheating', this.gameFeedbackService.isCheating);
-    }
+    handleCheating() {}
 
     handleDifferenceFound(playerName: string, difference: Pixel[]) {
killedBy: GameSocketService non-socket functions should call saveAction on handleCheating
statusReason: Expected spy saveAction to have been called with:
  [ 0, 'cheating', false ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:419:68
         this.saveReplay.saveAction(this.currentTime, 'cheating', this.gameFeedbackService.isCheating);
     }
 
-    handleDifferenceFound(playerName: string, difference: Pixel[]) {
-        this.saveReplay.saveAction(this.currentTime, 'difference', { playerName, difference });
-    }
+    handleDifferenceFound(playerName: string, difference: Pixel[]) {}
 
     startReplay() {
killedBy: GameSocketService non-socket functions should call saveAction on handleDifferenceFound
statusReason: Expected spy saveAction to have been called with:
  [ 0, 'difference', Object({ playerName: 'test', difference: [  ] }) ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-socket.service.ts:423:19
         this.saveReplay.saveAction(this.currentTime, 'difference', { playerName, difference });
     }
 
-    startReplay() {
-        this.messages.splice(0);
-        this.gameFeedbackService.clearDifferences();
-    }
+    startReplay() {}
 
     reload() {
killedBy: GameSocketService non-socket functions should call clearDifferences on startReplay
statusReason: Expected spy clearDifferences to have been called.

[NoCoverage] BlockStatement
src/app/services/game-socket.service.ts:428:14
         this.gameFeedbackService.clearDifferences();
     }
 
-    reload() {
-        window.location.reload();
-    }
+    reload() {}
 
     updateSettings(initialTime: number, penaltyTime: number, bonusTime: number) {

[Killed] BlockStatement
src/app/services/game-socket.service.ts:432:81
         window.location.reload();
     }
 
-    updateSettings(initialTime: number, penaltyTime: number, bonusTime: number) {
-        this.socketService.send('updateSettings', { initialTime, penaltyTime, bonusTime } as GameSettings);
-    }
+    updateSettings(initialTime: number, penaltyTime: number, bonusTime: number) {}
 
     resetTime(gameTitle?: string) {
killedBy: GameSocketService Emiting events updateSettings should send a updateSettings event 
statusReason: Expected spy send to have been called with:
  [ 'updateSettings', Object({ initialTime: 30, penaltyTime: 5, bonusTime: 5 }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-socket.service.ts:433:33
     }
 
     updateSettings(initialTime: number, penaltyTime: number, bonusTime: number) {
-        this.socketService.send('updateSettings', { initialTime, penaltyTime, bonusTime } as GameSettings);
+        this.socketService.send("", { initialTime, penaltyTime, bonusTime } as GameSettings);
     }
 
killedBy: GameSocketService Emiting events updateSettings should send a updateSettings event 
statusReason: Expected spy send to have been called with:
  [ 'updateSettings', Object({ initialTime: 30, penaltyTime: 5, bonusTime: 5 }) ]
but actual calls were:
  [ '', Object({ initialTime: 30, penaltyTime: 5, bonusTime: 5 }) ].

Call 0:
  Expected $[0] = '' to equal 'updateSettings'.
Error: Expected spy send to have been called with:

[Killed] BlockStatement
src/app/services/game-socket.service.ts:436:35
         this.socketService.send('updateSettings', { initialTime, penaltyTime, bonusTime } as GameSettings);
     }
 
-    resetTime(gameTitle?: string) {
-        if (gameTitle) this.socketService.send('resetGameBestTimes', gameTitle);
-        else this.socketService.send('resetAllBestTimes');
-    }
+    resetTime(gameTitle?: string) {}
 }
 
killedBy: GameSocketService Emiting events resetTime should send an event 
statusReason: Expected spy send to have been called with:
  [ 'resetGameBestTimes', 'test' ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:437:13
     }
 
     resetTime(gameTitle?: string) {
-        if (gameTitle) this.socketService.send('resetGameBestTimes', gameTitle);
+        if (false) this.socketService.send('resetGameBestTimes', gameTitle);
         else this.socketService.send('resetAllBestTimes');
     }
killedBy: GameSocketService Emiting events resetTime should send an event 
statusReason: Expected spy send to have been called with:
  [ 'resetGameBestTimes', 'test' ]
but actual calls were:
  [ 'resetAllBestTimes' ].

Call 0:
  Expected $.length = 1 to equal 2.
  Expected $[0] = 'resetAllBestTimes' to equal 'resetGameBestTimes'.

[Killed] ConditionalExpression
src/app/services/game-socket.service.ts:437:13
     }
 
     resetTime(gameTitle?: string) {
-        if (gameTitle) this.socketService.send('resetGameBestTimes', gameTitle);
+        if (true) this.socketService.send('resetGameBestTimes', gameTitle);
         else this.socketService.send('resetAllBestTimes');
     }
killedBy: GameSocketService Emiting events resetTime should send an event 
statusReason: Expected spy send to have been called with:
  [ 'resetAllBestTimes' ]
but actual calls were:
  [ 'resetGameBestTimes', 'test' ],
  [ 'resetGameBestTimes', undefined ].

Call 0:
  Expected $.length = 2 to equal 1.
