[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:7:14
 
 import { CommunicationService } from '@app/services/communication.service';
 
-(async () => {
-    function promisify(f: (...args: any) => any) {
-        return async (...args: any) => await firstValueFrom(f(args));
-    }
-
-    const service = TestBed.inject(CommunicationService);
-
-    const errors = fuzz(promisify(service.getGameFile)).under(preset.string(), preset.boolean()).errors();
-
-    console.log(errors);
-})();
+(async () => {})();
 

[NoCoverage] BlockStatement
src/app/services/communication.service.fuzzing.ts:8:50
 import { CommunicationService } from '@app/services/communication.service';
 
 (async () => {
-    function promisify(f: (...args: any) => any) {
-        return async (...args: any) => await firstValueFrom(f(args));
-    }
+    function promisify(f: (...args: any) => any) {}
 
     const service = TestBed.inject(CommunicationService);

[NoCoverage] ArrowFunction
src/app/services/communication.service.fuzzing.ts:9:16
 
 (async () => {
     function promisify(f: (...args: any) => any) {
-        return async (...args: any) => await firstValueFrom(f(args));
+        return () => undefined;
     }
 
