[Killed] BlockStatement
src/app/classes/canvas-test-helper.ts:7:75
     providedIn: 'root',
 })
 export class CanvasTestHelper {
-    static createCanvas(width: number, height: number): HTMLCanvasElement {
-        const canvas: HTMLCanvasElement = document.createElement('canvas');
-        canvas.width = width;
-        canvas.height = height;
-        return canvas;
-    }
+    static createCanvas(width: number, height: number): HTMLCanvasElement {}
 }
 
killedBy: CanvasTestHelper createCanvas should create a HTMLCanvasElement with good dimensions; CompareService should be created
statusReason: Expected instance of undefined to be an instance of HTMLCanvasElement
