[NoCoverage] BooleanLiteral
src/fuzz.ts:20:39
 // First, initialize the Angular testing environment.
 getTestBed().initTestEnvironment(BrowserDynamicTestingModule, platformBrowserDynamicTesting());
 // Then we find all the tests.
-const context = require.context('./', true, /\.fuzz\.ts$/);
+const context = require.context('./', false, /\.fuzz\.ts$/);
 // And load the modules.
 context.keys().map(context);

[NoCoverage] Regex
src/fuzz.ts:20:45
 // First, initialize the Angular testing environment.
 getTestBed().initTestEnvironment(BrowserDynamicTestingModule, platformBrowserDynamicTesting());
 // Then we find all the tests.
-const context = require.context('./', true, /\.fuzz\.ts$/);
+const context = require.context('./', true, /\.fuzz\.ts/);
 // And load the modules.
 context.keys().map(context);
