[Killed] BlockStatement
src/app/classes/eraser.ts:13:41
      *
      * @param event the mousedown event
      */
-    start = (mouseEvent: MouseEvent) => {
-        Tool.currentMiddleCtx.globalCompositeOperation = 'destination-out';
-        Tool.currentMiddleCtx.lineWidth = Tool.eraserWidth;
-        this.initialX = mouseEvent.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
-        this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
-        Tool.currentMiddleCtx.clearRect(
-            this.initialX - Tool.eraserWidth / 2,
-            this.initialY - Tool.eraserWidth / 2,
-            Tool.eraserWidth,
-            Tool.eraserWidth,
-        );
-    };
+    start = (mouseEvent: MouseEvent) => {};
 
     stop = () => {
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected undefined to equal 'destination-out'.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:16:25
     start = (mouseEvent: MouseEvent) => {
         Tool.currentMiddleCtx.globalCompositeOperation = 'destination-out';
         Tool.currentMiddleCtx.lineWidth = Tool.eraserWidth;
-        this.initialX = mouseEvent.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
+        this.initialX = mouseEvent.clientX + Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected 3 to equal 1.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:17:25
         Tool.currentMiddleCtx.globalCompositeOperation = 'destination-out';
         Tool.currentMiddleCtx.lineWidth = Tool.eraserWidth;
         this.initialX = mouseEvent.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
-        this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
+        this.initialY = mouseEvent.clientY + Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
             this.initialX - Tool.eraserWidth / 2,
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected 4 to equal 0.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:19:29
         this.initialX = mouseEvent.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
-            this.initialX - Tool.eraserWidth / 2,
+            this.initialX - Tool.eraserWidth * 2,
             this.initialY - Tool.eraserWidth / 2,
             Tool.eraserWidth,
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, -1, 2, 2 ]
but actual calls were:
  [ -3, -1, 2, 2 ].

Call 0:
  Expected $[0] = -3 to equal 0.
Error: Expected spy CanvasRenderingContext2D.clearRect to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:19:13
         this.initialX = mouseEvent.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
-            this.initialX - Tool.eraserWidth / 2,
+            this.initialX + Tool.eraserWidth / 2,
             this.initialY - Tool.eraserWidth / 2,
             Tool.eraserWidth,
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, -1, 2, 2 ]
but actual calls were:
  [ 2, -1, 2, 2 ].

Call 0:
  Expected $[0] = 2 to equal 0.
Error: Expected spy CanvasRenderingContext2D.clearRect to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:20:29
         this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
             this.initialX - Tool.eraserWidth / 2,
-            this.initialY - Tool.eraserWidth / 2,
+            this.initialY - Tool.eraserWidth * 2,
             Tool.eraserWidth,
             Tool.eraserWidth,
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, -1, 2, 2 ]
but actual calls were:
  [ 0, -4, 2, 2 ].

Call 0:
  Expected $[1] = -4 to equal -1.
Error: Expected spy CanvasRenderingContext2D.clearRect to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:20:13
         this.initialY = mouseEvent.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         Tool.currentMiddleCtx.clearRect(
             this.initialX - Tool.eraserWidth / 2,
-            this.initialY - Tool.eraserWidth / 2,
+            this.initialY + Tool.eraserWidth / 2,
             Tool.eraserWidth,
             Tool.eraserWidth,
killedBy: Pencil start should set relevant properties and call clearRect
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, -1, 2, 2 ]
but actual calls were:
  [ 0, 1, 2, 2 ].

Call 0:
  Expected $[1] = 1 to equal -1.
Error: Expected spy CanvasRenderingContext2D.clearRect to have been called with:

[Killed] BlockStatement
src/app/classes/eraser.ts:26:18
         );
     };
 
-    stop = () => {
-        Tool.currentMiddleCtx.globalCompositeOperation = 'source-over';
-    };
+    stop = () => {};
 
     /**
killedBy: Pencil stop should set currentMiddleCtx.globalCompositeOperation to "source-over"
statusReason: Expected undefined to equal 'source-over'.

[Killed] BlockStatement
src/app/classes/eraser.ts:37:35
      *
      * @param event the mousemove event
      */
-    move = (event: MouseEvent) => {
-        const endX = event.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
-        const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
-        const deltaX = Math.abs(this.initialX - endX);
-        const deltaY = Math.abs(this.initialY - endY);
-        const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
-        const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
-
-        if (deltaX > deltaY)
-            this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
-        else {
-            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
-        }
-    };
+    move = (event: MouseEvent) => {};
 
     enter = () => {
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but it was never called.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:38:22
      * @param event the mousemove event
      */
     move = (event: MouseEvent) => {
-        const endX = event.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
+        const endX = event.clientX + Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         const deltaX = Math.abs(this.initialX - endX);
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, 0.4, -4 ], 20 ].

Call 0:
  Expected $[0][2] = 0.4 to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:39:22
      */
     move = (event: MouseEvent) => {
         const endX = event.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
-        const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
+        const endY = event.clientY + Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         const deltaX = Math.abs(this.initialX - endX);
         const deltaY = Math.abs(this.initialY - endY);
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, -0, -4 ], 16 ].

Call 0:
  Expected $[1] = 16 to equal 20.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:40:33
     move = (event: MouseEvent) => {
         const endX = event.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
-        const deltaX = Math.abs(this.initialX - endX);
+        const deltaX = Math.abs(this.initialX + endX);
         const deltaY = Math.abs(this.initialY - endY);
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ -2, 0, -4, -2 ], 40 ].

Call 0:
  Expected $[0][0] = -2 to equal 0.
  Expected $[0][1] = 0 to equal -2.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:41:33
         const endX = event.clientX - Tool.currentMiddleCtx.canvas.getBoundingClientRect().left;
         const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         const deltaX = Math.abs(this.initialX - endX);
-        const deltaY = Math.abs(this.initialY - endY);
+        const deltaY = Math.abs(this.initialY + endY);
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, -0, -4 ], 40 ].

Call 0:
  Expected $[1] = 40 to equal 20.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] EqualityOperator
src/app/classes/eraser.ts:42:23
         const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         const deltaX = Math.abs(this.initialX - endX);
         const deltaY = Math.abs(this.initialY - endY);
-        const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
+        const signX = this.initialX <= endX ? 1 : DrawConstants.NegativeStep;
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, 0, -4 ], 20 ].

Call 0:
  Expected $[0][2] = 0 to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ConditionalExpression
src/app/classes/eraser.ts:42:23
         const endY = event.clientY - Tool.currentMiddleCtx.canvas.getBoundingClientRect().top;
         const deltaX = Math.abs(this.initialX - endX);
         const deltaY = Math.abs(this.initialY - endY);
-        const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
+        const signX = true ? 1 : DrawConstants.NegativeStep;
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, 0, -4 ], 20 ].

Call 0:
  Expected $[0][2] = 0 to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ConditionalExpression
src/app/classes/eraser.ts:43:23
         const deltaX = Math.abs(this.initialX - endX);
         const deltaY = Math.abs(this.initialY - endY);
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
-        const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
+        const signY = true ? 1 : DrawConstants.NegativeStep;
 
         if (deltaX > deltaY)
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, 2, -0, 4 ], 20 ].

Call 0:
  Expected $[0][1] = 2 to equal -2.
  Expected $[0][3] = 4 to equal -4.

[Killed] EqualityOperator
src/app/classes/eraser.ts:43:23
         const deltaX = Math.abs(this.initialX - endX);
         const deltaY = Math.abs(this.initialY - endY);
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
-        const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
+        const signY = this.initialY <= endY ? 1 : DrawConstants.NegativeStep;
 
         if (deltaX > deltaY)
killedBy: Pencil should call eraseFixedAxis according to the mouse moving vertically
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 2, 0, 4, -0 ], 25 ]
but actual calls were:
  [ [ 2, 0, 4, 0 ], 25 ].

Call 0:
  Expected $[0][3] = 0 to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ConditionalExpression
src/app/classes/eraser.ts:45:13
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
-        if (deltaX > deltaY)
+        if (false)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
killedBy: Pencil should call eraseFixedAxis according to the mouse moving vertically
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 2, 0, 4, -0 ], 25 ]
but actual calls were:
  [ [ 0, -2, Infinity, -4 ], 0 ].

Call 0:
  Expected $[0][0] = 0 to equal 2.
  Expected $[0][1] = -2 to equal 0.

[Killed] ConditionalExpression
src/app/classes/eraser.ts:45:13
         const signX = this.initialX < endX ? 1 : DrawConstants.NegativeStep;
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
-        if (deltaX > deltaY)
+        if (true)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ -2, 0, -4, -Infinity ], 0 ].

Call 0:
  Expected $[0][0] = -2 to equal 0.
  Expected $[0][1] = 0 to equal -2.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:46:48
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
         if (deltaX > deltaY)
-            this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
+            this.eraseFixedAxis([signX * 2, 0, signX / DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
             this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
killedBy: Pencil should call eraseFixedAxis according to the mouse moving vertically
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 2, 0, 4, -0 ], 25 ]
but actual calls were:
  [ [ 2, 0, 0.25, -0 ], 25 ].

Call 0:
  Expected $[0][2] = 0.25 to equal 4.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:46:82
         const signY = this.initialY < endY ? 1 : DrawConstants.NegativeStep;
 
         if (deltaX > deltaY)
-            this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
+            this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY / (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
             this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
killedBy: Pencil should call eraseFixedAxis according to the mouse moving vertically
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 2, 0, 4, -0 ], 25 ]
but actual calls were:
  [ [ 2, 0, 4, -Infinity ], 25 ].

Call 0:
  Expected $[0][3] = -Infinity to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] BlockStatement
src/app/classes/eraser.ts:47:14
 
         if (deltaX > deltaY)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
-        else {
-            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
-        }
+        else {}
     };
 
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but it was never called.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:48:102
         if (deltaX > deltaY)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
-            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
+            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY / DrawConstants.EraseSteps], deltaY);
         }
     };
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, -0, -0.25 ], 20 ].

Call 0:
  Expected $[0][3] = -0.25 to equal -4.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:48:37
         if (deltaX > deltaY)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
-            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
+            this.eraseFixedAxis([0, signY / 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
         }
     };
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -0.5, -0, -4 ], 20 ].

Call 0:
  Expected $[0][1] = -0.5 to equal -2.
Error: Expected spy eraseFixedAxis to have been called with:

[Killed] BlockStatement
src/app/classes/eraser.ts:52:19
         }
     };
 
-    enter = () => {
-        Tool.currentMiddleCtx.beginPath();
-    };
+    enter = () => {};
 
     toString() {
killedBy: Pencil enter should call currentTopCtx.beginPath
statusReason: Expected spy CanvasRenderingContext2D.beginPath to have been called.

[Killed] BlockStatement
src/app/classes/eraser.ts:56:16
         Tool.currentMiddleCtx.beginPath();
     };
 
-    toString() {
-        return 'eraser';
-    }
+    toString() {}
 
     /**
killedBy: Pencil toString should return "eraser
statusReason: Expected undefined to equal 'eraser'.

[Killed] BlockStatement
src/app/classes/eraser.ts:67:75
      * @param steps the steps to take to draw the line
      * @param directionDelta the number of steps to take
      */
-    private eraseFixedAxis(steps: number[], directionDelta: number): void {
-        for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {
-            Tool.currentMiddleCtx.beginPath();
-            Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
-            Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
-            Tool.currentMiddleCtx.stroke();
-            this.initialX += steps[2];
-            this.initialY += steps[3];
-        }
-    }
+    private eraseFixedAxis(steps: number[], directionDelta: number): void {}
 }
 
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected spy CanvasRenderingContext2D.beginPath to have been called 2 times. It was called 0 times.

[Killed] BlockStatement
src/app/classes/eraser.ts:68:76
      * @param directionDelta the number of steps to take
      */
     private eraseFixedAxis(steps: number[], directionDelta: number): void {
-        for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {
-            Tool.currentMiddleCtx.beginPath();
-            Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
-            Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
-            Tool.currentMiddleCtx.stroke();
-            this.initialX += steps[2];
-            this.initialY += steps[3];
-        }
+        for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {}
     }
 }
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected spy CanvasRenderingContext2D.beginPath to have been called 2 times. It was called 0 times.

[Killed] ConditionalExpression
src/app/classes/eraser.ts:68:25
      * @param directionDelta the number of steps to take
      */
     private eraseFixedAxis(steps: number[], directionDelta: number): void {
-        for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {
+        for (let i = 0; false; i += DrawConstants.EraseSteps) {
             Tool.currentMiddleCtx.beginPath();
             Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected spy CanvasRenderingContext2D.beginPath to have been called 2 times. It was called 0 times.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:71:42
         for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {
             Tool.currentMiddleCtx.beginPath();
             Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
-            Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
+            Tool.currentMiddleCtx.lineTo(this.initialX - steps[0], this.initialY + steps[1]);
             Tool.currentMiddleCtx.stroke();
             this.initialX += steps[2];
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected $[0] = 19 to equal 21.

[Killed] ArithmeticOperator
src/app/classes/eraser.ts:71:68
         for (let i = 0; i < directionDelta; i += DrawConstants.EraseSteps) {
             Tool.currentMiddleCtx.beginPath();
             Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
-            Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
+            Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY - steps[1]);
             Tool.currentMiddleCtx.stroke();
             this.initialX += steps[2];
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected $[1] = 28 to equal 32.

[Killed] AssignmentOperator
src/app/classes/eraser.ts:73:13
             Tool.currentMiddleCtx.moveTo(this.initialX, this.initialY);
             Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
             Tool.currentMiddleCtx.stroke();
-            this.initialX += steps[2];
+            this.initialX -= steps[2];
             this.initialY += steps[3];
         }
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected 14 to equal 26.

[Killed] AssignmentOperator
src/app/classes/eraser.ts:74:13
             Tool.currentMiddleCtx.lineTo(this.initialX + steps[0], this.initialY + steps[1]);
             Tool.currentMiddleCtx.stroke();
             this.initialX += steps[2];
-            this.initialY += steps[3];
+            this.initialY -= steps[3];
         }
     }
killedBy: Pencil eraseFixedAxis should determine erase path according to given step values and direction
statusReason: Expected 22 to equal 38.
