[Killed] BlockStatement
src/app/classes/pencil.ts:10:41
      * @param event the MouseEvent.
      * @param layer the CanvasRenderingContext2D to use.
      */
-    start = (mouseEvent: MouseEvent) => {
-        Tool.currentTopCtx.strokeStyle = Tool.drawColor;
-        Tool.currentTopCtx.lineWidth = Tool.drawWidth;
-        Tool.currentTopCtx.beginPath();
-        Tool.currentTopCtx.moveTo(
-            mouseEvent.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
-            mouseEvent.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
-        );
-        this.move(mouseEvent);
-    };
+    start = (mouseEvent: MouseEvent) => {};
 
     /**
killedBy: Pencil start should set and draw original stroke
statusReason: Expected undefined to equal 'expectedColor'.

[Killed] ArithmeticOperator
src/app/classes/pencil.ts:15:13
         Tool.currentTopCtx.lineWidth = Tool.drawWidth;
         Tool.currentTopCtx.beginPath();
         Tool.currentTopCtx.moveTo(
-            mouseEvent.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
+            mouseEvent.clientX + Tool.currentTopCtx.canvas.getBoundingClientRect().left,
             mouseEvent.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
         );
killedBy: Pencil start should set and draw original stroke
statusReason: Expected spy CanvasRenderingContext2D.moveTo to have been called with:
  [ 1, 0 ]
but actual calls were:
  [ 3, 0 ].

Call 0:
  Expected $[0] = 3 to equal 1.
Error: Expected spy CanvasRenderingContext2D.moveTo to have been called with:

[Killed] ArithmeticOperator
src/app/classes/pencil.ts:16:13
         Tool.currentTopCtx.beginPath();
         Tool.currentTopCtx.moveTo(
             mouseEvent.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
-            mouseEvent.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
+            mouseEvent.clientY + Tool.currentTopCtx.canvas.getBoundingClientRect().top,
         );
         this.move(mouseEvent);
killedBy: Pencil start should set and draw original stroke
statusReason: Expected spy CanvasRenderingContext2D.moveTo to have been called with:
  [ 1, 0 ]
but actual calls were:
  [ 1, 4 ].

Call 0:
  Expected $[1] = 4 to equal 0.
Error: Expected spy CanvasRenderingContext2D.moveTo to have been called with:

[Killed] BlockStatement
src/app/classes/pencil.ts:24:18
     /**
      * Event handler for the mouseup event of the pencil tool.
      */
-    stop = () => {
-        Tool.currentMiddleCtx.drawImage(Tool.currentTopCtx.canvas, 0, 0);
-        Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
-    };
+    stop = () => {};
 
     /**
killedBy: Pencil stop should transfer drawing from layers
statusReason: TypeError: Cannot read properties of undefined (reading 'args')

[Killed] BlockStatement
src/app/classes/pencil.ts:34:35
      *
      * @param event the MouseEvent
      */
-    move = (event: MouseEvent) => {
-        Tool.currentTopCtx.lineTo(
-            event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
-            event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
-        );
-        Tool.currentTopCtx.stroke();
-    };
+    move = (event: MouseEvent) => {};
 
     enter = () => {
killedBy: Pencil move should draw stroke
statusReason: Expected spy CanvasRenderingContext2D.lineTo to have been called with:
  [ 1, 0 ]
but it was never called.

[Killed] ArithmeticOperator
src/app/classes/pencil.ts:36:13
      */
     move = (event: MouseEvent) => {
         Tool.currentTopCtx.lineTo(
-            event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
+            event.clientX + Tool.currentTopCtx.canvas.getBoundingClientRect().left,
             event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
         );
killedBy: Pencil move should draw stroke
statusReason: Expected spy CanvasRenderingContext2D.lineTo to have been called with:
  [ 1, 0 ]
but actual calls were:
  [ 3, 0 ].

Call 0:
  Expected $[0] = 3 to equal 1.
Error: Expected spy CanvasRenderingContext2D.lineTo to have been called with:

[Killed] ArithmeticOperator
src/app/classes/pencil.ts:37:13
     move = (event: MouseEvent) => {
         Tool.currentTopCtx.lineTo(
             event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left,
-            event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top,
+            event.clientY + Tool.currentTopCtx.canvas.getBoundingClientRect().top,
         );
         Tool.currentTopCtx.stroke();
killedBy: Pencil move should draw stroke
statusReason: Expected spy CanvasRenderingContext2D.lineTo to have been called with:
  [ 1, 0 ]
but actual calls were:
  [ 1, 4 ].

Call 0:
  Expected $[1] = 4 to equal 0.
Error: Expected spy CanvasRenderingContext2D.lineTo to have been called with:

[Killed] BlockStatement
src/app/classes/pencil.ts:42:19
         Tool.currentTopCtx.stroke();
     };
 
-    enter = () => {
-        Tool.currentTopCtx.beginPath();
-    };
+    enter = () => {};
 
     toString() {
killedBy: Pencil enter should call currentTopCtx.beginPath
statusReason: Expected spy CanvasRenderingContext2D.beginPath to have been called.

[Killed] BlockStatement
src/app/classes/pencil.ts:46:16
         Tool.currentTopCtx.beginPath();
     };
 
-    toString() {
-        return 'pencil';
-    }
+    toString() {}
 }
 
killedBy: Pencil toString should return "pencil
statusReason: Expected undefined to equal 'pencil'.

[Killed] StringLiteral
src/app/classes/pencil.ts:47:16
     };
 
     toString() {
-        return 'pencil';
+        return "";
     }
 }
killedBy: Pencil toString should return "pencil
statusReason: Expected '' to equal 'pencil'.
