[Killed] BlockStatement
src/app/classes/rectangle.ts:15:36
      *
      * @param event the mousedown event.
      */
-    start = (event: MouseEvent) => {
-        this.initialX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
-        this.initialY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
-
-        Tool.currentTopCtx.beginPath();
-    };
+    start = (event: MouseEvent) => {};
 
     stop = () => {
killedBy: Rectangle should set initial pixels and begin path
statusReason: Expected undefined to equal 1.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:16:25
      * @param event the mousedown event.
      */
     start = (event: MouseEvent) => {
-        this.initialX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
+        this.initialX = event.clientX + Tool.currentTopCtx.canvas.getBoundingClientRect().left;
         this.initialY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
killedBy: Rectangle should set initial pixels and begin path
statusReason: Expected 3 to equal 1.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:17:25
      */
     start = (event: MouseEvent) => {
         this.initialX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
-        this.initialY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
+        this.initialY = event.clientY + Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
         Tool.currentTopCtx.beginPath();
killedBy: Rectangle should set initial pixels and begin path
statusReason: Expected 4 to equal 0.

[Killed] BlockStatement
src/app/classes/rectangle.ts:22:18
         Tool.currentTopCtx.beginPath();
     };
 
-    stop = () => {
-        Tool.currentMiddleCtx.drawImage(Tool.currentTopCtx.canvas, 0, 0);
-        Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
-    };
+    stop = () => {};
 
     /**
killedBy: Rectangle should transfer drawing from layers
statusReason: TypeError: Cannot read properties of undefined (reading 'args')

[Killed] BlockStatement
src/app/classes/rectangle.ts:32:35
      *
      * @param event the mousemove event.
      */
-    move = (event: MouseEvent) => {
-        this.currentX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
-        this.currentY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
-
-        if (this.isSquare) this.drawSquare();
-        else this.drawRectangle();
-    };
+    move = (event: MouseEvent) => {};
 
     enter = (): string => {
killedBy: Rectangle move method should set current pixels
statusReason: Expected undefined to equal 1.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:33:25
      * @param event the mousemove event.
      */
     move = (event: MouseEvent) => {
-        this.currentX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
+        this.currentX = event.clientX + Tool.currentTopCtx.canvas.getBoundingClientRect().left;
         this.currentY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
killedBy: Rectangle move method should set current pixels
statusReason: Expected 3 to equal 1.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:34:25
      */
     move = (event: MouseEvent) => {
         this.currentX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
-        this.currentY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
+        this.currentY = event.clientY + Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
         if (this.isSquare) this.drawSquare();
killedBy: Rectangle move method should set current pixels
statusReason: Expected 4 to equal 0.

[Killed] ConditionalExpression
src/app/classes/rectangle.ts:36:13
         this.currentX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
         this.currentY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
-        if (this.isSquare) this.drawSquare();
+        if (false) this.drawSquare();
         else this.drawRectangle();
     };
killedBy: Rectangle move method should call drawSquare if isSquare is true
statusReason: Expected spy drawSquare to have been called.

[Killed] ConditionalExpression
src/app/classes/rectangle.ts:36:13
         this.currentX = event.clientX - Tool.currentTopCtx.canvas.getBoundingClientRect().left;
         this.currentY = event.clientY - Tool.currentTopCtx.canvas.getBoundingClientRect().top;
 
-        if (this.isSquare) this.drawSquare();
+        if (true) this.drawSquare();
         else this.drawRectangle();
     };
killedBy: Rectangle move method should call drawRectangle if isSquare is false
statusReason: Expected spy drawRectangle to have been called.

[Killed] BlockStatement
src/app/classes/rectangle.ts:40:27
         else this.drawRectangle();
     };
 
-    enter = (): string => {
-        return 'invalid tool';
-    };
+    enter = (): string => {};
 
     /**
killedBy: Rectangle should check if enter is a function
statusReason: Expected undefined to equal 'invalid tool'.

[Killed] BlockStatement
src/app/classes/rectangle.ts:48:24
      * Draws the square with the rectangle color.
      * Handles four cases according to the position of the initial click of the user and the direction he drags the rectangle toward.
      */
-    drawSquare(): void {
-        Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
-
-        const width = Math.abs(this.currentX - this.initialX);
-        const height = Math.abs(this.currentY - this.initialY);
-        const length = Math.min(width, height);
-        const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
-        const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
-
-        Tool.currentTopCtx.fillRect(x, y, length, length);
-        Tool.currentTopCtx.stroke();
-    }
+    drawSquare(): void {}
 
     /**
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but it was never called.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:51:32
     drawSquare(): void {
         Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
 
-        const width = Math.abs(this.currentX - this.initialX);
+        const width = Math.abs(this.currentX + this.initialX);
         const height = Math.abs(this.currentY - this.initialY);
         const length = Math.min(width, height);
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but actual calls were:
  [ 0, 10, 20, 20 ].

Call 0:
  Expected $[0] = 0 to equal 10.
  Expected $[1] = 10 to equal 20.

[Survived] ArithmeticOperator
src/app/classes/rectangle.ts:52:33
         Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
 
         const width = Math.abs(this.currentX - this.initialX);
-        const height = Math.abs(this.currentY - this.initialY);
+        const height = Math.abs(this.currentY + this.initialY);
         const length = Math.min(width, height);
         const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);

[Killed] MethodExpression
src/app/classes/rectangle.ts:53:24
 
         const width = Math.abs(this.currentX - this.initialX);
         const height = Math.abs(this.currentY - this.initialY);
-        const length = Math.min(width, height);
+        const length = Math.max(width, height);
         const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
         const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but actual calls were:
  [ 0, 10, 20, 20 ].

Call 0:
  Expected $[0] = 0 to equal 10.
  Expected $[1] = 10 to equal 20.

[Killed] UnaryOperator
src/app/classes/rectangle.ts:54:72
         const width = Math.abs(this.currentX - this.initialX);
         const height = Math.abs(this.currentY - this.initialY);
         const length = Math.min(width, height);
-        const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
+        const x = this.initialX + (this.currentX > this.initialX ? 0 : +length);
         const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
 
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but actual calls were:
  [ 30, 20, 10, 10 ].

Call 0:
  Expected $[0] = 30 to equal 10.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] EqualityOperator
src/app/classes/rectangle.ts:54:36
         const width = Math.abs(this.currentX - this.initialX);
         const height = Math.abs(this.currentY - this.initialY);
         const length = Math.min(width, height);
-        const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
+        const x = this.initialX + (this.currentX <= this.initialX ? 0 : -length);
         const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
 
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but actual calls were:
  [ 20, 20, 10, 10 ].

Call 0:
  Expected $[0] = 20 to equal 10.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] UnaryOperator
src/app/classes/rectangle.ts:55:72
         const height = Math.abs(this.currentY - this.initialY);
         const length = Math.min(width, height);
         const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
-        const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
+        const y = this.initialY + (this.currentY > this.initialY ? 0 : +length);
 
         Tool.currentTopCtx.fillRect(x, y, length, length);
killedBy: Rectangle should call fillRect
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 10, 20, 10, 10 ]
but actual calls were:
  [ 10, 40, 10, 10 ].

Call 0:
  Expected $[1] = 40 to equal 20.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] ConditionalExpression
src/app/classes/rectangle.ts:55:36
         const height = Math.abs(this.currentY - this.initialY);
         const length = Math.min(width, height);
         const x = this.initialX + (this.currentX > this.initialX ? 0 : -length);
-        const y = this.initialY + (this.currentY > this.initialY ? 0 : -length);
+        const y = this.initialY + (false ? 0 : -length);
 
         Tool.currentTopCtx.fillRect(x, y, length, length);
killedBy: Rectangle drawSquare branch should set const x and const y to other values
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 0, 0, 1, 1 ]
but actual calls were:
  [ 0, -1, 1, 1 ].

Call 0:
  Expected $[1] = -1 to equal 0.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] BlockStatement
src/app/classes/rectangle.ts:64:27
     /**
      * Draws a rectangle with the rectangle color.
      */
-    drawRectangle(): void {
-        Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
-        Tool.currentTopCtx.fillStyle = Tool.rectangleColor;
-        Tool.currentTopCtx.fillRect(this.initialX, this.initialY, this.currentX - this.initialX, this.currentY - this.initialY);
-        Tool.currentTopCtx.stroke();
-    }
+    drawRectangle(): void {}
 
     toString() {
killedBy: Rectangle should transfer shape between layers
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, 0, 3, 3 ]
but it was never called.

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:67:67
     drawRectangle(): void {
         Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
         Tool.currentTopCtx.fillStyle = Tool.rectangleColor;
-        Tool.currentTopCtx.fillRect(this.initialX, this.initialY, this.currentX - this.initialX, this.currentY - this.initialY);
+        Tool.currentTopCtx.fillRect(this.initialX, this.initialY, this.currentX + this.initialX, this.currentY - this.initialY);
         Tool.currentTopCtx.stroke();
     }
killedBy: Rectangle should transfer shape between layers
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 20, 30, -10, -20 ]
but actual calls were:
  [ 20, 30, 30, -20 ].

Call 0:
  Expected $[2] = 30 to equal -10.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] ArithmeticOperator
src/app/classes/rectangle.ts:67:98
     drawRectangle(): void {
         Tool.currentTopCtx.clearRect(0, 0, Tool.currentTopCtx.canvas.width, Tool.currentTopCtx.canvas.height);
         Tool.currentTopCtx.fillStyle = Tool.rectangleColor;
-        Tool.currentTopCtx.fillRect(this.initialX, this.initialY, this.currentX - this.initialX, this.currentY - this.initialY);
+        Tool.currentTopCtx.fillRect(this.initialX, this.initialY, this.currentX - this.initialX, this.currentY + this.initialY);
         Tool.currentTopCtx.stroke();
     }
killedBy: Rectangle should transfer shape between layers
statusReason: Expected spy CanvasRenderingContext2D.fillRect to have been called with:
  [ 20, 30, -10, -20 ]
but actual calls were:
  [ 20, 30, -10, 40 ].

Call 0:
  Expected $[3] = 40 to equal -20.
Error: Expected spy CanvasRenderingContext2D.fillRect to have been called with:

[Killed] BlockStatement
src/app/classes/rectangle.ts:71:16
         Tool.currentTopCtx.stroke();
     }
 
-    toString() {
-        return 'rectangle';
-    }
+    toString() {}
 }
 
killedBy: Rectangle toString should return "rectangle; DrawService should have a getter for the active tool
statusReason: Expected undefined to equal 'rectangle'.
