[Killed] BlockStatement
src/app/classes/socket-test-helper.ts:6:58
 };
 
 export class SocketTestHelper {
-    on(event: string, callback: CallbackSignature): void {
-        if (!this.callbacks.has(event)) {
-            this.callbacks.set(event, []);
-        }
-
-        (this.callbacks.get(event) as CallbackSignature[]).push(callback);
-    }
+    on(event: string, callback: CallbackSignature): void {}
 
     // eslint-disable-next-line no-unused-vars, @typescript-eslint/no-explicit-any
killedBy: CounterService should handle difference found; GameSocketService Receiving events should call next on usernameValidity; ProgressCounterServiceService should init attributes 
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BooleanLiteral
src/app/classes/socket-test-helper.ts:7:13
 
 export class SocketTestHelper {
     on(event: string, callback: CallbackSignature): void {
-        if (!this.callbacks.has(event)) {
+        if (this.callbacks.has(event)) {
             this.callbacks.set(event, []);
         }
killedBy: CounterService should handle difference found; GameSocketService should be created; ProgressCounterServiceService should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/app/classes/socket-test-helper.ts:7:41
 
 export class SocketTestHelper {
     on(event: string, callback: CallbackSignature): void {
-        if (!this.callbacks.has(event)) {
-            this.callbacks.set(event, []);
-        }
+        if (!this.callbacks.has(event)) {}
 
         (this.callbacks.get(event) as CallbackSignature[]).push(callback);
killedBy: CounterService should handle difference found; GameSocketService should be created; ProgressCounterServiceService should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Survived] BlockStatement
src/app/classes/socket-test-helper.ts:15:47
     }
 
     // eslint-disable-next-line no-unused-vars, @typescript-eslint/no-explicit-any
-    emit(event: string, ...params: any): void {
-        return;
-    }
+    emit(event: string, ...params: any): void {}
 
     disconnect(): void {

[Survived] BlockStatement
src/app/classes/socket-test-helper.ts:19:24
         return;
     }
 
-    disconnect(): void {
-        return;
-    }
+    disconnect(): void {}
 
     peerSideEmit(event: string, params?: unknown) {

[Killed] BlockStatement
src/app/classes/socket-test-helper.ts:23:51
         return;
     }
 
-    peerSideEmit(event: string, params?: unknown) {
-        if (!this.callbacks.has(event)) {
-            return;
-        }
-
-        // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
-        for (const callback of this.callbacks.get(event)!) {
-            callback(params);
-        }
-    }
+    peerSideEmit(event: string, params?: unknown) {}
 
     // eslint-disable-next-line @typescript-eslint/member-ordering
killedBy: CounterService should handle difference found; GameSocketService Receiving events should call next on usernameValidity; ProgressCounterServiceService should init attributes 
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BlockStatement
src/app/classes/socket-test-helper.ts:24:41
     }
 
     peerSideEmit(event: string, params?: unknown) {
-        if (!this.callbacks.has(event)) {
-            return;
-        }
+        if (!this.callbacks.has(event)) {}
 
         // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
killedBy: VsOptionService should handle joining a waitingroom
statusReason: TypeError: this.callbacks.get is not a function or its return value is not iterable

[Killed] ConditionalExpression
src/app/classes/socket-test-helper.ts:24:13
     }
 
     peerSideEmit(event: string, params?: unknown) {
-        if (!this.callbacks.has(event)) {
+        if (false) {
             return;
         }
killedBy: VsOptionService should handle joining a waitingroom
statusReason: TypeError: this.callbacks.get is not a function or its return value is not iterable

[Killed] BlockStatement
src/app/classes/socket-test-helper.ts:29:60
         }
 
         // eslint-disable-next-line @typescript-eslint/no-non-null-assertion
-        for (const callback of this.callbacks.get(event)!) {
-            callback(params);
-        }
+        for (const callback of this.callbacks.get(event)!) {}
     }
 
killedBy: CounterService should handle difference found; GameSocketService Receiving events should call next on usernameValidity; ProgressCounterServiceService should init attributes 
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.
