[Killed] BlockStatement
src/app/classes/test-files-helper.ts:6:62
     providedIn: 'root',
 })
 export class TestFilesHelper {
-    static async createFile(fileName: string): Promise<File> {
-        const imgUrl = await fetch('/base/src/assets/compare_service_test_assets/' + fileName);
-        const buffer = await imgUrl.arrayBuffer();
-        return new File([buffer], fileName, { type: 'image/' + fileName.split('.')[1] });
-    }
+    static async createFile(fileName: string): Promise<File> {}
 }
 
killedBy: CompareService drawImage method should not display and return 'Le fichier doit être dans un format BMP' with 'image_wrong_format.jpeg'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: TypeError: Failed to execute 'readAsArrayBuffer' on 'FileReader': parameter 1 is not of type 'Blob'.

[Killed] ArrayDeclaration
src/app/classes/test-files-helper.ts:9:25
     static async createFile(fileName: string): Promise<File> {
         const imgUrl = await fetch('/base/src/assets/compare_service_test_assets/' + fileName);
         const buffer = await imgUrl.arrayBuffer();
-        return new File([buffer], fileName, { type: 'image/' + fileName.split('.')[1] });
+        return new File([], fileName, { type: 'image/' + fileName.split('.')[1] });
     }
 }
killedBy: CompareService drawImage method should not display and return 'Le fichier doit être dans un format BMP' with 'image_wrong_format.jpeg'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: RangeError: Offset is outside the bounds of the DataView

[Survived] StringLiteral
src/app/classes/test-files-helper.ts:9:79
     static async createFile(fileName: string): Promise<File> {
         const imgUrl = await fetch('/base/src/assets/compare_service_test_assets/' + fileName);
         const buffer = await imgUrl.arrayBuffer();
-        return new File([buffer], fileName, { type: 'image/' + fileName.split('.')[1] });
+        return new File([buffer], fileName, { type: 'image/' + fileName.split("")[1] });
     }
 }
