[Killed] BlockStatement
src/app/classes/test-layers-helper.ts:6:40
     providedIn: 'root',
 })
 export class TestLayersHelper {
-    static createLayers(left: boolean) {
-        const dimension = left ? 1 : 2;
-
-        const layers = {
-            image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
-            diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
-            clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),
-        };
-        const leftImage = document.createElement('canvas');
-        leftImage.width = dimension;
-        leftImage.height = dimension;
-        Object.defineProperty(layers.image, 'canvas', {
-            get: () => {
-                return leftImage;
-            },
-        });
-
-        return layers;
-    }
+    static createLayers(left: boolean) {}
 }
 
killedBy: gameFeedback should be created; PlaybackService should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'image')

[Killed] StringLiteral
src/app/classes/test-layers-helper.ts:10:70
         const dimension = left ? 1 : 2;
 
         const layers = {
-            image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
+            image: jasmine.createSpyObj('CanvasRenderingContext2D', ["", 'drawImage'], ['canvas']),
             diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
             clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),
killedBy: gameFeedback should be created; PlaybackService should be created
statusReason: TypeError: Cannot read properties of undefined (reading 'and')

[Survived] StringLiteral
src/app/classes/test-layers-helper.ts:10:41
         const dimension = left ? 1 : 2;
 
         const layers = {
-            image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
+            image: jasmine.createSpyObj("", ['getImageData', 'drawImage'], ['canvas']),
             diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
             clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),

[Killed] StringLiteral
src/app/classes/test-layers-helper.ts:11:69
 
         const layers = {
             image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
-            diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
+            diff: jasmine.createSpyObj('CanvasRenderingContext2D', ["", 'clearRect']),
             clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),
         };
killedBy: gameFeedback drawOnCanvas method should call fillRect with correct values
statusReason: TypeError: context.fillRect is not a function

[Killed] ArrayDeclaration
src/app/classes/test-layers-helper.ts:12:68
         const layers = {
             image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
             diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
-            clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),
+            clue: jasmine.createSpyObj('CanvasRenderingContext2D', []),
         };
         const leftImage = document.createElement('canvas');
killedBy: gameFeedback should be created; PlaybackService should be created
statusReason: createSpyObj requires a non-empty array or object of method names to create spies for thrown

[Survived] StringLiteral
src/app/classes/test-layers-helper.ts:12:104
         const layers = {
             image: jasmine.createSpyObj('CanvasRenderingContext2D', ['getImageData', 'drawImage'], ['canvas']),
             diff: jasmine.createSpyObj('CanvasRenderingContext2D', ['fillRect', 'clearRect']),
-            clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', 'fillStyle']),
+            clue: jasmine.createSpyObj('CanvasRenderingContext2D', ['canvas', 'clearRect', 'fillRect', ""]),
         };
         const leftImage = document.createElement('canvas');

[Survived] BlockStatement
src/app/classes/test-layers-helper.ts:18:24
         leftImage.width = dimension;
         leftImage.height = dimension;
         Object.defineProperty(layers.image, 'canvas', {
-            get: () => {
-                return leftImage;
-            },
+            get: () => {},
         });
 
