[Killed] BlockStatement
app/components/abandon-pop-up/abandon-pop-up.component.ts:13:18
 export class AbandonPopUpComponent {
     constructor(private playback: PlaybackService, private router: Router) {}
 
-    quit(): void {
-        this.playback.clearPlayback();
-        this.router.navigate(['/home']);
-    }
+    quit(): void {}
 }
 
killedBy: AbandonPopUpComponent should quit and navigate on quit()
statusReason: Expected spy clearPlayback to have been called.

[Killed] ArrayDeclaration
app/components/abandon-pop-up/abandon-pop-up.component.ts:15:30
 
     quit(): void {
         this.playback.clearPlayback();
-        this.router.navigate(['/home']);
+        this.router.navigate([]);
     }
 }
killedBy: AbandonPopUpComponent should quit and navigate on quit()
statusReason: Expected spy Router.navigate to have been called with:
  [ [ '/home' ] ]
but actual calls were:
  [ [  ] ].

Call 0:
  Expected $[0].length = 0 to equal 1.
  Expected $[0][0] = undefined to equal '/home'.
