[Survived] BlockStatement
app/components/chat/chat.component.ts:17:96
     messages: MessageComponent[];
     message: string;
 
-    constructor(public gameSocket: GameSocketService, public playbackService: PlaybackService) {
-        this.userIsTyping = new EventEmitter<boolean>();
-        this.messages = this.gameSocket.messages;
-        this.message = '';
-    }
+    constructor(public gameSocket: GameSocketService, public playbackService: PlaybackService) {}
 
     addMessage(text: string) {

[Killed] BlockStatement
app/components/chat/chat.component.ts:23:30
         this.message = '';
     }
 
-    addMessage(text: string) {
-        if (text.length === 0) return;
-        this.gameSocket.handleChatMessageSent(text);
-        this.message = '';
-    }
+    addMessage(text: string) {}
 }
 
killedBy: ChatComponent should addMessage
statusReason: Expected spy unknown to have been called with:
  [ 'test' ]
but it was never called.

[Killed] EqualityOperator
app/components/chat/chat.component.ts:24:13
     }
 
     addMessage(text: string) {
-        if (text.length === 0) return;
+        if (text.length !== 0) return;
         this.gameSocket.handleChatMessageSent(text);
         this.message = '';
killedBy: ChatComponent should addMessage
statusReason: Expected spy unknown to have been called with:
  [ 'test' ]
but it was never called.

[Killed] ConditionalExpression
app/components/chat/chat.component.ts:24:13
     }
 
     addMessage(text: string) {
-        if (text.length === 0) return;
+        if (true) return;
         this.gameSocket.handleChatMessageSent(text);
         this.message = '';
killedBy: ChatComponent should addMessage
statusReason: Expected spy unknown to have been called with:
  [ 'test' ]
but it was never called.

[Killed] StringLiteral
app/components/chat/chat.component.ts:26:24
     addMessage(text: string) {
         if (text.length === 0) return;
         this.gameSocket.handleChatMessageSent(text);
-        this.message = '';
+        this.message = "Stryker was here!";
     }
 }
killedBy: ChatComponent should addMessage
statusReason: Expected 'Stryker was here!' to equal ''.
