[Survived] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:25:7
         @Inject(MAT_DIALOG_DATA) public data: { canvas: HTMLCanvasElement },
         private compareService: CompareService,
         private dialogRef: MatDialogRef<ComparePopupComponent>,
-    ) {
-        this.title = '';
-        this.difficulty = '';
-        this.displayedMessage = '';
-    }
+    ) {}
 
     /**

[Survived] StringLiteral
components/creation-page/compare-popup/compare-popup.component.ts:27:27
         private dialogRef: MatDialogRef<ComparePopupComponent>,
     ) {
         this.title = '';
-        this.difficulty = '';
+        this.difficulty = "Stryker was here!";
         this.displayedMessage = '';
     }

[Survived] StringLiteral
components/creation-page/compare-popup/compare-popup.component.ts:28:33
     ) {
         this.title = '';
         this.difficulty = '';
-        this.displayedMessage = '';
+        this.displayedMessage = "Stryker was here!";
     }
 

[Survived] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:35:22
      * Validates the differences between the two canvases.
      * Called when the pop-up component is initialized.
      */
-    ngOnInit(): void {
-        this.onValidate();
-    }
+    ngOnInit(): void {}
 
     /**

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:43:29
      * Adds the canvas element to the DOM to show the differences between the canvases.
      * Called after the pop-up component is initialized.
      */
-    ngAfterViewInit(): void {
-        this.content.nativeElement.appendChild(this.data.canvas);
-    }
+    ngAfterViewInit(): void {}
 
     /**
killedBy: ComparePopupComponent should have a canvas
statusReason: Expected 0 to be 1.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:52:24
      * Changes the message to be displayed on the pop-up if the number of differences is invalid.
      * Called when the user clicks on the comparison button.
      */
-    onValidate(): void {
-        const { difficulty, nbDifferences } = this.compareService.validateDifferences();
-        this.difficulty = difficulty;
-
-        this.displayedMessage =
-            this.difficulty === 'invalide'
-                ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
-                  (nbDifferences <= 1 ? '' : 's') +
-                  ', veuillez en générer entre 3 et 9).'
-                : 'Niveau : ' + this.difficulty + ' avec ' + nbDifferences + ' différences.';
-    }
+    onValidate(): void {}
 
     /**
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected '' to equal 'Erreur : nombre de différences invalide (10 trouvées, veuillez en générer entre 3 et 9).'.

[Killed] EqualityOperator
components/creation-page/compare-popup/compare-popup.component.ts:57:13
         this.difficulty = difficulty;
 
         this.displayedMessage =
-            this.difficulty === 'invalide'
+            this.difficulty !== 'invalide'
                 ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
                   (nbDifferences <= 1 ? '' : 's') +
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected 'Niveau : invalide avec 10 différences.' to equal 'Erreur : nombre de différences invalide (10 trouvées, veuillez en générer entre 3 et 9).'.

[Killed] ConditionalExpression
components/creation-page/compare-popup/compare-popup.component.ts:57:13
         this.difficulty = difficulty;
 
         this.displayedMessage =
-            this.difficulty === 'invalide'
+            true
                 ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
                   (nbDifferences <= 1 ? '' : 's') +
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected 'Erreur : nombre de différences invalide (8 trouvées, veuillez en générer entre 3 et 9).' to equal 'Niveau : difficile avec 8 différences.'.

[Killed] ConditionalExpression
components/creation-page/compare-popup/compare-popup.component.ts:59:20
         this.displayedMessage =
             this.difficulty === 'invalide'
                 ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
-                  (nbDifferences <= 1 ? '' : 's') +
+                  (true ? '' : 's') +
                   ', veuillez en générer entre 3 et 9).'
                 : 'Niveau : ' + this.difficulty + ' avec ' + nbDifferences + ' différences.';
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected 'Erreur : nombre de différences invalide (10 trouvée, veuillez en générer entre 3 et 9).' to equal 'Erreur : nombre de différences invalide (10 trouvées, veuillez en générer entre 3 et 9).'.

[Killed] EqualityOperator
components/creation-page/compare-popup/compare-popup.component.ts:59:20
         this.displayedMessage =
             this.difficulty === 'invalide'
                 ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
-                  (nbDifferences <= 1 ? '' : 's') +
+                  (nbDifferences > 1 ? '' : 's') +
                   ', veuillez en générer entre 3 et 9).'
                 : 'Niveau : ' + this.difficulty + ' avec ' + nbDifferences + ' différences.';
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected 'Erreur : nombre de différences invalide (10 trouvée, veuillez en générer entre 3 et 9).' to equal 'Erreur : nombre de différences invalide (10 trouvées, veuillez en générer entre 3 et 9).'.

[Killed] StringLiteral
components/creation-page/compare-popup/compare-popup.component.ts:61:78
                 ? `Erreur : nombre de différences invalide (${nbDifferences} trouvée` +
                   (nbDifferences <= 1 ? '' : 's') +
                   ', veuillez en générer entre 3 et 9).'
-                : 'Niveau : ' + this.difficulty + ' avec ' + nbDifferences + ' différences.';
+                : 'Niveau : ' + this.difficulty + ' avec ' + nbDifferences + "";
     }
 
killedBy: ComparePopupComponent onValidate should set the displayed message correctly
statusReason: Expected 'Niveau : difficile avec 8' to equal 'Niveau : difficile avec 8 différences.'.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:69:22
      * If the title already exists, an error message is displayed.
      * Called when the user clicks on the confirmation button.
      */
-    onSubmit(): void {
-        this.compareService.createGame(this.title, this.difficulty).subscribe((exists) => {
-            if (!exists) this.dialogRef.close(true);
-            else this.displayedMessage = 'Erreur: ce titre existe déjà.';
-        });
-    }
+    onSubmit(): void {}
 
     /**
killedBy: ComparePopupComponent onSubmit should not create a game if title exists
statusReason: Expected 'Erreur : nombre de différences invalide (0 trouvée, veuillez en générer entre 3 et 9).' to equal 'Erreur: ce titre existe déjà.'.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:70:91
      * Called when the user clicks on the confirmation button.
      */
     onSubmit(): void {
-        this.compareService.createGame(this.title, this.difficulty).subscribe((exists) => {
-            if (!exists) this.dialogRef.close(true);
-            else this.displayedMessage = 'Erreur: ce titre existe déjà.';
-        });
+        this.compareService.createGame(this.title, this.difficulty).subscribe((exists) => {});
     }
 
killedBy: ComparePopupComponent onSubmit should not create a game if title exists
statusReason: Expected 'Erreur : nombre de différences invalide (0 trouvée, veuillez en générer entre 3 et 9).' to equal 'Erreur: ce titre existe déjà.'.

[Killed] BooleanLiteral
components/creation-page/compare-popup/compare-popup.component.ts:71:47
      */
     onSubmit(): void {
         this.compareService.createGame(this.title, this.difficulty).subscribe((exists) => {
-            if (!exists) this.dialogRef.close(true);
+            if (!exists) this.dialogRef.close(false);
             else this.displayedMessage = 'Erreur: ce titre existe déjà.';
         });
killedBy: ComparePopupComponent onSubmit should create a game if title doesn't exist
statusReason: Expected spy close to have been called with:
  [ true ]
but actual calls were:
  [ false ].

Call 0:
  Expected $[0] = false to equal true.
Error: Expected spy close to have been called with:

[Killed] ConditionalExpression
components/creation-page/compare-popup/compare-popup.component.ts:71:17
      */
     onSubmit(): void {
         this.compareService.createGame(this.title, this.difficulty).subscribe((exists) => {
-            if (!exists) this.dialogRef.close(true);
+            if (true) this.dialogRef.close(true);
             else this.displayedMessage = 'Erreur: ce titre existe déjà.';
         });
killedBy: ComparePopupComponent onSubmit should not create a game if title exists
statusReason: Expected 'Erreur : nombre de différences invalide (0 trouvée, veuillez en générer entre 3 et 9).' to equal 'Erreur: ce titre existe déjà.'.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:82:77
      *
      * @param input the input field
      */
-    onInput(input: HTMLInputElement, submitButton: HTMLButtonElement): void {
-        const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
-        let isValidInput = false;
-        this.title = input.value;
-        if (this.title.length > 0) isValidInput = true;
-
-        for (const char of prohibitedChars) {
-            if (this.title.includes(char)) {
-                isValidInput = false;
-            }
-        }
-        submitButton.disabled = !isValidInput;
-    }
+    onInput(input: HTMLInputElement, submitButton: HTMLButtonElement): void {}
 }
 
killedBy: ComparePopupComponent onInput should set title to the input value
statusReason: Expected '' to be 'test'.

[Killed] StringLiteral
components/creation-page/compare-popup/compare-popup.component.ts:83:75
      * @param input the input field
      */
     onInput(input: HTMLInputElement, submitButton: HTMLButtonElement): void {
-        const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
+        const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', "", '>', '|'];
         let isValidInput = false;
         this.title = input.value;
killedBy: ComparePopupComponent onSubmit should enable button with valid title
statusReason: Expected true to be false.

[Killed] StringLiteral
components/creation-page/compare-popup/compare-popup.component.ts:83:80
      * @param input the input field
      */
     onInput(input: HTMLInputElement, submitButton: HTMLButtonElement): void {
-        const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
+        const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', "", '|'];
         let isValidInput = false;
         this.title = input.value;
killedBy: ComparePopupComponent onSubmit should enable button with valid title
statusReason: Expected true to be false.

[Survived] BooleanLiteral
components/creation-page/compare-popup/compare-popup.component.ts:84:28
      */
     onInput(input: HTMLInputElement, submitButton: HTMLButtonElement): void {
         const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
-        let isValidInput = false;
+        let isValidInput = true;
         this.title = input.value;
         if (this.title.length > 0) isValidInput = true;

[Killed] BooleanLiteral
components/creation-page/compare-popup/compare-popup.component.ts:86:51
         const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
         let isValidInput = false;
         this.title = input.value;
-        if (this.title.length > 0) isValidInput = true;
+        if (this.title.length > 0) isValidInput = false;
 
         for (const char of prohibitedChars) {
killedBy: ComparePopupComponent onSubmit should enable button with valid title
statusReason: Expected true to be false.

[Killed] ConditionalExpression
components/creation-page/compare-popup/compare-popup.component.ts:86:13
         const prohibitedChars: string[] = ['/', '\\', ':', '*', '?', '"', '<', '>', '|'];
         let isValidInput = false;
         this.title = input.value;
-        if (this.title.length > 0) isValidInput = true;
+        if (false) isValidInput = true;
 
         for (const char of prohibitedChars) {
killedBy: ComparePopupComponent onSubmit should enable button with valid title
statusReason: Expected true to be false.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:88:45
         this.title = input.value;
         if (this.title.length > 0) isValidInput = true;
 
-        for (const char of prohibitedChars) {
-            if (this.title.includes(char)) {
-                isValidInput = false;
-            }
-        }
+        for (const char of prohibitedChars) {}
         submitButton.disabled = !isValidInput;
     }
killedBy: ComparePopupComponent onSubmit should disable button with invalid title
statusReason: Expected false to be true.

[Killed] BlockStatement
components/creation-page/compare-popup/compare-popup.component.ts:89:44
         if (this.title.length > 0) isValidInput = true;
 
         for (const char of prohibitedChars) {
-            if (this.title.includes(char)) {
-                isValidInput = false;
-            }
+            if (this.title.includes(char)) {}
         }
         submitButton.disabled = !isValidInput;
killedBy: ComparePopupComponent onSubmit should disable button with invalid title
statusReason: Expected false to be true.

[Killed] ConditionalExpression
components/creation-page/compare-popup/compare-popup.component.ts:89:17
         if (this.title.length > 0) isValidInput = true;
 
         for (const char of prohibitedChars) {
-            if (this.title.includes(char)) {
+            if (true) {
                 isValidInput = false;
             }
killedBy: ComparePopupComponent onSubmit should enable button with valid title
statusReason: Expected true to be false.

[Killed] BooleanLiteral
components/creation-page/compare-popup/compare-popup.component.ts:90:32
 
         for (const char of prohibitedChars) {
             if (this.title.includes(char)) {
-                isValidInput = false;
+                isValidInput = true;
             }
         }
killedBy: ComparePopupComponent onSubmit should disable button with invalid title
statusReason: Expected false to be true.

[Killed] BooleanLiteral
components/creation-page/compare-popup/compare-popup.component.ts:93:33
                 isValidInput = false;
             }
         }
-        submitButton.disabled = !isValidInput;
+        submitButton.disabled = isValidInput;
     }
 }
killedBy: ComparePopupComponent onSubmit should disable button with invalid title
statusReason: Expected false to be true.
