[Killed] BlockStatement
components/creation-page/custom-slider/custom-slider.component.ts:20:19
     /**
      * Sets the initial value of the slider to 3.
      */
-    constructor() {
-        this.newValueEvent = new EventEmitter<number>();
-        this.stepIndex = 1;
-        this.value = SliderConstants.Step1;
-        this.steps = [SliderConstants.Value0, SliderConstants.Value1, SliderConstants.Value2, SliderConstants.Value3];
-    }
+    constructor() {}
 
     /**
killedBy: CustomSliderComponent onInputChange should set stepIndex
statusReason: TypeError: Cannot read properties of undefined (reading 'emit')

[Killed] BlockStatement
components/creation-page/custom-slider/custom-slider.component.ts:33:58
      * @param $event the event that triggered the change.
      * @returns the value of the slider.
      */
-    onInputChange = ($event: MatSliderChange): string => {
-        if ($event.value !== null) {
-            this.stepIndex = $event.value;
-            this.newValueEvent.emit(this.steps[this.stepIndex]);
-        }
-
-        return this.steps[this.stepIndex].toString();
-    };
+    onInputChange = ($event: MatSliderChange): string => {};
 }
 
killedBy: CustomSliderComponent onInputChange should set stepIndex
statusReason: Expected 1 to equal 2.

[Killed] EqualityOperator
components/creation-page/custom-slider/custom-slider.component.ts:34:13
      * @returns the value of the slider.
      */
     onInputChange = ($event: MatSliderChange): string => {
-        if ($event.value !== null) {
+        if ($event.value === null) {
             this.stepIndex = $event.value;
             this.newValueEvent.emit(this.steps[this.stepIndex]);
killedBy: CustomSliderComponent onInputChange should set stepIndex
statusReason: Expected 1 to equal 2.

[Killed] BlockStatement
components/creation-page/custom-slider/custom-slider.component.ts:34:36
      * @returns the value of the slider.
      */
     onInputChange = ($event: MatSliderChange): string => {
-        if ($event.value !== null) {
-            this.stepIndex = $event.value;
-            this.newValueEvent.emit(this.steps[this.stepIndex]);
-        }
+        if ($event.value !== null) {}
 
         return this.steps[this.stepIndex].toString();
killedBy: CustomSliderComponent onInputChange should set stepIndex
statusReason: Expected 1 to equal 2.
