[Survived] BlockStatement
components/creation-page/download-button/download-button.component.ts:15:57
     /**
      * @param compareService the service to detect the differences between the canvases.
      */
-    constructor(private compareService: CompareService) {
-        this.uploadMessage = '';
-    }
+    constructor(private compareService: CompareService) {}
 
     /**

[Killed] BlockStatement
components/creation-page/download-button/download-button.component.ts:25:44
      *
      * @param input the input element that contains the image.
      */
-    async onInput(input: HTMLInputElement) {
-        this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
-        input.value = '';
-
-        if (this.uploadMessage !== '') {
-            alert(this.uploadMessage);
-        }
-    }
+    async onInput(input: HTMLInputElement) {}
 }
 
killedBy: DownloadButtonComponent onInput should call compareService.drawImage on input containing file
statusReason: Expected spy drawImage to have been called with:
  [ [object File] ]
but it was never called.

[Killed] ConditionalExpression
components/creation-page/download-button/download-button.component.ts:26:30
      * @param input the input element that contains the image.
      */
     async onInput(input: HTMLInputElement) {
-        this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
+        this.uploadMessage = false ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
         input.value = '';
 
killedBy: DownloadButtonComponent onInput should call compareService.drawImage on input containing file
statusReason: Expected spy drawImage to have been called with:
  [ [object File] ]
but it was never called.

[Killed] StringLiteral
components/creation-page/download-button/download-button.component.ts:26:116
      * @param input the input element that contains the image.
      */
     async onInput(input: HTMLInputElement) {
-        this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
+        this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : "";
         input.value = '';
 
killedBy: DownloadButtonComponent onInput should display "Fichier Introuvable" when no file is selected
statusReason: Expected '' to equal 'Fichier introuvable'.

[Survived] ConditionalExpression
components/creation-page/download-button/download-button.component.ts:29:13
         this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
         input.value = '';
 
-        if (this.uploadMessage !== '') {
+        if (false) {
             alert(this.uploadMessage);
         }

[Survived] BlockStatement
components/creation-page/download-button/download-button.component.ts:29:40
         this.uploadMessage = input.files && input.files[0] ? await this.compareService.drawImage(input.files[0]) : 'Fichier introuvable';
         input.value = '';
 
-        if (this.uploadMessage !== '') {
-            alert(this.uploadMessage);
-        }
+        if (this.uploadMessage !== '') {}
     }
 }
