[Survived] BlockStatement
components/creation-page/image-input/image-input.component.ts:20:109
      * @param canvasManagerService the service to manage the actions that apply to both canvases.
      * @param compareService the service to detect the differences between the canvases.
      */
-    constructor(private canvasManagerService: CanvasManagerService, private compareService: CompareService) {
-        this.uploadMessage = '';
-    }
+    constructor(private canvasManagerService: CanvasManagerService, private compareService: CompareService) {}
 
     /**

[Killed] BlockStatement
components/creation-page/image-input/image-input.component.ts:31:71
      * @param input the input element that contains the image.
      * @param canvas the canvas element that will contain the image.
      */
-    async onInput(input: HTMLInputElement, canvas: HTMLCanvasElement) {
-        this.uploadMessage =
-            input.files && input.files[0]
-                ? await this.compareService.drawImage(input.files[0], canvas.getContext('2d') as CanvasRenderingContext2D)
-                : 'Fichier introuvable';
-        input.value = '';
-        if (this.uploadMessage !== '') {
-            alert(this.uploadMessage);
-        }
-    }
+    async onInput(input: HTMLInputElement, canvas: HTMLCanvasElement) {}
 
     /**
killedBy: ImageInputComponent onInput should call compareService.drawImage on input containing file
statusReason: Expected spy drawImage to have been called with:
  [ [object File], [object CanvasRenderingContext2D] ]
but it was never called.

[Killed] ConditionalExpression
components/creation-page/image-input/image-input.component.ts:33:13
      */
     async onInput(input: HTMLInputElement, canvas: HTMLCanvasElement) {
         this.uploadMessage =
-            input.files && input.files[0]
+            false
                 ? await this.compareService.drawImage(input.files[0], canvas.getContext('2d') as CanvasRenderingContext2D)
                 : 'Fichier introuvable';
killedBy: ImageInputComponent onInput should call compareService.drawImage on input containing file
statusReason: Expected spy drawImage to have been called with:
  [ [object File], [object CanvasRenderingContext2D] ]
but it was never called.

[Killed] StringLiteral
components/creation-page/image-input/image-input.component.ts:35:19
         this.uploadMessage =
             input.files && input.files[0]
                 ? await this.compareService.drawImage(input.files[0], canvas.getContext('2d') as CanvasRenderingContext2D)
-                : 'Fichier introuvable';
+                : "";
         input.value = '';
         if (this.uploadMessage !== '') {
killedBy: ImageInputComponent onInput should display "Fichier Introuvable" when no file is selected
statusReason: Expected '' to equal 'Fichier introuvable'.

[Survived] BlockStatement
components/creation-page/image-input/image-input.component.ts:37:40
                 ? await this.compareService.drawImage(input.files[0], canvas.getContext('2d') as CanvasRenderingContext2D)
                 : 'Fichier introuvable';
         input.value = '';
-        if (this.uploadMessage !== '') {
-            alert(this.uploadMessage);
-        }
+        if (this.uploadMessage !== '') {}
     }
 

[Survived] EqualityOperator
components/creation-page/image-input/image-input.component.ts:37:13
                 ? await this.compareService.drawImage(input.files[0], canvas.getContext('2d') as CanvasRenderingContext2D)
                 : 'Fichier introuvable';
         input.value = '';
-        if (this.uploadMessage !== '') {
+        if (this.uploadMessage === '') {
             alert(this.uploadMessage);
         }

[Killed] BlockStatement
components/creation-page/image-input/image-input.component.ts:48:49
      *
      * @param canvas the canvas element that contains the image to be cleared.
      */
-    clearImage(canvas: HTMLCanvasElement): void {
-        const canvasContext = canvas.getContext('2d') as CanvasRenderingContext2D;
-        canvasContext.fillStyle = 'white';
-        canvasContext.fillRect(0, 0, canvas.width, canvas.height);
-    }
+    clearImage(canvas: HTMLCanvasElement): void {}
 
     /**
killedBy: ImageInputComponent clearImage should set canvas to be white
statusReason: Expected spy fillRect to have been called.

[Killed] StringLiteral
components/creation-page/image-input/image-input.component.ts:50:35
      */
     clearImage(canvas: HTMLCanvasElement): void {
         const canvasContext = canvas.getContext('2d') as CanvasRenderingContext2D;
-        canvasContext.fillStyle = 'white';
+        canvasContext.fillStyle = "";
         canvasContext.fillRect(0, 0, canvas.width, canvas.height);
     }
killedBy: ImageInputComponent clearImage should set canvas to be white
statusReason: Expected '#000000' to equal '#ffffff'.

[Killed] BlockStatement
components/creation-page/image-input/image-input.component.ts:58:26
      * Resets the second layer of the canvas (the drawings).
      * Called when the user clicks on the reset button (loop icon on either side).
      */
-    resetOverlay(): void {
-        this.canvasManagerService.resetOverlay(this.canvas.nativeElement);
-    }
+    resetOverlay(): void {}
 }
 
killedBy: ImageInputComponent resetOverlay should call the resetOverlay method of the CanvasManagerService
statusReason: Expected spy resetOverlay to have been called.
