[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:40:7
         private drawService: DrawService,
         private historyService: HistoryService,
         private router: Router,
-    ) {
-        this.precision = 3;
-        this.differencesCanvas = document.createElement('canvas');
-    }
+    ) {}
 
     /**
killedBy: ToolbarComponent should create; CreationComponent should iniitialize the canvases
statusReason: TypeError: Cannot set properties of undefined (setting 'width')

[Killed] StringLiteral
components/creation-page/toolbar/toolbar.component.ts:42:57
         private router: Router,
     ) {
         this.precision = 3;
-        this.differencesCanvas = document.createElement('canvas');
+        this.differencesCanvas = document.createElement("");
     }
 
killedBy: ToolbarComponent should create; CreationComponent should iniitialize the canvases
statusReason: InvalidCharacterError: Failed to execute 'createElement' on 'Document': The tag name provided ('') is not a valid name.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:50:29
      * Sets the dimensions of the comparison canvas to default values (640px x 480px).
      * Initializes the comparison canvas of the CompareService.
      */
-    ngAfterViewInit(): void {
-        this.differencesCanvas.width = ImageConstants.DefaultWidth;
-        this.differencesCanvas.height = ImageConstants.DefaultHeight;
-        this.compareService.initDifferencesCanvas(this.differencesCanvas.getContext('2d') as CanvasRenderingContext2D);
-
-        this.iconContainers = new Map();
-        ['pencil', 'rectangle', 'eraser'].forEach((tool) =>
-            this.iconContainers.set(tool, this.toolbar.nativeElement.querySelector(`#${tool}`).parentElement),
-        );
-    }
+    ngAfterViewInit(): void {}
 
     /**
killedBy: ToolbarComponent should toggle the tool in the DrawService when a tool is selected
statusReason: Error: <spyOn> : could not find an object to spy upon for get()
Usage: spyOn(<object>, <methodName>)

[Survived] ArrowFunction
components/creation-page/toolbar/toolbar.component.ts:56:51
         this.compareService.initDifferencesCanvas(this.differencesCanvas.getContext('2d') as CanvasRenderingContext2D);
 
         this.iconContainers = new Map();
-        ['pencil', 'rectangle', 'eraser'].forEach((tool) =>
-            this.iconContainers.set(tool, this.toolbar.nativeElement.querySelector(`#${tool}`).parentElement),
+        ['pencil', 'rectangle', 'eraser'].forEach(() => undefined,
         );
     }

[Killed] StringLiteral
components/creation-page/toolbar/toolbar.component.ts:56:20
         this.compareService.initDifferencesCanvas(this.differencesCanvas.getContext('2d') as CanvasRenderingContext2D);
 
         this.iconContainers = new Map();
-        ['pencil', 'rectangle', 'eraser'].forEach((tool) =>
+        ['pencil', "", 'eraser'].forEach((tool) =>
             this.iconContainers.set(tool, this.toolbar.nativeElement.querySelector(`#${tool}`).parentElement),
         );
killedBy: ToolbarComponent should create; CreationComponent should iniitialize the canvases
statusReason: SyntaxError: Failed to execute 'querySelector' on 'Element': '#' is not a valid selector.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:66:21
      * Draws the differences between the two canvases on the comparison canvas.
      * Opens a dialog to display the comparison canvas.
      */
-    compare(): void {
-        this.compareService.mergeCanvases();
-        this.compareService.drawDifferences(this.precision);
-        const dialogRef = this.dialog.open(ComparePopupComponent, { data: { canvas: this.differencesCanvas }, panelClass: 'container' });
-        dialogRef.afterClosed().subscribe((result: boolean) => {
-            if (result) this.router.navigate(['/config']);
-        });
-    }
+    compare(): void {}
 
     /**
killedBy: ToolbarComponent compare method should merge the canvas layers and draws the differences on the difference canvas with the correct precision
statusReason: Expected spy CompareService.mergeCanvases to have been called.

[Survived] ObjectLiteral
components/creation-page/toolbar/toolbar.component.ts:69:75
     compare(): void {
         this.compareService.mergeCanvases();
         this.compareService.drawDifferences(this.precision);
-        const dialogRef = this.dialog.open(ComparePopupComponent, { data: { canvas: this.differencesCanvas }, panelClass: 'container' });
+        const dialogRef = this.dialog.open(ComparePopupComponent, { data: {}, panelClass: 'container' });
         dialogRef.afterClosed().subscribe((result: boolean) => {
             if (result) this.router.navigate(['/config']);

[Survived] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:70:64
         this.compareService.mergeCanvases();
         this.compareService.drawDifferences(this.precision);
         const dialogRef = this.dialog.open(ComparePopupComponent, { data: { canvas: this.differencesCanvas }, panelClass: 'container' });
-        dialogRef.afterClosed().subscribe((result: boolean) => {
-            if (result) this.router.navigate(['/config']);
-        });
+        dialogRef.afterClosed().subscribe((result: boolean) => {});
     }
 

[Survived] ConditionalExpression
components/creation-page/toolbar/toolbar.component.ts:71:17
         this.compareService.drawDifferences(this.precision);
         const dialogRef = this.dialog.open(ComparePopupComponent, { data: { canvas: this.differencesCanvas }, panelClass: 'container' });
         dialogRef.afterClosed().subscribe((result: boolean) => {
-            if (result) this.router.navigate(['/config']);
+            if (true) this.router.navigate(['/config']);
         });
     }

[Survived] ConditionalExpression
components/creation-page/toolbar/toolbar.component.ts:71:17
         this.compareService.drawDifferences(this.precision);
         const dialogRef = this.dialog.open(ComparePopupComponent, { data: { canvas: this.differencesCanvas }, panelClass: 'container' });
         dialogRef.afterClosed().subscribe((result: boolean) => {
-            if (result) this.router.navigate(['/config']);
+            if (false) this.router.navigate(['/config']);
         });
     }

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:80:45
      *
      * @param $event The new precision value.
      */
-    onPrecisionChange($event: number): void {
-        if ($event === null || this.precision === $event) return;
-        else this.precision = $event;
-    }
+    onPrecisionChange($event: number): void {}
 
     /**
killedBy: ToolbarComponent onPrecisionChange should set precision to the input value
statusReason: Expected 3 to equal 2.

[Killed] EqualityOperator
components/creation-page/toolbar/toolbar.component.ts:81:32
      * @param $event The new precision value.
      */
     onPrecisionChange($event: number): void {
-        if ($event === null || this.precision === $event) return;
+        if ($event === null || this.precision !== $event) return;
         else this.precision = $event;
     }
killedBy: ToolbarComponent onPrecisionChange should set precision to the input value
statusReason: Expected 3 to equal 2.

[Killed] EqualityOperator
components/creation-page/toolbar/toolbar.component.ts:81:13
      * @param $event The new precision value.
      */
     onPrecisionChange($event: number): void {
-        if ($event === null || this.precision === $event) return;
+        if ($event !== null || this.precision === $event) return;
         else this.precision = $event;
     }
killedBy: ToolbarComponent onPrecisionChange should set precision to the input value
statusReason: Expected 3 to equal 2.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:92:36
      *
      * @param tool The tool to toggle.
      */
-    toggleTool(tool: string): void {
-        this.drawService.toggleTool(tool);
-        this.iconContainers.forEach((container) => container.classList.remove('active'));
-        this.iconContainers.get(this.drawService.tool)?.classList.add('active');
-    }
+    toggleTool(tool: string): void {}
 
     /**
killedBy: ToolbarComponent should toggle the tool in the DrawService when a tool is selected
statusReason: Expected spy DrawService.toggleTool to have been called with:
  [ 'pencil' ]
but it was never called.

[Survived] ArrowFunction
components/creation-page/toolbar/toolbar.component.ts:94:37
      */
     toggleTool(tool: string): void {
         this.drawService.toggleTool(tool);
-        this.iconContainers.forEach((container) => container.classList.remove('active'));
+        this.iconContainers.forEach(() => undefined);
         this.iconContainers.get(this.drawService.tool)?.classList.add('active');
     }

[Survived] OptionalChaining
components/creation-page/toolbar/toolbar.component.ts:95:9
     toggleTool(tool: string): void {
         this.drawService.toggleTool(tool);
         this.iconContainers.forEach((container) => container.classList.remove('active'));
-        this.iconContainers.get(this.drawService.tool)?.classList.add('active');
+        this.iconContainers.get(this.drawService.tool).classList.add('active');
     }
 

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:105:49
      * @param changeEvent The event that is triggered when the pencil color is changed.
      * The value of the event target is the new color of the pencil.
      */
-    changePencilColor(changeEvent: Event): void {
-        Tool.drawColor = (changeEvent.target as HTMLSelectElement).value;
-    }
+    changePencilColor(changeEvent: Event): void {}
 
     /**
killedBy: ToolbarComponent should change the color of the pencil when a color is selected
statusReason: Expected undefined to equal '#ffffff'.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:116:49
      * @param changeEvent The event that is triggered when the pencil width is changed.
      * The value of the event target is the new width of the pencil.
      */
-    changePencilWidth(changeEvent: Event): void {
-        Tool.drawWidth = parseInt((changeEvent.target as HTMLSelectElement).value, 10);
-    }
+    changePencilWidth(changeEvent: Event): void {}
 
     /**
killedBy: ToolbarComponent should change the width of the pencil when a width is selected
statusReason: Expected undefined to equal 3.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:127:52
      * @param changeEvent The event that is triggered when the rectangle color is changed.
      * The value of the event target is the new color of the rectangle.
      */
-    changeRectangleColor(changeEvent: Event): void {
-        Tool.rectangleColor = (changeEvent.target as HTMLSelectElement).value;
-    }
+    changeRectangleColor(changeEvent: Event): void {}
 
     /**
killedBy: ToolbarComponent should change the color of the rectangle when a color is selected
statusReason: Expected undefined to equal '#ffffff'.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:138:49
      * @param changeEvent The event that is triggered when the eraser width is changed.
      * The value of the event target is the new width of the eraser.
      */
-    changeEraserWidth(changeEvent: Event): void {
-        Tool.eraserWidth = parseInt((changeEvent.target as HTMLSelectElement).value, 10);
-    }
+    changeEraserWidth(changeEvent: Event): void {}
 
     /**
killedBy: ToolbarComponent should change the width of the eraser when a width is selected
statusReason: Expected undefined to equal 3.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:147:24
      * This method undoes the last action performed on either canvas.
      * This method is called when the undo button is clicked (back arrow icon in the toolbar).
      */
-    undoAction(): void {
-        this.historyService.undoAction();
-    }
+    undoAction(): void {}
 
     /**
killedBy: ToolbarComponent undoAction method should call the undoAction method of the HistoryService
statusReason: Expected spy HistoryService.undoAction to have been called.

[Killed] BlockStatement
components/creation-page/toolbar/toolbar.component.ts:156:24
      * This method redoes the last action performed on either canvas.
      * This method is called when the redo button is clicked (forward arrow in the toolbar).
      */
-    redoAction(): void {
-        this.historyService.redoAction();
-    }
+    redoAction(): void {}
 }
 
killedBy: ToolbarComponent redoAction method should call the redoAction method of the HistoryService
statusReason: Expected spy HistoryService.redoAction to have been called.
