[Killed] BlockStatement
components/creation-page/vertical-toolbar/vertical-toolbar.component.ts:22:26
      * This method swaps the second layer of the left canvas with the second layer of the right canvas.
      * This method is called when the swap button is clicked.
      */
-    swapOverlays(): void {
-        this.canvasManagerService.swapOverlays();
-    }
+    swapOverlays(): void {}
 
     /**
killedBy: VerticalToolbarComponent should call ths swapOverlays method of the drawService when swap button is clicked
statusReason: Expected spy swapOverlays to have been called.

[Killed] BlockStatement
components/creation-page/vertical-toolbar/vertical-toolbar.component.ts:34:42
      *
      * @param destination The side to which the second layer of the other canvas will be copied.
      */
-    duplicate(destination: string): void {
-        this.canvasManagerService.duplicate(destination);
-    }
+    duplicate(destination: string): void {}
 }
 
killedBy: VerticalToolbarComponent should call the duplicate method of the drawService when duplicate button is clicked with the correct side
statusReason: Expected spy duplicate to have been called with:
  [ 'toLeft' ]
but it was never called.
