[Killed] BlockStatement
app/components/difference-counter/difference-counter.component.ts:17:128
     nbDifferences: number;
     differencesFound: number;
 
-    constructor(public gameComs: GameSocketService, private counterService: CounterService, private playback: PlaybackService) {
-        this.nbDifferences = Math.ceil(this.gameComs.gameInstance.nbDiff / this.gameComs.gameInstance.players.length);
-        this.differencesFound = 0;
-    }
+    constructor(public gameComs: GameSocketService, private counterService: CounterService, private playback: PlaybackService) {}
 
     ngOnInit(): void {
killedBy: DifferenceCounterComponent should create
statusReason: Expected undefined to equal 2.

[Killed] ArithmeticOperator
app/components/difference-counter/difference-counter.component.ts:18:40
     differencesFound: number;
 
     constructor(public gameComs: GameSocketService, private counterService: CounterService, private playback: PlaybackService) {
-        this.nbDifferences = Math.ceil(this.gameComs.gameInstance.nbDiff / this.gameComs.gameInstance.players.length);
+        this.nbDifferences = Math.ceil(this.gameComs.gameInstance.nbDiff * this.gameComs.gameInstance.players.length);
         this.differencesFound = 0;
     }
killedBy: DifferenceCounterComponent should create
statusReason: Expected 6 to equal 2.

[Killed] BlockStatement
app/components/difference-counter/difference-counter.component.ts:22:22
         this.differencesFound = 0;
     }
 
-    ngOnInit(): void {
-        this.counterService.init(this.playerName);
-        this.playback.counters.set(this.playerName, this.counterService);
-        this.counterService.differenceCounter.subscribe((count) => {
-            this.differencesFound = count;
-        });
-    }
+    ngOnInit(): void {}
     ngOnDestroy(): void {
         this.counterService.destroy(this.playerName);
killedBy: DifferenceCounterComponent should update differencesFound
statusReason: Expected 0 to equal 1.

[Killed] BlockStatement
app/components/difference-counter/difference-counter.component.ts:25:68
     ngOnInit(): void {
         this.counterService.init(this.playerName);
         this.playback.counters.set(this.playerName, this.counterService);
-        this.counterService.differenceCounter.subscribe((count) => {
-            this.differencesFound = count;
-        });
+        this.counterService.differenceCounter.subscribe((count) => {});
     }
     ngOnDestroy(): void {
killedBy: DifferenceCounterComponent should update differencesFound
statusReason: Expected 0 to equal 1.

[Survived] BlockStatement
app/components/difference-counter/difference-counter.component.ts:29:25
             this.differencesFound = count;
         });
     }
-    ngOnDestroy(): void {
-        this.counterService.destroy(this.playerName);
-    }
+    ngOnDestroy(): void {}
 }
 
