[Killed] BlockStatement
app/components/end-replay/end-replay.component.ts:23:27
      * Starts the replay when the user decides to play the replay again.
      * The playback is started from the beginning.
      */
-    startPlayback(): void {
-        this.playback.startPlayback();
-    }
+    startPlayback(): void {}
 
     /**
killedBy: EndReplayComponent should call playback startplayback
statusReason: Expected spy unknown to have been called.

[Killed] BlockStatement
app/components/end-replay/end-replay.component.ts:31:26
      * Stops the replay when the user decides to quit the game page.
      * The playback is cleared and the user is redirected to the home page.
      */
-    quitPlayback(): void {
-        this.playback.clearPlayback();
-        this.playback.isPlaybackActive = false;
-        this.router.navigate(['/home']);
-    }
+    quitPlayback(): void {}
 }
 
killedBy: EndReplayComponent should call playback startplayback and navigate
statusReason: Expected spy unknown to have been called.

[Survived] BooleanLiteral
app/components/end-replay/end-replay.component.ts:33:42
      */
     quitPlayback(): void {
         this.playback.clearPlayback();
-        this.playback.isPlaybackActive = false;
+        this.playback.isPlaybackActive = true;
         this.router.navigate(['/home']);
     }

[Killed] StringLiteral
app/components/end-replay/end-replay.component.ts:34:31
     quitPlayback(): void {
         this.playback.clearPlayback();
         this.playback.isPlaybackActive = false;
-        this.router.navigate(['/home']);
+        this.router.navigate([""]);
     }
 }
killedBy: EndReplayComponent should call playback startplayback and navigate
statusReason: Expected spy Router.navigate to have been called only once, and with given args:
  [ [ '/home' ] ]
But the actual call was:
  [ [ '' ] ].
Expected $[0][0] = '' to equal '/home'.


Error: Expected spy Router.navigate to have been called only once, and with given args:
