[Survived] BlockStatement
app/components/endgame-pop-up/endgame-pop-up.component.ts:26:7
         private playback: PlaybackService,
         private router: Router,
         private gameSocketService: GameSocketService,
-    ) {
-        this.isClassic = this.gameSocketService.gameInstance.gameMode === GameType.Classic;
-    }
+    ) {}
 
     startPlayback(): void {

[Survived] EqualityOperator
app/components/endgame-pop-up/endgame-pop-up.component.ts:27:26
         private router: Router,
         private gameSocketService: GameSocketService,
     ) {
-        this.isClassic = this.gameSocketService.gameInstance.gameMode === GameType.Classic;
+        this.isClassic = this.gameSocketService.gameInstance.gameMode !== GameType.Classic;
     }
 

[Survived] ConditionalExpression
app/components/endgame-pop-up/endgame-pop-up.component.ts:27:26
         private router: Router,
         private gameSocketService: GameSocketService,
     ) {
-        this.isClassic = this.gameSocketService.gameInstance.gameMode === GameType.Classic;
+        this.isClassic = false;
     }
 

[Killed] BlockStatement
app/components/endgame-pop-up/endgame-pop-up.component.ts:30:27
         this.isClassic = this.gameSocketService.gameInstance.gameMode === GameType.Classic;
     }
 
-    startPlayback(): void {
-        this.playback.startPlayback();
-    }
+    startPlayback(): void {}
 
     terminateGame(): void {
killedBy: EndgamePopUpComponent should call playback startplayback
statusReason: Expected spy unknown to have been called.

[Killed] BlockStatement
app/components/endgame-pop-up/endgame-pop-up.component.ts:34:27
         this.playback.startPlayback();
     }
 
-    terminateGame(): void {
-        this.playback.clearPlayback();
-        this.router.navigate(['/home']);
-    }
+    terminateGame(): void {}
 }
 
killedBy: EndgamePopUpComponent should call playback startplayback and navigate
statusReason: Expected spy unknown to have been called.
