[Survived] BlockStatement
app/components/game/game.component.ts:24:7
         public gameFeedbackService: GameFeedbackService,
         public gameSocketService: GameSocketService,
         public playbackService: PlaybackService,
-    ) {
-        this.boundOnKeyUp = this.onKeyUp.bind(this);
-        window.addEventListener('keyup', this.boundOnKeyUp);
-    }
+    ) {}
 
     async ngAfterViewInit() {

[Killed] BlockStatement
app/components/game/game.component.ts:29:29
         window.addEventListener('keyup', this.boundOnKeyUp);
     }
 
-    async ngAfterViewInit() {
-        setTimeout(() => {
-            this.gameFeedbackService.initData(this.playAreas.first.getLayers(), this.playAreas.last.getLayers());
-            this.gameFeedbackService.setFlickerSpeed(1);
-        }, Time.Delay);
-    }
+    async ngAfterViewInit() {}
 
     onClue() {
killedBy: GameComponent ngAfterViewInit
statusReason: Expected spy setFlickerSpeed to have been called with:
  [ 1 ]
but it was never called.

[Killed] BlockStatement
app/components/game/game.component.ts:30:26
     }
 
     async ngAfterViewInit() {
-        setTimeout(() => {
-            this.gameFeedbackService.initData(this.playAreas.first.getLayers(), this.playAreas.last.getLayers());
-            this.gameFeedbackService.setFlickerSpeed(1);
-        }, Time.Delay);
+        setTimeout(() => {}, Time.Delay);
     }
 
killedBy: GameComponent ngAfterViewInit
statusReason: Expected spy setFlickerSpeed to have been called with:
  [ 1 ]
but it was never called.

[Killed] BlockStatement
app/components/game/game.component.ts:36:14
         }, Time.Delay);
     }
 
-    onClue() {
-        if (this.gameFeedbackService.nbClues > 0) this.gameSocketService.requestClue();
-    }
+    onClue() {}
 
     onKeyUp(event: KeyboardEvent) {
killedBy: GameComponent onClue should call requestClue
statusReason: Expected spy requestClue to have been called.

[Killed] EqualityOperator
app/components/game/game.component.ts:37:13
     }
 
     onClue() {
-        if (this.gameFeedbackService.nbClues > 0) this.gameSocketService.requestClue();
+        if (this.gameFeedbackService.nbClues <= 0) this.gameSocketService.requestClue();
     }
 
killedBy: GameComponent onClue should call requestClue
statusReason: Expected spy requestClue to have been called.

[Killed] ConditionalExpression
app/components/game/game.component.ts:37:13
     }
 
     onClue() {
-        if (this.gameFeedbackService.nbClues > 0) this.gameSocketService.requestClue();
+        if (true) this.gameSocketService.requestClue();
     }
 
killedBy: GameComponent onClue should not call requestClue when no clues are left
statusReason: Expected spy requestClue not to have been called.

[Killed] BlockStatement
app/components/game/game.component.ts:40:35
         if (this.gameFeedbackService.nbClues > 0) this.gameSocketService.requestClue();
     }
 
-    onKeyUp(event: KeyboardEvent) {
-        if (!(document.activeElement instanceof HTMLInputElement) && !this.playbackService.isPlaybackActive) {
-            if (event.key === 't') {
-                this.gameFeedbackService.toggleCheat();
-                this.gameSocketService.handleCheating();
-            } else if (event.key === 'i' && this.gameSocketService.gameInstance.players.length === 1) this.onClue();
-        }
-    }
+    onKeyUp(event: KeyboardEvent) {}
 
     ngOnDestroy(): void {
killedBy: GameComponent handle keyboard event should start cheat mode if key is "t"
statusReason: Expected spy toggleCheat to have been called.

[Killed] BooleanLiteral
app/components/game/game.component.ts:41:70
     }
 
     onKeyUp(event: KeyboardEvent) {
-        if (!(document.activeElement instanceof HTMLInputElement) && !this.playbackService.isPlaybackActive) {
+        if (!(document.activeElement instanceof HTMLInputElement) && this.playbackService.isPlaybackActive) {
             if (event.key === 't') {
                 this.gameFeedbackService.toggleCheat();
killedBy: GameComponent handle keyboard event should start cheat mode if key is "t"
statusReason: Expected spy toggleCheat to have been called.

[Killed] ConditionalExpression
app/components/game/game.component.ts:41:13
     }
 
     onKeyUp(event: KeyboardEvent) {
-        if (!(document.activeElement instanceof HTMLInputElement) && !this.playbackService.isPlaybackActive) {
+        if (true) {
             if (event.key === 't') {
                 this.gameFeedbackService.toggleCheat();
killedBy: GameComponent handle keyboard event should not start cheat mode if focus is on an input element
statusReason: Expected spy toggleCheat not to have been called.

[Killed] ConditionalExpression
app/components/game/game.component.ts:42:17
 
     onKeyUp(event: KeyboardEvent) {
         if (!(document.activeElement instanceof HTMLInputElement) && !this.playbackService.isPlaybackActive) {
-            if (event.key === 't') {
+            if (false) {
                 this.gameFeedbackService.toggleCheat();
                 this.gameSocketService.handleCheating();
killedBy: GameComponent handle keyboard event should start cheat mode if key is "t"
statusReason: Expected spy toggleCheat to have been called.

[Killed] ConditionalExpression
app/components/game/game.component.ts:42:17
 
     onKeyUp(event: KeyboardEvent) {
         if (!(document.activeElement instanceof HTMLInputElement) && !this.playbackService.isPlaybackActive) {
-            if (event.key === 't') {
+            if (true) {
                 this.gameFeedbackService.toggleCheat();
                 this.gameSocketService.handleCheating();
killedBy: GameComponent handle keyboard event should use clue if key is "i"
statusReason: Expected spy onClue to have been called.

[Killed] ConditionalExpression
app/components/game/game.component.ts:45:24
             if (event.key === 't') {
                 this.gameFeedbackService.toggleCheat();
                 this.gameSocketService.handleCheating();
-            } else if (event.key === 'i' && this.gameSocketService.gameInstance.players.length === 1) this.onClue();
+            } else if (false) this.onClue();
         }
     }
killedBy: GameComponent handle keyboard event should use clue if key is "i"
statusReason: Expected spy onClue to have been called.

[Killed] EqualityOperator
app/components/game/game.component.ts:45:45
             if (event.key === 't') {
                 this.gameFeedbackService.toggleCheat();
                 this.gameSocketService.handleCheating();
-            } else if (event.key === 'i' && this.gameSocketService.gameInstance.players.length === 1) this.onClue();
+            } else if (event.key === 'i' && this.gameSocketService.gameInstance.players.length !== 1) this.onClue();
         }
     }
killedBy: GameComponent handle keyboard event should use clue if key is "i"
statusReason: Expected spy onClue to have been called.

[Survived] BlockStatement
app/components/game/game.component.ts:49:25
         }
     }
 
-    ngOnDestroy(): void {
-        window.removeEventListener('keyup', this.boundOnKeyUp);
-        this.gameSocketService.isOngoing = false;
-        this.gameSocketService.abandonGame();
-    }
+    ngOnDestroy(): void {}
 }
 

[Survived] BooleanLiteral
app/components/game/game.component.ts:51:44
 
     ngOnDestroy(): void {
         window.removeEventListener('keyup', this.boundOnKeyUp);
-        this.gameSocketService.isOngoing = false;
+        this.gameSocketService.isOngoing = true;
         this.gameSocketService.abandonGame();
     }
