[Killed] BlockStatement
app/components/game-info/game-info.component.ts:13:19
 export class GameInfoComponent {
     constructor(private dialog: MatDialog) {}
 
-    abandonGame() {
-        this.dialog.open(AbandonPopUpComponent, {
-            width: '30%',
-            panelClass: 'container',
-            autoFocus: false,
-        });
-    }
+    abandonGame() {}
 }
 
killedBy: GameInfoComponent abandonGame should call open from MatDialog
statusReason: Expected spy open to have been called.

[Survived] ObjectLiteral
app/components/game-info/game-info.component.ts:14:49
     constructor(private dialog: MatDialog) {}
 
     abandonGame() {
-        this.dialog.open(AbandonPopUpComponent, {
-            width: '30%',
-            panelClass: 'container',
-            autoFocus: false,
-        });
+        this.dialog.open(AbandonPopUpComponent, {});
     }
 }

[Survived] StringLiteral
app/components/game-info/game-info.component.ts:15:20
 
     abandonGame() {
         this.dialog.open(AbandonPopUpComponent, {
-            width: '30%',
+            width: "",
             panelClass: 'container',
             autoFocus: false,
