[Survived] BlockStatement
app/components/history-list/history-list.component.ts:16:64
     @ViewChildren('username2', { read: ElementRef }) username2: QueryList<ElementRef>;
     @Input() currentHistory: GameArchive[];
 
-    constructor(private sheetContainer: SheetContainerService) {
-        this.username1 = new QueryList<ElementRef>();
-        this.username2 = new QueryList<ElementRef>();
-    }
+    constructor(private sheetContainer: SheetContainerService) {}
     async ngOnInit(): Promise<void> {
         await this.sheetContainer.getHistory();

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:20:37
         this.username1 = new QueryList<ElementRef>();
         this.username2 = new QueryList<ElementRef>();
     }
-    async ngOnInit(): Promise<void> {
-        await this.sheetContainer.getHistory();
-    }
+    async ngOnInit(): Promise<void> {}
 
     async ngOnChanges(): Promise<void> {
killedBy: HistoryListComponent should get history on init
statusReason: Expected spy SheetContainerService.getHistory to have been called.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:24:40
         await this.sheetContainer.getHistory();
     }
 
-    async ngOnChanges(): Promise<void> {
-        for (let i = -1; i < this.currentHistory.length; ++i) {
-            await this.filterResults(i);
-        }
-    }
+    async ngOnChanges(): Promise<void> {}
 
     formatDate(date: number): string {
killedBy: HistoryListComponent should filter results when changes are made
statusReason: Expected spy filterResults to have been called.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:25:63
     }
 
     async ngOnChanges(): Promise<void> {
-        for (let i = -1; i < this.currentHistory.length; ++i) {
-            await this.filterResults(i);
-        }
+        for (let i = -1; i < this.currentHistory.length; ++i) {}
     }
 
killedBy: HistoryListComponent should filter results when changes are made
statusReason: Expected spy filterResults to have been called.

[Killed] EqualityOperator
app/components/history-list/history-list.component.ts:25:26
     }
 
     async ngOnChanges(): Promise<void> {
-        for (let i = -1; i < this.currentHistory.length; ++i) {
+        for (let i = -1; i >= this.currentHistory.length; ++i) {
             await this.filterResults(i);
         }
killedBy: HistoryListComponent should filter results when changes are made
statusReason: Expected spy filterResults to have been called.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:30:38
         }
     }
 
-    formatDate(date: number): string {
-        const displayDate = new Date(date);
-        return displayDate.toLocaleString('en-GB');
-    }
+    formatDate(date: number): string {}
 
     formatTime(time: number): string {
killedBy: HistoryListComponent should format Date when formatDate is called with parameter
statusReason: Expected undefined to equal '31/12/1969, 19:00:00'.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:35:38
         return displayDate.toLocaleString('en-GB');
     }
 
-    formatTime(time: number): string {
-        const timeInSec = Math.floor(time / Time.SecToMs);
-        const minutes = Math.floor(timeInSec / Time.MinToSec);
-        const seconds = timeInSec % Time.MinToSec;
-        return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
-    }
+    formatTime(time: number): string {}
 
     private async filterResults(index: number) {
killedBy: HistoryListComponent formats time in seconds to minutes:seconds format
statusReason: Expected '01:01' to contain undefined.

[Killed] ArithmeticOperator
app/components/history-list/history-list.component.ts:36:38
     }
 
     formatTime(time: number): string {
-        const timeInSec = Math.floor(time / Time.SecToMs);
+        const timeInSec = Math.floor(time * Time.SecToMs);
         const minutes = Math.floor(timeInSec / Time.MinToSec);
         const seconds = timeInSec % Time.MinToSec;
killedBy: HistoryListComponent formats time in seconds to minutes:seconds format
statusReason: Expected '01:01' to contain '1016666:40'.

[Killed] ArithmeticOperator
app/components/history-list/history-list.component.ts:37:36
 
     formatTime(time: number): string {
         const timeInSec = Math.floor(time / Time.SecToMs);
-        const minutes = Math.floor(timeInSec / Time.MinToSec);
+        const minutes = Math.floor(timeInSec * Time.MinToSec);
         const seconds = timeInSec % Time.MinToSec;
         return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
killedBy: HistoryListComponent formats time in seconds to minutes:seconds format
statusReason: Expected '01:01' to contain '3660:01'.

[Killed] ArithmeticOperator
app/components/history-list/history-list.component.ts:38:25
     formatTime(time: number): string {
         const timeInSec = Math.floor(time / Time.SecToMs);
         const minutes = Math.floor(timeInSec / Time.MinToSec);
-        const seconds = timeInSec % Time.MinToSec;
+        const seconds = timeInSec * Time.MinToSec;
         return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
     }
killedBy: HistoryListComponent formats time in seconds to minutes:seconds format
statusReason: Expected '01:01' to contain '01:3660'.

[Killed] StringLiteral
app/components/history-list/history-list.component.ts:39:89
         const timeInSec = Math.floor(time / Time.SecToMs);
         const minutes = Math.floor(timeInSec / Time.MinToSec);
         const seconds = timeInSec % Time.MinToSec;
-        return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
+        return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, "")}`;
     }
 
killedBy: HistoryListComponent formats time in seconds to minutes:seconds format
statusReason: Expected '01:01' to contain '01:1'.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:42:48
         return `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
     }
 
-    private async filterResults(index: number) {
-        const username1 = this.username1.get(index);
-        const username2 = this.username2.get(index);
-        if (username1 && username2) {
-            if (!this.currentHistory[index].hasAbandoned) {
-                if (this.currentHistory[index].gameMode === 'Classique') {
-                    const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                    user.nativeElement.style.fontWeight = 'bold';
-                } else {
-                    if (this.currentHistory[index].endClock !== 0) {
-                        username1.nativeElement.style.fontWeight = 'bold';
-                        username2.nativeElement.style.fontWeight = 'bold';
-                    }
-                }
-            } else {
-                const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                user.nativeElement.style.textDecoration = 'line-through';
-            }
-        }
-    }
+    private async filterResults(index: number) {}
 }
 
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'bold'.

[Killed] ConditionalExpression
app/components/history-list/history-list.component.ts:45:13
     private async filterResults(index: number) {
         const username1 = this.username1.get(index);
         const username2 = this.username2.get(index);
-        if (username1 && username2) {
+        if (false) {
             if (!this.currentHistory[index].hasAbandoned) {
                 if (this.currentHistory[index].gameMode === 'Classique') {
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'bold'.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:45:37
     private async filterResults(index: number) {
         const username1 = this.username1.get(index);
         const username2 = this.username2.get(index);
-        if (username1 && username2) {
-            if (!this.currentHistory[index].hasAbandoned) {
-                if (this.currentHistory[index].gameMode === 'Classique') {
-                    const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                    user.nativeElement.style.fontWeight = 'bold';
-                } else {
-                    if (this.currentHistory[index].endClock !== 0) {
-                        username1.nativeElement.style.fontWeight = 'bold';
-                        username2.nativeElement.style.fontWeight = 'bold';
-                    }
-                }
-            } else {
-                const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                user.nativeElement.style.textDecoration = 'line-through';
-            }
-        }
+        if (username1 && username2) {}
     }
 }
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'bold'.

[Killed] BooleanLiteral
app/components/history-list/history-list.component.ts:46:17
         const username1 = this.username1.get(index);
         const username2 = this.username2.get(index);
         if (username1 && username2) {
-            if (!this.currentHistory[index].hasAbandoned) {
+            if (this.currentHistory[index].hasAbandoned) {
                 if (this.currentHistory[index].gameMode === 'Classique') {
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'bold'.

[Killed] ConditionalExpression
app/components/history-list/history-list.component.ts:46:17
         const username1 = this.username1.get(index);
         const username2 = this.username2.get(index);
         if (username1 && username2) {
-            if (!this.currentHistory[index].hasAbandoned) {
+            if (true) {
                 if (this.currentHistory[index].gameMode === 'Classique') {
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'line-through'.

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:47:74
         const username2 = this.username2.get(index);
         if (username1 && username2) {
             if (!this.currentHistory[index].hasAbandoned) {
-                if (this.currentHistory[index].gameMode === 'Classique') {
-                    const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                    user.nativeElement.style.fontWeight = 'bold';
-                } else {
+                if (this.currentHistory[index].gameMode === 'Classique') {} else {
                     if (this.currentHistory[index].endClock !== 0) {
                         username1.nativeElement.style.fontWeight = 'bold';
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'bold'.

[Survived] ConditionalExpression
app/components/history-list/history-list.component.ts:47:21
         const username2 = this.username2.get(index);
         if (username1 && username2) {
             if (!this.currentHistory[index].hasAbandoned) {
-                if (this.currentHistory[index].gameMode === 'Classique') {
+                if (true) {
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
                     user.nativeElement.style.fontWeight = 'bold';

[Survived] BlockStatement
app/components/history-list/history-list.component.ts:50:24
                 if (this.currentHistory[index].gameMode === 'Classique') {
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
                     user.nativeElement.style.fontWeight = 'bold';
-                } else {
-                    if (this.currentHistory[index].endClock !== 0) {
-                        username1.nativeElement.style.fontWeight = 'bold';
-                        username2.nativeElement.style.fontWeight = 'bold';
-                    }
-                }
+                } else {}
             } else {
                 const user = this.currentHistory[index].isPlayer1 ? username1 : username2;

[Survived] ConditionalExpression
app/components/history-list/history-list.component.ts:51:25
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
                     user.nativeElement.style.fontWeight = 'bold';
                 } else {
-                    if (this.currentHistory[index].endClock !== 0) {
+                    if (true) {
                         username1.nativeElement.style.fontWeight = 'bold';
                         username2.nativeElement.style.fontWeight = 'bold';

[Survived] ConditionalExpression
app/components/history-list/history-list.component.ts:51:25
                     const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
                     user.nativeElement.style.fontWeight = 'bold';
                 } else {
-                    if (this.currentHistory[index].endClock !== 0) {
+                    if (false) {
                         username1.nativeElement.style.fontWeight = 'bold';
                         username2.nativeElement.style.fontWeight = 'bold';

[Killed] BlockStatement
app/components/history-list/history-list.component.ts:56:20
                         username2.nativeElement.style.fontWeight = 'bold';
                     }
                 }
-            } else {
-                const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                user.nativeElement.style.textDecoration = 'line-through';
-            }
+            } else {}
         }
     }
killedBy: HistoryListComponent should filter results 
statusReason: Expected 'normal' to equal 'line-through'.

[Killed] StringLiteral
app/components/history-list/history-list.component.ts:58:59
                 }
             } else {
                 const user = this.currentHistory[index].isPlayer1 ? username1 : username2;
-                user.nativeElement.style.textDecoration = 'line-through';
+                user.nativeElement.style.textDecoration = "";
             }
         }
killedBy: HistoryListComponent should filter results 
statusReason: Expected '' to equal 'line-through'.
