[Killed] BlockStatement
app/components/join-request-popup/join-request-popup.component.ts:13:14
 export class JoinRequestPopupComponent {
     constructor(@Inject(MAT_DIALOG_DATA) public data: PlayingUser, public dialogRef: MatDialogRef<JoinRequestPopupComponent>) {}
 
-    refuse() {
-        this.dialogRef.close(false);
-    }
+    refuse() {}
 
     accept() {
killedBy: JoinRequestPopupComponent should close dialogRef on refuse
statusReason: Expected spy unknown to have been called with:
  [ false ]
but it was never called.

[Killed] BooleanLiteral
app/components/join-request-popup/join-request-popup.component.ts:14:30
     constructor(@Inject(MAT_DIALOG_DATA) public data: PlayingUser, public dialogRef: MatDialogRef<JoinRequestPopupComponent>) {}
 
     refuse() {
-        this.dialogRef.close(false);
+        this.dialogRef.close(true);
     }
 
killedBy: JoinRequestPopupComponent should close dialogRef on refuse
statusReason: Expected spy unknown to have been called with:
  [ false ]
but actual calls were:
  [ true ].

Call 0:
  Expected $[0] = true to equal false.
Error: Expected spy unknown to have been called with:

[Killed] BlockStatement
app/components/join-request-popup/join-request-popup.component.ts:17:14
         this.dialogRef.close(false);
     }
 
-    accept() {
-        this.dialogRef.close(true);
-    }
+    accept() {}
 }
 
killedBy: JoinRequestPopupComponent should close dialogRef on refuse
statusReason: Expected spy unknown to have been called with:
  [ true ]
but it was never called.

[Killed] BooleanLiteral
app/components/join-request-popup/join-request-popup.component.ts:18:30
     }
 
     accept() {
-        this.dialogRef.close(true);
+        this.dialogRef.close(false);
     }
 }
killedBy: JoinRequestPopupComponent should close dialogRef on refuse
statusReason: Expected spy unknown to have been called with:
  [ true ]
but actual calls were:
  [ false ].

Call 0:
  Expected $[0] = false to equal true.
Error: Expected spy unknown to have been called with:
