[Killed] BlockStatement
app/components/limited-time-popup/limited-time-popup.component.ts:12:123
 export class LimitedTimePopupComponent {
     username: string;
 
-    constructor(@Inject(MAT_DIALOG_DATA) public data: string, private dialogRef: MatDialogRef<LimitedTimePopupComponent>) {
-        this.username = '';
-    }
+    constructor(@Inject(MAT_DIALOG_DATA) public data: string, private dialogRef: MatDialogRef<LimitedTimePopupComponent>) {}
 
     onInput(input: HTMLInputElement) {
killedBy: LimitedTimePopupComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/components/limited-time-popup/limited-time-popup.component.ts:16:38
         this.username = '';
     }
 
-    onInput(input: HTMLInputElement) {
-        this.username = input.value;
-    }
+    onInput(input: HTMLInputElement) {}
 
     onSubmit(mode: string) {
killedBy: LimitedTimePopupComponent should set username
statusReason: Expected '' to equal 'test'.

[Killed] BlockStatement
app/components/limited-time-popup/limited-time-popup.component.ts:20:28
         this.username = input.value;
     }
 
-    onSubmit(mode: string) {
-        this.dialogRef.close({ username: this.username, mode });
-    }
+    onSubmit(mode: string) {}
 }
 
killedBy: LimitedTimePopupComponent should close dialog with correct info
statusReason: Expected spy close to have been called with:
  [ Object({ username: 'user', mode: 'test' }) ]
but it was never called.
