[Killed] BlockStatement
app/components/message/message.component.ts:16:29
     @Input() color: string;
     @Input() date: string;
 
-    ngAfterViewInit(): void {
-        this.innerMessage.nativeElement.style.backgroundColor = this.color;
-        if (this.color === '#F0F81E') {
-            this.messageElement.nativeElement.classList.add('sent');
-        }
-    }
+    ngAfterViewInit(): void {}
 }
 
killedBy: MessageComponent should set class sent if color is #F0F81E
statusReason: Expected message to contain 'sent'.

[Killed] ConditionalExpression
app/components/message/message.component.ts:18:13
 
     ngAfterViewInit(): void {
         this.innerMessage.nativeElement.style.backgroundColor = this.color;
-        if (this.color === '#F0F81E') {
+        if (false) {
             this.messageElement.nativeElement.classList.add('sent');
         }
killedBy: MessageComponent should set class sent if color is #F0F81E
statusReason: Expected message to contain 'sent'.

[Killed] BlockStatement
app/components/message/message.component.ts:18:39
 
     ngAfterViewInit(): void {
         this.innerMessage.nativeElement.style.backgroundColor = this.color;
-        if (this.color === '#F0F81E') {
-            this.messageElement.nativeElement.classList.add('sent');
-        }
+        if (this.color === '#F0F81E') {}
     }
 }
killedBy: MessageComponent should set class sent if color is #F0F81E
statusReason: Expected message to contain 'sent'.

[Killed] StringLiteral
app/components/message/message.component.ts:19:61
     ngAfterViewInit(): void {
         this.innerMessage.nativeElement.style.backgroundColor = this.color;
         if (this.color === '#F0F81E') {
-            this.messageElement.nativeElement.classList.add('sent');
+            this.messageElement.nativeElement.classList.add("");
         }
     }
killedBy: MessageComponent should create
statusReason: SyntaxError: Failed to execute 'add' on 'DOMTokenList': The token provided must not be empty.
