[Killed] BlockStatement
app/components/play-area/play-area.component.ts:27:56
 
     private imageElement: HTMLImageElement;
 
-    constructor(private gameSocket: GameSocketService) {
-        this.imageElement = new Image();
-    }
+    constructor(private gameSocket: GameSocketService) {}
 
     ngAfterViewInit(): void {
killedBy: GameComponent should create; PlayAreaComponent should create
statusReason: TypeError: Cannot set properties of undefined (setting 'src')

[Killed] BlockStatement
app/components/play-area/play-area.component.ts:31:29
         this.imageElement = new Image();
     }
 
-    ngAfterViewInit(): void {
-        this.errorCtx = this.errorLayerRef.nativeElement.getContext('2d') as CanvasRenderingContext2D;
-        this.errorCtx.font = '20px Arial';
-        this.errorCtx.fillStyle = 'red';
-
-        this.clueCtx = this.clueLayerRef.nativeElement.getContext('2d') as CanvasRenderingContext2D;
-        this.diffCtx = this.diffLayerRef.nativeElement.getContext('2d') as CanvasRenderingContext2D;
-
-        this.imageCtx = this.imageLayerRef.nativeElement.getContext('2d') as CanvasRenderingContext2D;
-        this.imageElement.onload = this.drawImage;
-        this.imageElement.src = this.imageSrc;
-    }
+    ngAfterViewInit(): void {}
 
     ngOnChanges(changes: SimpleChanges): void {
killedBy: PlayAreaComponent should return defined PlayAreaLayers
statusReason: Expected undefined to be defined.

[Killed] BlockStatement
app/components/play-area/play-area.component.ts:44:47
         this.imageElement.src = this.imageSrc;
     }
 
-    ngOnChanges(changes: SimpleChanges): void {
-        this.imageElement.src = changes.imageSrc.currentValue;
-    }
+    ngOnChanges(changes: SimpleChanges): void {}
 
     drawImage = (event: Event) => {
killedBy: PlayAreaComponent should change image src
statusReason: Expected 'http://localhost:9877/undefined' to contain 'image'.

[Killed] BlockStatement
app/components/play-area/play-area.component.ts:48:35
         this.imageElement.src = changes.imageSrc.currentValue;
     }
 
-    drawImage = (event: Event) => {
-        this.imageCtx.drawImage(event.target as HTMLImageElement, 0, 0);
-    };
+    drawImage = (event: Event) => {};
 
     getLayers(): PlayAreaLayers {
killedBy: PlayAreaComponent should call ctx drawImage
statusReason: Expected spy CanvasRenderingContext2D.drawImage to have been called.

[Killed] BlockStatement
app/components/play-area/play-area.component.ts:52:33
         this.imageCtx.drawImage(event.target as HTMLImageElement, 0, 0);
     };
 
-    getLayers(): PlayAreaLayers {
-        return { image: this.imageCtx, diff: this.diffCtx, clue: this.clueCtx };
-    }
+    getLayers(): PlayAreaLayers {}
 
     mouseHitDetect(event: MouseEvent): void {
killedBy: PlayAreaComponent should return defined PlayAreaLayers
statusReason: TypeError: Cannot read properties of undefined (reading 'image')

[Killed] ObjectLiteral
app/components/play-area/play-area.component.ts:53:16
     };
 
     getLayers(): PlayAreaLayers {
-        return { image: this.imageCtx, diff: this.diffCtx, clue: this.clueCtx };
+        return {};
     }
 
killedBy: PlayAreaComponent should return defined PlayAreaLayers
statusReason: Expected undefined to be defined.

[Killed] BlockStatement
app/components/play-area/play-area.component.ts:56:45
         return { image: this.imageCtx, diff: this.diffCtx, clue: this.clueCtx };
     }
 
-    mouseHitDetect(event: MouseEvent): void {
-        if (event.button === MouseButton.Left) this.gameSocket.sendClick({ x: event.offsetX, y: event.offsetY }, this.errorCtx);
-    }
+    mouseHitDetect(event: MouseEvent): void {}
 }
 
killedBy: PlayAreaComponent should call sendClick on mouseHitdetect
statusReason: Expected spy sendClick to have been called.

[Killed] EqualityOperator
app/components/play-area/play-area.component.ts:57:13
     }
 
     mouseHitDetect(event: MouseEvent): void {
-        if (event.button === MouseButton.Left) this.gameSocket.sendClick({ x: event.offsetX, y: event.offsetY }, this.errorCtx);
+        if (event.button !== MouseButton.Left) this.gameSocket.sendClick({ x: event.offsetX, y: event.offsetY }, this.errorCtx);
     }
 }
killedBy: PlayAreaComponent should call sendClick on mouseHitdetect
statusReason: Expected spy sendClick to have been called.

[Killed] ConditionalExpression
app/components/play-area/play-area.component.ts:57:13
     }
 
     mouseHitDetect(event: MouseEvent): void {
-        if (event.button === MouseButton.Left) this.gameSocket.sendClick({ x: event.offsetX, y: event.offsetY }, this.errorCtx);
+        if (false) this.gameSocket.sendClick({ x: event.offsetX, y: event.offsetY }, this.errorCtx);
     }
 }
killedBy: PlayAreaComponent should call sendClick on mouseHitdetect
statusReason: Expected spy sendClick to have been called.
