[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:37:22
      * Subscribes to the playback speed subject to be notified when the playback speed changes.
      * This method is called when the component is initialized.
      */
-    ngOnInit(): void {
-        this.playback.playbackSpeedSubject.subscribe((speed: number) => {
-            this.changePlaybackSpeed(speed);
-        });
-    }
+    ngOnInit(): void {}
 
     /**
killedBy: PlaybackOptionsComponent should create
statusReason: Expected spy changePlaybackSpeed to have been called.

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:38:73
      * This method is called when the component is initialized.
      */
     ngOnInit(): void {
-        this.playback.playbackSpeedSubject.subscribe((speed: number) => {
-            this.changePlaybackSpeed(speed);
-        });
+        this.playback.playbackSpeedSubject.subscribe((speed: number) => {});
     }
 
killedBy: PlaybackOptionsComponent should create
statusReason: Expected spy changePlaybackSpeed to have been called.

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:47:29
      * Initializes the playback speed map with values 1, 2 and 4.
      * This method is called after the view has been initialized.
      */
-    ngAfterViewInit(): void {
-        // Creates a new map to store the playback speed icons.
-        this.playbackSpeeds = new Map();
-
-        // Initializes the playback speed map with values 1, 2 and 4.
-        // The no-magic-numbers rule is disabled because the numbers are not arbitrary, rather they are the only acceptable values.
-        // eslint-disable-next-line @typescript-eslint/no-magic-numbers
-        [1, 2, 4].forEach((speed) => this.playbackSpeeds.set(speed, this.speedOptions.nativeElement.querySelector(`#speed-${speed}`)));
-    }
+    ngAfterViewInit(): void {}
 
     /**
killedBy: PlaybackOptionsComponent changePlaybackSpeed
statusReason: TypeError: Cannot set properties of undefined (setting 'get')

[Survived] ArrowFunction
app/components/playback-options/playback-options.component.ts:54:27
         // Initializes the playback speed map with values 1, 2 and 4.
         // The no-magic-numbers rule is disabled because the numbers are not arbitrary, rather they are the only acceptable values.
         // eslint-disable-next-line @typescript-eslint/no-magic-numbers
-        [1, 2, 4].forEach((speed) => this.playbackSpeeds.set(speed, this.speedOptions.nativeElement.querySelector(`#speed-${speed}`)));
+        [1, 2, 4].forEach(() => undefined);
     }
 

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:63:24
      * If the playback is currently playing, the playback is paused.
      * The image of the button is also changed to reflect the current state of the playback.
      */
-    togglePlay(): void {
-        if (this.playback.play) {
-            this.playback.pausePlayback();
-            this.playPause.nativeElement.src = '/assets/Images/play.png';
-        } else {
-            this.playback.resumePlayback();
-            this.playPause.nativeElement.src = '/assets/Images/pause.png';
-        }
-    }
+    togglePlay(): void {}
 
     /**
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy resumePlayback to have been called.

[Killed] ConditionalExpression
app/components/playback-options/playback-options.component.ts:64:13
      * The image of the button is also changed to reflect the current state of the playback.
      */
     togglePlay(): void {
-        if (this.playback.play) {
+        if (false) {
             this.playback.pausePlayback();
             this.playPause.nativeElement.src = '/assets/Images/play.png';
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy pausePlayback to have been called.

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:64:33
      * The image of the button is also changed to reflect the current state of the playback.
      */
     togglePlay(): void {
-        if (this.playback.play) {
-            this.playback.pausePlayback();
-            this.playPause.nativeElement.src = '/assets/Images/play.png';
-        } else {
+        if (this.playback.play) {} else {
             this.playback.resumePlayback();
             this.playPause.nativeElement.src = '/assets/Images/pause.png';
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy pausePlayback to have been called.

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:67:16
         if (this.playback.play) {
             this.playback.pausePlayback();
             this.playPause.nativeElement.src = '/assets/Images/play.png';
-        } else {
-            this.playback.resumePlayback();
-            this.playPause.nativeElement.src = '/assets/Images/pause.png';
-        }
+        } else {}
     }
 
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy resumePlayback to have been called.

[Survived] StringLiteral
app/components/playback-options/playback-options.component.ts:69:48
             this.playPause.nativeElement.src = '/assets/Images/play.png';
         } else {
             this.playback.resumePlayback();
-            this.playPause.nativeElement.src = '/assets/Images/pause.png';
+            this.playPause.nativeElement.src = "";
         }
     }

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:80:46
      *
      * @param speed the new playback speed (values 1, 2 and 4 are expected)
      */
-    changePlaybackSpeed(speed: number): void {
-        this.playback.setPlaybackSpeed(speed);
-        this.gameFeedback.setFlickerSpeed(speed);
-        this.gameSocketService.setErrorDelay(speed);
-        this.playbackSpeeds.forEach((icon) => icon.classList.remove('active'));
-        (this.playbackSpeeds.get(speed) as HTMLDivElement).classList.add('active');
-    }
+    changePlaybackSpeed(speed: number): void {}
 
     /**
killedBy: PlaybackOptionsComponent changePlaybackSpeed
statusReason: Expected spy setFlickerSpeed to have been called with:
  [ 3 ]
but it was never called.

[Survived] ArrowFunction
app/components/playback-options/playback-options.component.ts:84:37
         this.playback.setPlaybackSpeed(speed);
         this.gameFeedback.setFlickerSpeed(speed);
         this.gameSocketService.setErrorDelay(speed);
-        this.playbackSpeeds.forEach((icon) => icon.classList.remove('active'));
+        this.playbackSpeeds.forEach(() => undefined);
         (this.playbackSpeeds.get(speed) as HTMLDivElement).classList.add('active');
     }

[Killed] StringLiteral
app/components/playback-options/playback-options.component.ts:84:69
         this.playback.setPlaybackSpeed(speed);
         this.gameFeedback.setFlickerSpeed(speed);
         this.gameSocketService.setErrorDelay(speed);
-        this.playbackSpeeds.forEach((icon) => icon.classList.remove('active'));
+        this.playbackSpeeds.forEach((icon) => icon.classList.remove(""));
         (this.playbackSpeeds.get(speed) as HTMLDivElement).classList.add('active');
     }
killedBy: PlaybackOptionsComponent changePlaybackSpeed
statusReason: SyntaxError: Failed to execute 'remove' on 'DOMTokenList': The token provided must not be empty.

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:92:27
      * Restarts the replay from the beginning when the user clicks on the restart button.
      * This method also clears the timeouts that make the differences flicker to prevent a bug where the differences would continue flickering.
      */
-    restartReplay(): void {
-        if (this.gameFeedback.isCheating) this.gameFeedback.toggleCheat();
-        this.gameFeedback.clearTimeouts();
-        this.playback.stopPlayback(false);
-        this.playback.startPlayback();
-        this.playPause.nativeElement.src = '/assets/Images/pause.png';
-    }
+    restartReplay(): void {}
 
     /**
killedBy: PlaybackOptionsComponent should restartReplay
statusReason: Expected spy stopPlayback to have been called with:
  [ false ]
but it was never called.

[Killed] ConditionalExpression
app/components/playback-options/playback-options.component.ts:93:13
      * This method also clears the timeouts that make the differences flicker to prevent a bug where the differences would continue flickering.
      */
     restartReplay(): void {
-        if (this.gameFeedback.isCheating) this.gameFeedback.toggleCheat();
+        if (false) this.gameFeedback.toggleCheat();
         this.gameFeedback.clearTimeouts();
         this.playback.stopPlayback(false);
killedBy: PlaybackOptionsComponent should restartReplay
statusReason: Expected spy toggleCheat to have been called.

[Survived] ConditionalExpression
app/components/playback-options/playback-options.component.ts:93:13
      * This method also clears the timeouts that make the differences flicker to prevent a bug where the differences would continue flickering.
      */
     restartReplay(): void {
-        if (this.gameFeedback.isCheating) this.gameFeedback.toggleCheat();
+        if (true) this.gameFeedback.toggleCheat();
         this.gameFeedback.clearTimeouts();
         this.playback.stopPlayback(false);

[Killed] BooleanLiteral
app/components/playback-options/playback-options.component.ts:95:36
     restartReplay(): void {
         if (this.gameFeedback.isCheating) this.gameFeedback.toggleCheat();
         this.gameFeedback.clearTimeouts();
-        this.playback.stopPlayback(false);
+        this.playback.stopPlayback(true);
         this.playback.startPlayback();
         this.playPause.nativeElement.src = '/assets/Images/pause.png';
killedBy: PlaybackOptionsComponent should restartReplay
statusReason: Expected spy stopPlayback to have been called with:
  [ false ]
but actual calls were:
  [ true ].

Call 0:
  Expected $[0] = true to equal false.
Error: Expected spy stopPlayback to have been called with:

[Killed] BlockStatement
app/components/playback-options/playback-options.component.ts:105:24
      * The playback is stopped and cleared to prevent the replay from playing again.
      * The user is then redirected to the home page.
      */
-    quitReplay(): void {
-        this.playback.stopPlayback(false);
-        this.playback.isPlaybackActive = false;
-        this.playback.clearPlayback();
-        this.router.navigate(['/home']);
-    }
+    quitReplay(): void {}
 }
 
killedBy: PlaybackOptionsComponent should quitReplay
statusReason: Expected spy stopPlayback to have been called with:
  [ false ]
but it was never called.

[Killed] BooleanLiteral
app/components/playback-options/playback-options.component.ts:106:36
      * The user is then redirected to the home page.
      */
     quitReplay(): void {
-        this.playback.stopPlayback(false);
+        this.playback.stopPlayback(true);
         this.playback.isPlaybackActive = false;
         this.playback.clearPlayback();
killedBy: PlaybackOptionsComponent should quitReplay
statusReason: Expected spy stopPlayback to have been called with:
  [ false ]
but actual calls were:
  [ true ].

Call 0:
  Expected $[0] = true to equal false.
Error: Expected spy stopPlayback to have been called with:

[Survived] BooleanLiteral
app/components/playback-options/playback-options.component.ts:107:42
      */
     quitReplay(): void {
         this.playback.stopPlayback(false);
-        this.playback.isPlaybackActive = false;
+        this.playback.isPlaybackActive = true;
         this.playback.clearPlayback();
         this.router.navigate(['/home']);
