[Killed] BlockStatement
app/components/progress-counter/progress-counter.component.ts:16:22
 
     constructor(private progressCounterService: ProgressCounterService, public gameSocketService: GameSocketService) {}
 
-    ngOnInit(): void {
-        this.progressCounterService.differenceCounter = new BehaviorSubject(0);
-        this.differencesFound = this.progressCounterService.differenceCounter.getValue();
-        this.progressCounterService.differenceCounter.subscribe((count) => {
-            this.differencesFound = count;
-        });
-    }
+    ngOnInit(): void {}
 }
 
killedBy: ProgressCounterComponent should set differenceFound
statusReason: TypeError: counterService.differenceCounter.next is not a function

[Killed] BlockStatement
app/components/progress-counter/progress-counter.component.ts:19:76
     ngOnInit(): void {
         this.progressCounterService.differenceCounter = new BehaviorSubject(0);
         this.differencesFound = this.progressCounterService.differenceCounter.getValue();
-        this.progressCounterService.differenceCounter.subscribe((count) => {
-            this.differencesFound = count;
-        });
+        this.progressCounterService.differenceCounter.subscribe((count) => {});
     }
 }
killedBy: ProgressCounterComponent should set differenceFound
statusReason: Expected 0 to equal 1.
