[Killed] BlockStatement
app/components/timer/timer.component.ts:13:63
 export class TimerComponent {
     display: string;
 
-    constructor(private gameSocketService: GameSocketService) {
-        this.formatTime(this.gameSocketService.serverTimer.getValue());
-        this.gameSocketService.serverTimer.subscribe((time) => {
-            this.formatTime(time);
-        });
-    }
+    constructor(private gameSocketService: GameSocketService) {}
 
     private formatTime(timeFromServer: number) {
killedBy: TimerComponent should update differencesFound
statusReason: Expected spy formatTime to have been called with:
  [ 1 ]
but it was never called.

[Killed] BlockStatement
app/components/timer/timer.component.ts:15:64
 
     constructor(private gameSocketService: GameSocketService) {
         this.formatTime(this.gameSocketService.serverTimer.getValue());
-        this.gameSocketService.serverTimer.subscribe((time) => {
-            this.formatTime(time);
-        });
+        this.gameSocketService.serverTimer.subscribe((time) => {});
     }
 
killedBy: TimerComponent should update differencesFound
statusReason: Expected spy formatTime to have been called with:
  [ 1 ]
but it was never called.

[Survived] BlockStatement
app/components/timer/timer.component.ts:20:48
         });
     }
 
-    private formatTime(timeFromServer: number) {
-        const minutes = Math.floor(timeFromServer / Time.MinToMs);
-        const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
-        this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
-    }
+    private formatTime(timeFromServer: number) {}
 }
 

[Survived] ArithmeticOperator
app/components/timer/timer.component.ts:21:36
     }
 
     private formatTime(timeFromServer: number) {
-        const minutes = Math.floor(timeFromServer / Time.MinToMs);
+        const minutes = Math.floor(timeFromServer * Time.MinToMs);
         const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
         this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;

[Survived] ArithmeticOperator
app/components/timer/timer.component.ts:22:37
 
     private formatTime(timeFromServer: number) {
         const minutes = Math.floor(timeFromServer / Time.MinToMs);
-        const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
+        const seconds = Math.floor((timeFromServer * Time.MinToMs) / Time.SecToMs);
         this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
     }

[Survived] ArithmeticOperator
app/components/timer/timer.component.ts:22:36
 
     private formatTime(timeFromServer: number) {
         const minutes = Math.floor(timeFromServer / Time.MinToMs);
-        const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
+        const seconds = Math.floor(timeFromServer % Time.MinToMs * Time.SecToMs);
         this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
     }

[Survived] StringLiteral
app/components/timer/timer.component.ts:23:58
     private formatTime(timeFromServer: number) {
         const minutes = Math.floor(timeFromServer / Time.MinToMs);
         const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
-        this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
+        this.display = `${minutes.toString().padStart(2, "")}:${seconds.toString().padStart(2, '0')}`;
     }
 }

[Survived] StringLiteral
app/components/timer/timer.component.ts:23:24
     private formatTime(timeFromServer: number) {
         const minutes = Math.floor(timeFromServer / Time.MinToMs);
         const seconds = Math.floor((timeFromServer % Time.MinToMs) / Time.SecToMs);
-        this.display = `${minutes.toString().padStart(2, '0')}:${seconds.toString().padStart(2, '0')}`;
+        this.display = ``;
     }
 }
