[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:20:7
         @Inject(MAT_DIALOG_DATA) public data: string,
         public gameSocketService: GameSocketService,
         public dialogRef: MatDialogRef<UsernamePopUpComponent>,
-    ) {
-        this.username = '';
-        this.prompt = "Entrez un nom d'utilisateur";
-        window.addEventListener('keydown', this.eventListener.bind(this));
-    }
+    ) {}
 
     onInput(input: HTMLInputElement, actionsContainer: HTMLDivElement) {
killedBy: UsernamePopUpComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:26:72
         window.addEventListener('keydown', this.eventListener.bind(this));
     }
 
-    onInput(input: HTMLInputElement, actionsContainer: HTMLDivElement) {
-        this.username = input.value;
-        actionsContainer.classList.toggle('show', this.username.length > 3);
-    }
+    onInput(input: HTMLInputElement, actionsContainer: HTMLDivElement) {}
 
     ngOnDestroy(): void {
killedBy: UsernamePopUpComponent onInput should change the username value 
statusReason: Expected '' to equal 'username'.

[Survived] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:28:51
 
     onInput(input: HTMLInputElement, actionsContainer: HTMLDivElement) {
         this.username = input.value;
-        actionsContainer.classList.toggle('show', this.username.length > 3);
+        actionsContainer.classList.toggle('show', false);
     }
 

[Survived] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:28:51
 
     onInput(input: HTMLInputElement, actionsContainer: HTMLDivElement) {
         this.username = input.value;
-        actionsContainer.classList.toggle('show', this.username.length > 3);
+        actionsContainer.classList.toggle('show', true);
     }
 

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:31:25
         actionsContainer.classList.toggle('show', this.username.length > 3);
     }
 
-    ngOnDestroy(): void {
-        if (this.nameSubscription) this.nameSubscription.unsubscribe();
-        window.removeEventListener('keydown', this.eventListener.bind(this));
-    }
+    ngOnDestroy(): void {}
 
     onSubmit() {
killedBy: UsernamePopUpComponent should remove listener on destroy
statusReason: Expected spy removeEventListener to have been called.

[Killed] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:32:13
     }
 
     ngOnDestroy(): void {
-        if (this.nameSubscription) this.nameSubscription.unsubscribe();
+        if (true) this.nameSubscription.unsubscribe();
         window.removeEventListener('keydown', this.eventListener.bind(this));
     }
killedBy: UsernamePopUpComponent should create
statusReason: Error: 1 component threw errors during cleanup

[Survived] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:32:13
     }
 
     ngOnDestroy(): void {
-        if (this.nameSubscription) this.nameSubscription.unsubscribe();
+        if (false) this.nameSubscription.unsubscribe();
         window.removeEventListener('keydown', this.eventListener.bind(this));
     }

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:36:16
         window.removeEventListener('keydown', this.eventListener.bind(this));
     }
 
-    onSubmit() {
-        if (this.data !== 'Jouer') {
-            this.gameSocketService.validateUsername(this.username);
-            this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
-                if (isValid) this.dialogRef.close(this.username);
-                else this.prompt = 'Ce nom est déjà utilisé';
-            });
-        } else this.dialogRef.close(this.username);
-    }
+    onSubmit() {}
 
     private eventListener(event: KeyboardEvent) {
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected spy GameSocketService.validateUsername to have been called with:
  [ 'username' ]
but it was never called.

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:37:36
     }
 
     onSubmit() {
-        if (this.data !== 'Jouer') {
-            this.gameSocketService.validateUsername(this.username);
-            this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
-                if (isValid) this.dialogRef.close(this.username);
-                else this.prompt = 'Ce nom est déjà utilisé';
-            });
-        } else this.dialogRef.close(this.username);
+        if (this.data !== 'Jouer') {} else this.dialogRef.close(this.username);
     }
 
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected spy GameSocketService.validateUsername to have been called with:
  [ 'username' ]
but it was never called.

[Killed] EqualityOperator
app/components/username-pop-up/username-pop-up.component.ts:37:13
     }
 
     onSubmit() {
-        if (this.data !== 'Jouer') {
+        if (this.data === 'Jouer') {
             this.gameSocketService.validateUsername(this.username);
             this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected spy GameSocketService.validateUsername to have been called with:
  [ 'username' ]
but it was never called.

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:39:99
     onSubmit() {
         if (this.data !== 'Jouer') {
             this.gameSocketService.validateUsername(this.username);
-            this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
-                if (isValid) this.dialogRef.close(this.username);
-                else this.prompt = 'Ce nom est déjà utilisé';
-            });
+            this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {});
         } else this.dialogRef.close(this.username);
     }
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected 'Entrez un nom d'utilisateur' to equal 'Ce nom est déjà utilisé'.

[Killed] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:40:21
         if (this.data !== 'Jouer') {
             this.gameSocketService.validateUsername(this.username);
             this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
-                if (isValid) this.dialogRef.close(this.username);
+                if (false) this.dialogRef.close(this.username);
                 else this.prompt = 'Ce nom est déjà utilisé';
             });
killedBy: UsernamePopUpComponent should close the dialog if the player submits for a multiplayer game with a correct username
statusReason: Expected spy close to have been called with:
  [ 'username' ]
but it was never called.

[Killed] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:40:21
         if (this.data !== 'Jouer') {
             this.gameSocketService.validateUsername(this.username);
             this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
-                if (isValid) this.dialogRef.close(this.username);
+                if (true) this.dialogRef.close(this.username);
                 else this.prompt = 'Ce nom est déjà utilisé';
             });
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected spy close not to have been called.

[Killed] StringLiteral
app/components/username-pop-up/username-pop-up.component.ts:41:36
             this.gameSocketService.validateUsername(this.username);
             this.nameSubscription = this.gameSocketService.isValidUsername.subscribe((isValid) => {
                 if (isValid) this.dialogRef.close(this.username);
-                else this.prompt = 'Ce nom est déjà utilisé';
+                else this.prompt = "";
             });
         } else this.dialogRef.close(this.username);
killedBy: UsernamePopUpComponent should not close the dialog if the player submits for a multiplayer game with an incorrect username
statusReason: Expected '' to equal 'Ce nom est déjà utilisé'.

[Killed] BlockStatement
app/components/username-pop-up/username-pop-up.component.ts:46:49
         } else this.dialogRef.close(this.username);
     }
 
-    private eventListener(event: KeyboardEvent) {
-        if (event.key === 'Enter') this.onSubmit();
-    }
+    private eventListener(event: KeyboardEvent) {}
 }
 
killedBy: UsernamePopUpComponent should call on submit
statusReason: Expected spy onSubmit to have been called with:
  [  ]
but it was never called.

[Killed] ConditionalExpression
app/components/username-pop-up/username-pop-up.component.ts:47:13
     }
 
     private eventListener(event: KeyboardEvent) {
-        if (event.key === 'Enter') this.onSubmit();
+        if (false) this.onSubmit();
     }
 }
killedBy: UsernamePopUpComponent should call on submit
statusReason: Expected spy onSubmit to have been called with:
  [  ]
but it was never called.

[Killed] EqualityOperator
app/components/username-pop-up/username-pop-up.component.ts:47:13
     }
 
     private eventListener(event: KeyboardEvent) {
-        if (event.key === 'Enter') this.onSubmit();
+        if (event.key !== 'Enter') this.onSubmit();
     }
 }
killedBy: UsernamePopUpComponent should call on submit
statusReason: Expected spy onSubmit to have been called with:
  [  ]
but it was never called.
