[Killed] BooleanLiteral
app/pages/app/app.component.ts:4:29
 import { Component, OnDestroy, OnInit } from '@angular/core';
 import { NavigationStart, Router } from '@angular/router';
 import { Subscription } from 'rxjs';
-export let browserRefresh = false;
+export let browserRefresh = true;
 @Component({
     selector: 'app-root',
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected true to be falsy.

[Killed] BlockStatement
app/pages/app/app.component.ts:14:16
     subscription: Subscription;
     constructor(private router: Router) {}
 
-    ngOnInit() {
-        this.subscription = this.router.events.subscribe((event) => {
-            if (event instanceof NavigationStart) {
-                browserRefresh = !this.router.navigated;
-            }
-        });
-    }
+    ngOnInit() {}
 
     ngOnDestroy() {
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected false to be truthy.

[Killed] BlockStatement
app/pages/app/app.component.ts:15:69
     constructor(private router: Router) {}
 
     ngOnInit() {
-        this.subscription = this.router.events.subscribe((event) => {
-            if (event instanceof NavigationStart) {
-                browserRefresh = !this.router.navigated;
-            }
-        });
+        this.subscription = this.router.events.subscribe((event) => {});
     }
 
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
app/pages/app/app.component.ts:16:17
 
     ngOnInit() {
         this.subscription = this.router.events.subscribe((event) => {
-            if (event instanceof NavigationStart) {
+            if (false) {
                 browserRefresh = !this.router.navigated;
             }
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected false to be truthy.

[Killed] BlockStatement
app/pages/app/app.component.ts:16:51
 
     ngOnInit() {
         this.subscription = this.router.events.subscribe((event) => {
-            if (event instanceof NavigationStart) {
-                browserRefresh = !this.router.navigated;
-            }
+            if (event instanceof NavigationStart) {}
         });
     }
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected false to be truthy.

[Killed] BooleanLiteral
app/pages/app/app.component.ts:17:34
     ngOnInit() {
         this.subscription = this.router.events.subscribe((event) => {
             if (event instanceof NavigationStart) {
-                browserRefresh = !this.router.navigated;
+                browserRefresh = this.router.navigated;
             }
         });
killedBy: AppComponent browserRefresh should be true on refresh
statusReason: Expected undefined to be truthy.

[Survived] BlockStatement
app/pages/app/app.component.ts:22:19
         });
     }
 
-    ngOnDestroy() {
-        this.subscription.unsubscribe();
-    }
+    ngOnDestroy() {}
 }
 
