[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:20:142
     bonusTime: number;
     settingsForm: FormGroup;
 
-    constructor(public sheetContainer: SheetContainerService, public gameSocketService: GameSocketService, private formBuilder: FormBuilder) {
-        this.title = 'Configuration';
-        this.gameSocketService.settingsValue.subscribe((settings) => {
-            this.initialTime = settings.initialTime;
-            this.penaltyTime = settings.penaltyTime;
-            this.bonusTime = settings.bonusTime;
-        });
-    }
+    constructor(public sheetContainer: SheetContainerService, public gameSocketService: GameSocketService, private formBuilder: FormBuilder) {}
 
     ngOnInit(): void {
killedBy: ConfigPageComponent should set the title to configuration
statusReason: Expected undefined to equal 'Configuration'.

[Survived] BlockStatement
app/pages/config-page/config-page.component.ts:22:70
 
     constructor(public sheetContainer: SheetContainerService, public gameSocketService: GameSocketService, private formBuilder: FormBuilder) {
         this.title = 'Configuration';
-        this.gameSocketService.settingsValue.subscribe((settings) => {
-            this.initialTime = settings.initialTime;
-            this.penaltyTime = settings.penaltyTime;
-            this.bonusTime = settings.bonusTime;
-        });
+        this.gameSocketService.settingsValue.subscribe((settings) => {});
     }
 

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:29:22
         });
     }
 
-    ngOnInit(): void {
-        this.initSettingsform();
-        this.sheetContainer.getSheets(0);
-    }
+    ngOnInit(): void {}
 
     resetTime(gameTitle: string): void {
killedBy: ConfigPageComponent should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:34:40
         this.sheetContainer.getSheets(0);
     }
 
-    resetTime(gameTitle: string): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser le meilleur temps de cette feuille?')) {
-            this.gameSocketService.resetTime(gameTitle);
-        }
-    }
+    resetTime(gameTitle: string): void {}
 
     resetAllBestTimes() {
killedBy: ConfigPageComponent resetTime() should reset the times of a sheet
statusReason: Expected spy gameSocketService.resetTime to have been called with:
  [ 'test' ]
but it was never called.

[Killed] ConditionalExpression
app/pages/config-page/config-page.component.ts:35:13
     }
 
     resetTime(gameTitle: string): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser le meilleur temps de cette feuille?')) {
+        if (false) {
             this.gameSocketService.resetTime(gameTitle);
         }
killedBy: ConfigPageComponent resetTime() should reset the times of a sheet
statusReason: Expected spy gameSocketService.resetTime to have been called with:
  [ 'test' ]
but it was never called.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:35:100
     }
 
     resetTime(gameTitle: string): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser le meilleur temps de cette feuille?')) {
-            this.gameSocketService.resetTime(gameTitle);
-        }
+        if (confirm('Êtes-vous sûr de vouloir réinitialiser le meilleur temps de cette feuille?')) {}
     }
 
killedBy: ConfigPageComponent resetTime() should reset the times of a sheet
statusReason: Expected spy gameSocketService.resetTime to have been called with:
  [ 'test' ]
but it was never called.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:40:25
         }
     }
 
-    resetAllBestTimes() {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
-            this.gameSocketService.resetTime();
-        }
-    }
+    resetAllBestTimes() {}
 
     initSettingsform(): void {
killedBy: ConfigPageComponent resetAllBestTimes() should reset all best times
statusReason: Expected spy resetAllBestTimes to have been called.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:41:90
     }
 
     resetAllBestTimes() {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
-            this.gameSocketService.resetTime();
-        }
+        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {}
     }
 
killedBy: ConfigPageComponent resetAllBestTimes() should reset all best times
statusReason: Expected spy resetAllBestTimes to have been called.

[Killed] ConditionalExpression
app/pages/config-page/config-page.component.ts:41:13
     }
 
     resetAllBestTimes() {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
+        if (false) {
             this.gameSocketService.resetTime();
         }
killedBy: ConfigPageComponent resetAllBestTimes() should reset all best times
statusReason: Expected spy resetAllBestTimes to have been called.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:46:30
         }
     }
 
-    initSettingsform(): void {
-        this.settingsForm = this.formBuilder.group({
-            initialTimeControl: new FormControl(this.initialTime, [
-                Validators.required,
-                Validators.min(SettingsConsts.MinCountdown),
-                Validators.max(SettingsConsts.MaxCountdown),
-                Validators.pattern('^[0-9]*$'),
-            ]),
-            penaltyTimeControl: new FormControl(this.penaltyTime, [
-                Validators.required,
-                Validators.min(SettingsConsts.MinIncrement),
-                Validators.max(SettingsConsts.MaxIncrement),
-                Validators.pattern('^[0-9]*$'),
-            ]),
-            bonusTimeControl: new FormControl(this.bonusTime, [
-                Validators.required,
-                Validators.min(SettingsConsts.MinIncrement),
-                Validators.max(SettingsConsts.MinCountdown),
-                Validators.pattern('^[0-9]*$'),
-            ]),
-        });
-    }
+    initSettingsform(): void {}
 
     updateSettings(): void {
killedBy: ConfigPageComponent should create
statusReason: Error: NG01052: formGroup expects a FormGroup instance. Please pass one in.

      Example:

      
  <div [formGroup]="myGroup">
    <input formControlName="firstName">
  </div>

[Survived] ArrayDeclaration
app/pages/config-page/config-page.component.ts:48:67
 
     initSettingsform(): void {
         this.settingsForm = this.formBuilder.group({
-            initialTimeControl: new FormControl(this.initialTime, [
-                Validators.required,
-                Validators.min(SettingsConsts.MinCountdown),
-                Validators.max(SettingsConsts.MaxCountdown),
-                Validators.pattern('^[0-9]*$'),
-            ]),
+            initialTimeControl: new FormControl(this.initialTime, []),
             penaltyTimeControl: new FormControl(this.penaltyTime, [
                 Validators.required,

[Survived] MethodExpression
app/pages/config-page/config-page.component.ts:50:17
         this.settingsForm = this.formBuilder.group({
             initialTimeControl: new FormControl(this.initialTime, [
                 Validators.required,
-                Validators.min(SettingsConsts.MinCountdown),
+                Validators.max(SettingsConsts.MinCountdown),
                 Validators.max(SettingsConsts.MaxCountdown),
                 Validators.pattern('^[0-9]*$'),

[Survived] MethodExpression
app/pages/config-page/config-page.component.ts:51:17
             initialTimeControl: new FormControl(this.initialTime, [
                 Validators.required,
                 Validators.min(SettingsConsts.MinCountdown),
-                Validators.max(SettingsConsts.MaxCountdown),
+                Validators.min(SettingsConsts.MaxCountdown),
                 Validators.pattern('^[0-9]*$'),
             ]),

[Survived] StringLiteral
app/pages/config-page/config-page.component.ts:52:36
                 Validators.required,
                 Validators.min(SettingsConsts.MinCountdown),
                 Validators.max(SettingsConsts.MaxCountdown),
-                Validators.pattern('^[0-9]*$'),
+                Validators.pattern(""),
             ]),
             penaltyTimeControl: new FormControl(this.penaltyTime, [

[Survived] MethodExpression
app/pages/config-page/config-page.component.ts:56:17
             ]),
             penaltyTimeControl: new FormControl(this.penaltyTime, [
                 Validators.required,
-                Validators.min(SettingsConsts.MinIncrement),
+                Validators.max(SettingsConsts.MinIncrement),
                 Validators.max(SettingsConsts.MaxIncrement),
                 Validators.pattern('^[0-9]*$'),

[Survived] MethodExpression
app/pages/config-page/config-page.component.ts:57:17
             penaltyTimeControl: new FormControl(this.penaltyTime, [
                 Validators.required,
                 Validators.min(SettingsConsts.MinIncrement),
-                Validators.max(SettingsConsts.MaxIncrement),
+                Validators.min(SettingsConsts.MaxIncrement),
                 Validators.pattern('^[0-9]*$'),
             ]),

[Survived] ArrayDeclaration
app/pages/config-page/config-page.component.ts:60:63
                 Validators.max(SettingsConsts.MaxIncrement),
                 Validators.pattern('^[0-9]*$'),
             ]),
-            bonusTimeControl: new FormControl(this.bonusTime, [
-                Validators.required,
-                Validators.min(SettingsConsts.MinIncrement),
-                Validators.max(SettingsConsts.MinCountdown),
-                Validators.pattern('^[0-9]*$'),
-            ]),
+            bonusTimeControl: new FormControl(this.bonusTime, []),
         });
     }

[Survived] MethodExpression
app/pages/config-page/config-page.component.ts:63:17
             bonusTimeControl: new FormControl(this.bonusTime, [
                 Validators.required,
                 Validators.min(SettingsConsts.MinIncrement),
-                Validators.max(SettingsConsts.MinCountdown),
+                Validators.min(SettingsConsts.MinCountdown),
                 Validators.pattern('^[0-9]*$'),
             ]),

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:69:28
         });
     }
 
-    updateSettings(): void {
-        let buttonMessage = this.validate.nativeElement.innerText;
-        this.gameSocketService.updateSettings(this.initialTime, this.penaltyTime, this.bonusTime);
-        buttonMessage = 'Succès!';
-        this.validate.nativeElement.innerText = buttonMessage;
-        setTimeout(() => {
-            this.validate.nativeElement.innerText = 'Valider';
-        }, SettingsConsts.ValidateTimeout);
-    }
+    updateSettings(): void {}
 
     resetSettings(): void {
killedBy: ConfigPageComponent should call gameSocketService.updateSettings with the right params
statusReason: Expected spy gameSocketService.updateSettings to have been called with:
  [ 30, 5, 5 ]
but it was never called.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:74:26
         this.gameSocketService.updateSettings(this.initialTime, this.penaltyTime, this.bonusTime);
         buttonMessage = 'Succès!';
         this.validate.nativeElement.innerText = buttonMessage;
-        setTimeout(() => {
-            this.validate.nativeElement.innerText = 'Valider';
-        }, SettingsConsts.ValidateTimeout);
+        setTimeout(() => {}, SettingsConsts.ValidateTimeout);
     }
 
killedBy: ConfigPageComponent should change the value of button innertext on updateSettings
statusReason: Expected 'succès!' to equal 'valider'.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:79:27
         }, SettingsConsts.ValidateTimeout);
     }
 
-    resetSettings(): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
-            this.initialTime = SettingsConsts.DefaultCountDown;
-            this.penaltyTime = SettingsConsts.DefaultIncrement;
-            this.bonusTime = SettingsConsts.DefaultIncrement;
-            this.gameSocketService.updateSettings(SettingsConsts.DefaultCountDown, SettingsConsts.DefaultIncrement, SettingsConsts.DefaultIncrement);
-        }
-    }
+    resetSettings(): void {}
 }
 
killedBy: ConfigPageComponent resetSettings should reinit settings
statusReason: Expected 31 to equal 30.

[Killed] BlockStatement
app/pages/config-page/config-page.component.ts:80:90
     }
 
     resetSettings(): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
-            this.initialTime = SettingsConsts.DefaultCountDown;
-            this.penaltyTime = SettingsConsts.DefaultIncrement;
-            this.bonusTime = SettingsConsts.DefaultIncrement;
-            this.gameSocketService.updateSettings(SettingsConsts.DefaultCountDown, SettingsConsts.DefaultIncrement, SettingsConsts.DefaultIncrement);
-        }
+        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {}
     }
 }
killedBy: ConfigPageComponent resetSettings should reinit settings
statusReason: Expected 31 to equal 30.

[Killed] ConditionalExpression
app/pages/config-page/config-page.component.ts:80:13
     }
 
     resetSettings(): void {
-        if (confirm('Êtes-vous sûr de vouloir réinitialiser tous les meilleurs temps?')) {
+        if (false) {
             this.initialTime = SettingsConsts.DefaultCountDown;
             this.penaltyTime = SettingsConsts.DefaultIncrement;
killedBy: ConfigPageComponent resetSettings should reinit settings
statusReason: Expected 31 to equal 30.
