[Survived] BlockStatement
app/pages/creation-page/creation.component.ts:37:7
         private canvasManagerService: CanvasManagerService,
         private drawService: DrawService,
         private historyService: HistoryService,
-    ) {
-        this.title = 'Créer un nouveau jeu';
-    }
+    ) {}
 
     /**

[Killed] BlockStatement
app/pages/creation-page/creation.component.ts:46:29
      * Initializes the drawing service with every canvas layer required.
      * Triggers after the view is initialized.
      */
-    ngAfterViewInit(): void {
-        this.initializeCanvases();
-        this.compareService.initContexts(
-            this.canvas1.nativeElement.querySelector('canvas#layer-1').getContext('2d') as CanvasRenderingContext2D,
-            this.canvas1.nativeElement.querySelector('canvas#layer-2').getContext('2d') as CanvasRenderingContext2D,
-            this.canvas2.nativeElement.querySelector('canvas#layer-1').getContext('2d') as CanvasRenderingContext2D,
-            this.canvas2.nativeElement.querySelector('canvas#layer-2').getContext('2d') as CanvasRenderingContext2D,
-        );
-        this.drawService.initContexts(this.canvas1.nativeElement, this.canvas2.nativeElement);
-        this.historyService.initContexts(this.canvas1.nativeElement, this.canvas2.nativeElement);
-        this.canvasManagerService.initContexts(this.canvas1.nativeElement, this.canvas2.nativeElement);
-    }
+    ngAfterViewInit(): void {}
 
     /**
killedBy: CreationComponent should initialize the services
statusReason: Expected spy initContexts to have been called.

[Killed] BlockStatement
app/pages/creation-page/creation.component.ts:63:40
      * Draws a white background on both canvases to enable the comparison on page load.
      * The initial image drawn remains removable, but the background will be re-drawn with white.
      */
-    private initializeCanvases(): void {
-        this.drawWhiteImage(this.canvas1.nativeElement.querySelector('canvas#layer-1'));
-        this.drawWhiteImage(this.canvas2.nativeElement.querySelector('canvas#layer-1'));
-    }
+    private initializeCanvases(): void {}
 
     /**
killedBy: CreationComponent should initialize both canvases with a white background
statusReason: Expected spy drawWhiteImage to have been called 2 times. It was called 0 times.

[Killed] BlockStatement
app/pages/creation-page/creation.component.ts:73:61
      *
      * @param canvas the canvas on which the image will be drawn.
      */
-    private drawWhiteImage(canvas: HTMLCanvasElement): void {
-        const canvasContext = canvas.getContext('2d') as CanvasRenderingContext2D;
-        canvasContext.fillStyle = 'white';
-        canvasContext.fillRect(0, 0, canvas.width, canvas.height);
-    }
+    private drawWhiteImage(canvas: HTMLCanvasElement): void {}
 }
 
killedBy: CreationComponent drawWhiteImage should draw a white background
statusReason: Expected '#000000' to equal '#ffffff'.
