[Survived] BlockStatement
app/pages/game-page/game-page.component.ts:12:128
     styleUrls: ['./game-page.component.scss'],
 })
 export class GamePageComponent {
-    constructor(private gameSocketService: GameSocketService, public playbackService: PlaybackService, private router: Router) {
-        if (!this.gameSocketService.isOngoing) this.router.navigate(['/home']);
-    }
+    constructor(private gameSocketService: GameSocketService, public playbackService: PlaybackService, private router: Router) {}
 }
 

[Survived] ConditionalExpression
app/pages/game-page/game-page.component.ts:13:13
 })
 export class GamePageComponent {
     constructor(private gameSocketService: GameSocketService, public playbackService: PlaybackService, private router: Router) {
-        if (!this.gameSocketService.isOngoing) this.router.navigate(['/home']);
+        if (true) this.router.navigate(['/home']);
     }
 }

[Survived] ConditionalExpression
app/pages/game-page/game-page.component.ts:13:13
 })
 export class GamePageComponent {
     constructor(private gameSocketService: GameSocketService, public playbackService: PlaybackService, private router: Router) {
-        if (!this.gameSocketService.isOngoing) this.router.navigate(['/home']);
+        if (false) this.router.navigate(['/home']);
     }
 }
