[Survived] BlockStatement
app/pages/history-page/history-page.component.ts:11:63
 })
 export class HistoryPageComponent {
     title: string;
-    constructor(public sheetContainer: SheetContainerService) {
-        this.title = 'Historique des parties';
-    }
+    constructor(public sheetContainer: SheetContainerService) {}
 }
 

[Survived] StringLiteral
app/pages/history-page/history-page.component.ts:12:22
 export class HistoryPageComponent {
     title: string;
     constructor(public sheetContainer: SheetContainerService) {
-        this.title = 'Historique des parties';
+        this.title = "";
     }
 }
