[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:13:90
 })
 export class MainPageComponent {
     readonly title: string;
-    constructor(private dialog: MatDialog, private gameSocketService: GameSocketService) {
-        this.title = 'Jeu des différences';
-    }
+    constructor(private dialog: MatDialog, private gameSocketService: GameSocketService) {}
 
     openLimitedTimePopup() {
killedBy: MainPageComponent should have as title 'Jeu des différences'
statusReason: Expected undefined to equal 'Jeu des différences'.

[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:17:28
         this.title = 'Jeu des différences';
     }
 
-    openLimitedTimePopup() {
-        this.dialog
-            .open(LimitedTimePopupComponent, { width: '30%', panelClass: 'container' })
-            .afterClosed()
-            .subscribe((data) => {
-                if (data && data.username) {
-                    this.gameSocketService.createGameLimitedTime(data.username, data.mode);
-                    if (data.mode === 'Coop') {
-                        this.dialog
-                            .open(WaitingRoomPopupComponent, {
-                                width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
-                                panelClass: 'container',
-                                autoFocus: false,
-                            })
-                            .afterClosed()
-                            .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
-                            });
-                    }
-                }
-            });
-    }
+    openLimitedTimePopup() {}
 }
 
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy createGameLimitedTime to have been called with:
  [ 'test', 'Coop' ]
but it was never called.

[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:21:34
         this.dialog
             .open(LimitedTimePopupComponent, { width: '30%', panelClass: 'container' })
             .afterClosed()
-            .subscribe((data) => {
-                if (data && data.username) {
-                    this.gameSocketService.createGameLimitedTime(data.username, data.mode);
-                    if (data.mode === 'Coop') {
-                        this.dialog
-                            .open(WaitingRoomPopupComponent, {
-                                width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
-                                panelClass: 'container',
-                                autoFocus: false,
-                            })
-                            .afterClosed()
-                            .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
-                            });
-                    }
-                }
-            });
+            .subscribe((data) => {});
     }
 }
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy createGameLimitedTime to have been called with:
  [ 'test', 'Coop' ]
but it was never called.

[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:22:44
             .open(LimitedTimePopupComponent, { width: '30%', panelClass: 'container' })
             .afterClosed()
             .subscribe((data) => {
-                if (data && data.username) {
-                    this.gameSocketService.createGameLimitedTime(data.username, data.mode);
-                    if (data.mode === 'Coop') {
-                        this.dialog
-                            .open(WaitingRoomPopupComponent, {
-                                width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
-                                panelClass: 'container',
-                                autoFocus: false,
-                            })
-                            .afterClosed()
-                            .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
-                            });
-                    }
-                }
+                if (data && data.username) {}
             });
     }
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy createGameLimitedTime to have been called with:
  [ 'test', 'Coop' ]
but it was never called.

[Killed] ConditionalExpression
app/pages/main-page/main-page.component.ts:22:21
             .open(LimitedTimePopupComponent, { width: '30%', panelClass: 'container' })
             .afterClosed()
             .subscribe((data) => {
-                if (data && data.username) {
+                if (false) {
                     this.gameSocketService.createGameLimitedTime(data.username, data.mode);
                     if (data.mode === 'Coop') {
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy createGameLimitedTime to have been called with:
  [ 'test', 'Coop' ]
but it was never called.

[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:24:47
             .subscribe((data) => {
                 if (data && data.username) {
                     this.gameSocketService.createGameLimitedTime(data.username, data.mode);
-                    if (data.mode === 'Coop') {
-                        this.dialog
-                            .open(WaitingRoomPopupComponent, {
-                                width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
-                                panelClass: 'container',
-                                autoFocus: false,
-                            })
-                            .afterClosed()
-                            .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
-                            });
-                    }
+                    if (data.mode === 'Coop') {}
                 }
             });
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ].

Call 0:
  Expected $[0] = Function to equal Function.
  Expected $

[Killed] ConditionalExpression
app/pages/main-page/main-page.component.ts:24:25
             .subscribe((data) => {
                 if (data && data.username) {
                     this.gameSocketService.createGameLimitedTime(data.username, data.mode);
-                    if (data.mode === 'Coop') {
+                    if (false) {
                         this.dialog
                             .open(WaitingRoomPopupComponent, {
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ].

Call 0:
  Expected $[0] = Function to equal Function.
  Expected $

[Killed] ObjectLiteral
app/pages/main-page/main-page.component.ts:26:62
                     this.gameSocketService.createGameLimitedTime(data.username, data.mode);
                     if (data.mode === 'Coop') {
                         this.dialog
-                            .open(WaitingRoomPopupComponent, {
-                                width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
-                                panelClass: 'container',
-                                autoFocus: false,
-                            })
+                            .open(WaitingRoomPopupComponent, {})
                             .afterClosed()
                             .subscribe(() => {
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ],
  [ Function, Object({  }) ].

Call 0:
  Expected $[0] = Function t

[Killed] StringLiteral
app/pages/main-page/main-page.component.ts:27:40
                     if (data.mode === 'Coop') {
                         this.dialog
                             .open(WaitingRoomPopupComponent, {
-                                width: '20%',
+                                width: "",
                                 data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
                                 disableClose: true,
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ],
  [ Function, Object({ width: '', data: Object({ gameTitle: 'Mode t

[Killed] StringLiteral
app/pages/main-page/main-page.component.ts:28:81
                         this.dialog
                             .open(WaitingRoomPopupComponent, {
                                 width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
+                                data: { gameTitle: 'Mode temps limité', prompt: "" },
                                 disableClose: true,
                                 panelClass: 'container',
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ],
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mod

[Killed] ObjectLiteral
app/pages/main-page/main-page.component.ts:28:39
                         this.dialog
                             .open(WaitingRoomPopupComponent, {
                                 width: '20%',
-                                data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
+                                data: {},
                                 disableClose: true,
                                 panelClass: 'container',
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ],
  [ Function, Object({ width: '20%', data: Object({  }), disableClo

[Killed] BooleanLiteral
app/pages/main-page/main-page.component.ts:29:47
                             .open(WaitingRoomPopupComponent, {
                                 width: '20%',
                                 data: { gameTitle: 'Mode temps limité', prompt: "En attente d'un joueur." },
-                                disableClose: true,
+                                disableClose: false,
                                 panelClass: 'container',
                                 autoFocus: false,
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy MatDialog.open to have been called with:
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mode temps limité', prompt: 'En attente d'un joueur.' }), disableClose: true, panelClass: 'container', autoFocus: false }) ]
but actual calls were:
  [ Function, Object({ width: '30%', panelClass: 'container' }) ],
  [ Function, Object({ width: '20%', data: Object({ gameTitle: 'Mod

[Killed] BlockStatement
app/pages/main-page/main-page.component.ts:34:46
                                 autoFocus: false,
                             })
                             .afterClosed()
-                            .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
-                            });
+                            .subscribe(() => {});
                     }
                 }
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy send to have been called with:
  [ 'cancelWaitingRoom' ]
but it was never called.

[Killed] StringLiteral
app/pages/main-page/main-page.component.ts:35:75
                             })
                             .afterClosed()
                             .subscribe(() => {
-                                this.gameSocketService.socketService.send('cancelWaitingRoom');
+                                this.gameSocketService.socketService.send("");
                             });
                     }
killedBy: MainPageComponent should call the createGameLimitedTime method and open the waiting room popup for Coop mode
statusReason: Expected spy send to have been called with:
  [ 'cancelWaitingRoom' ]
but actual calls were:
  [ '' ].

Call 0:
  Expected $[0] = '' to equal 'cancelWaitingRoom'.
Error: Expected spy send to have been called with:
