[Survived] BlockStatement
app/pages/selection-page/game-selection.component.ts:12:108
 export class SelectionPageComponent implements OnInit {
     title: string;
 
-    constructor(public sheetContainer: SheetContainerService, public gameSocketService: GameSocketService) {
-        this.title = 'Sélection de jeu';
-    }
+    constructor(public sheetContainer: SheetContainerService, public gameSocketService: GameSocketService) {}
 
     ngOnInit(): void {

[Killed] BlockStatement
app/pages/selection-page/game-selection.component.ts:16:22
         this.title = 'Sélection de jeu';
     }
 
-    ngOnInit(): void {
-        this.sheetContainer.getSheets(0);
-        this.gameSocketService.joinSelectionRoom();
-    }
+    ngOnInit(): void {}
 }
 
killedBy: SelectionPageComponent should create and call getSheets of SheetContainerService after initialization
statusReason: Expected spy sheetContainerSpy.getSheets to have been called.
