[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:23:80
      * @param canvas1 the left canvas.
      * @param canvas2 the right canvas.
      */
-    initContexts(canvas1: HTMLCanvasElement, canvas2: HTMLCanvasElement): void {
-        this.context1 = (canvas1.querySelector('canvas#layer-2') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-        this.context2 = (canvas2.querySelector('canvas#layer-2') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-    }
+    initContexts(canvas1: HTMLCanvasElement, canvas2: HTMLCanvasElement): void {}
 
     /**
killedBy: CanvasManagerService should initialize the contexts
statusReason: Expected undefined to be truthy.

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:34:51
      *
      * @param canvas the canvas to clear.
      */
-    resetOverlay(canvas: HTMLCanvasElement): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
-
-        const context = canvas.getContext('2d') as CanvasRenderingContext2D;
-        context.clearRect(0, 0, canvas.width, canvas.height);
-    }
+    resetOverlay(canvas: HTMLCanvasElement): void {}
 
     /**
killedBy: CanvasManagerService should save the state of the canvases in the history before resetting
statusReason: Expected spy saveState to have been called.

[Survived] BooleanLiteral
src/app/services/canvas-manager.service.ts:35:68
      * @param canvas the canvas to clear.
      */
     resetOverlay(canvas: HTMLCanvasElement): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
+        this.historyService.saveState(this.historyService.undoArr, false);
 
         const context = canvas.getContext('2d') as CanvasRenderingContext2D;

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:45:26
      * Swaps the overlays of the two canvases.
      * This only applies to the draw layer. The background layer is not affected.
      */
-    swapOverlays(): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
-
-        this.drawCanvas(this.context1.canvas, this.context2.canvas);
-        this.drawCanvas(this.context2.canvas, this.context1.canvas);
-    }
+    swapOverlays(): void {}
 
     /**
killedBy: CanvasManagerService should save the state of the canvases in the history before swapping
statusReason: Expected spy saveState to have been called.

[Survived] BooleanLiteral
src/app/services/canvas-manager.service.ts:46:68
      * This only applies to the draw layer. The background layer is not affected.
      */
     swapOverlays(): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
+        this.historyService.saveState(this.historyService.undoArr, false);
 
         this.drawCanvas(this.context1.canvas, this.context2.canvas);

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:59:42
      * @param destination the canvas on which the other canvas should be drawn.
      * The value can be 'toLeft' or 'toRight'.
      */
-    duplicate(destination: string): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
-
-        if (destination === 'toLeft') {
-            this.drawCanvas(this.context1.canvas, this.context2.canvas);
-        } else {
-            this.drawCanvas(this.context2.canvas, this.context1.canvas);
-        }
-    }
+    duplicate(destination: string): void {}
 
     /**
killedBy: CanvasManagerService should save the state of the canvases in the history before duplicating
statusReason: Expected spy saveState to have been called.

[Survived] BooleanLiteral
src/app/services/canvas-manager.service.ts:60:68
      * The value can be 'toLeft' or 'toRight'.
      */
     duplicate(destination: string): void {
-        this.historyService.saveState(this.historyService.undoArr, true);
+        this.historyService.saveState(this.historyService.undoArr, false);
 
         if (destination === 'toLeft') {

[Killed] EqualityOperator
src/app/services/canvas-manager.service.ts:62:13
     duplicate(destination: string): void {
         this.historyService.saveState(this.historyService.undoArr, true);
 
-        if (destination === 'toLeft') {
+        if (destination !== 'toLeft') {
             this.drawCanvas(this.context1.canvas, this.context2.canvas);
         } else {
killedBy: CanvasManagerService should duplicate the right canvas to the left
statusReason: Expected spy drawCanvas to have been called with:
but actual calls were:

Call 0:
  Expected $[0].getContext = spy on HTMLCanvasElement.getContext to equal spy on HTMLCanvasElement.getContext.
  Expected $[0].querySelector = spy on HTMLCanvasElement.querySelector to equal spy on HTMLCanvasElement.querySelector.

[Killed] ConditionalExpression
src/app/services/canvas-manager.service.ts:62:13
     duplicate(destination: string): void {
         this.historyService.saveState(this.historyService.undoArr, true);
 
-        if (destination === 'toLeft') {
+        if (false) {
             this.drawCanvas(this.context1.canvas, this.context2.canvas);
         } else {
killedBy: CanvasManagerService should duplicate the right canvas to the left
statusReason: Expected spy drawCanvas to have been called with:
but actual calls were:

Call 0:
  Expected $[0].getContext = spy on HTMLCanvasElement.getContext to equal spy on HTMLCanvasElement.getContext.
  Expected $[0].querySelector = spy on HTMLCanvasElement.querySelector to equal spy on HTMLCanvasElement.querySelector.

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:64:16
 
         if (destination === 'toLeft') {
             this.drawCanvas(this.context1.canvas, this.context2.canvas);
-        } else {
-            this.drawCanvas(this.context2.canvas, this.context1.canvas);
-        }
+        } else {}
     }
 
killedBy: CanvasManagerService should duplicate the left canvas to the right
statusReason: Expected spy drawCanvas to have been called with:
but it was never called.

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:75:90
      * @param canvasTo the canvas on which the other canvas should be drawn.
      * @param canvasFrom the canvas that should be drawn on the other canvas.
      */
-    private drawCanvas(canvasTo: HTMLCanvasElement, canvasFrom: HTMLCanvasElement): void {
-        const dataFrom = canvasFrom.toDataURL();
-        const image = new Image();
-        image.src = dataFrom;
-        image.onload = () => {
-            (canvasTo.getContext('2d') as CanvasRenderingContext2D).clearRect(0, 0, canvasTo.width, canvasTo.height);
-            (canvasTo.getContext('2d') as CanvasRenderingContext2D).drawImage(image, 0, 0);
-        };
-    }
+    private drawCanvas(canvasTo: HTMLCanvasElement, canvasFrom: HTMLCanvasElement): void {}
 }
 
killedBy: CanvasManagerService image.onload test
statusReason: Expected $.data['0'] = 0 to equal 255.
Expected $.data['3'] = 0 to equal 255.
Expected $.data['4'] = 0 to equal 255.
Expected $.data['7'] = 0 to equal 255.
Expected $.data['8'] = 0 to equal 255.
Expected $.data['11'] = 0 to equal 255.
Expected $.data['12'] = 0 to equal 255.
Expected $.data['15'] = 0 to equal 255.

[Killed] BlockStatement
src/app/services/canvas-manager.service.ts:79:30
         const dataFrom = canvasFrom.toDataURL();
         const image = new Image();
         image.src = dataFrom;
-        image.onload = () => {
-            (canvasTo.getContext('2d') as CanvasRenderingContext2D).clearRect(0, 0, canvasTo.width, canvasTo.height);
-            (canvasTo.getContext('2d') as CanvasRenderingContext2D).drawImage(image, 0, 0);
-        };
+        image.onload = () => {};
     }
 }
killedBy: CanvasManagerService image.onload test
statusReason: Expected $.data['0'] = 0 to equal 255.
Expected $.data['3'] = 0 to equal 255.
Expected $.data['4'] = 0 to equal 255.
Expected $.data['7'] = 0 to equal 255.
Expected $.data['8'] = 0 to equal 255.
Expected $.data['11'] = 0 to equal 255.
Expected $.data['12'] = 0 to equal 255.
Expected $.data['15'] = 0 to equal 255.
