[Killed] BlockStatement
src/app/services/communication.service.ts:18:53
 
     constructor(private readonly http: HttpClient) {}
 
-    createGamePost(game: Game): Observable<boolean> {
-        return this.http
-            .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: 'text' })
-            .pipe(map((res) => res.status === HTTPConstants.Created));
-    }
+    createGamePost(game: Game): Observable<boolean> {}
 
     titleExistsGet(title: string): Observable<boolean> {
killedBy: CommunicationService should not return any message when sending a POST request (HttpClient called once)
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] ObjectLiteral
src/app/services/communication.service.ts:20:56
 
     createGamePost(game: Game): Observable<boolean> {
         return this.http
-            .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: 'text' })
+            .post(`${this.baseUrl}/data/create`, game, {})
             .pipe(map((res) => res.status === HTTPConstants.Created));
     }

[Survived] StringLiteral
src/app/services/communication.service.ts:20:93
 
     createGamePost(game: Game): Observable<boolean> {
         return this.http
-            .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: 'text' })
+            .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: "" })
             .pipe(map((res) => res.status === HTTPConstants.Created));
     }

[Survived] ConditionalExpression
src/app/services/communication.service.ts:21:32
     createGamePost(game: Game): Observable<boolean> {
         return this.http
             .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: 'text' })
-            .pipe(map((res) => res.status === HTTPConstants.Created));
+            .pipe(map((res) => true));
     }
 

[Survived] ConditionalExpression
src/app/services/communication.service.ts:21:32
     createGamePost(game: Game): Observable<boolean> {
         return this.http
             .post(`${this.baseUrl}/data/create`, game, { observe: 'response', responseType: 'text' })
-            .pipe(map((res) => res.status === HTTPConstants.Created));
+            .pipe(map((res) => false));
     }
 

[Killed] BlockStatement
src/app/services/communication.service.ts:24:56
             .pipe(map((res) => res.status === HTTPConstants.Created));
     }
 
-    titleExistsGet(title: string): Observable<boolean> {
-        return this.http
-            .get(`${this.baseUrl}/data/create/titleExists?title=${title}`, {
-                observe: 'body',
-                responseType: 'text',
-            })
-            .pipe(map((body) => JSON.parse(body)));
-    }
+    titleExistsGet(title: string): Observable<boolean> {}
 
     getGameFile(title: string, original: boolean): Observable<string> {
killedBy: CommunicationService should return true when sending a GET request (HttpClient called once)
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/services/communication.service.ts:26:18
 
     titleExistsGet(title: string): Observable<boolean> {
         return this.http
-            .get(`${this.baseUrl}/data/create/titleExists?title=${title}`, {
+            .get(``, {
                 observe: 'body',
                 responseType: 'text',
killedBy: CommunicationService should return true when sending a GET request (HttpClient called once)
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:3000/api/data/create/titleExists?title=Hello", found none. Requests received are: GET .

[Survived] StringLiteral
src/app/services/communication.service.ts:28:31
         return this.http
             .get(`${this.baseUrl}/data/create/titleExists?title=${title}`, {
                 observe: 'body',
-                responseType: 'text',
+                responseType: "",
             })
             .pipe(map((body) => JSON.parse(body)));

[Killed] ArrowFunction
src/app/services/communication.service.ts:30:23
                 observe: 'body',
                 responseType: 'text',
             })
-            .pipe(map((body) => JSON.parse(body)));
+            .pipe(map(() => undefined));
     }
 
killedBy: CommunicationService should return true when sending a GET request (HttpClient called once)
statusReason: Expected undefined to equal true.

[Killed] BlockStatement
src/app/services/communication.service.ts:33:71
             .pipe(map((body) => JSON.parse(body)));
     }
 
-    getGameFile(title: string, original: boolean): Observable<string> {
-        return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: 'arraybuffer' }).pipe(
-            map((file) => {
-                return URL.createObjectURL(new Blob([file]));
-            }),
-        );
-    }
+    getGameFile(title: string, original: boolean): Observable<string> {}
 
     getGameFiles(title: string): Observable<[string, string]> {
killedBy: CommunicationService should return a source for the original BMP image
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/services/communication.service.ts:34:125
     }
 
     getGameFile(title: string, original: boolean): Observable<string> {
-        return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: 'arraybuffer' }).pipe(
+        return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: "" }).pipe(
             map((file) => {
                 return URL.createObjectURL(new Blob([file]));
killedBy: CommunicationService should return a source for the original BMP image
statusReason: Error: Automatic conversion to JSON is not supported for ArrayBuffers.

[Killed] StringLiteral
src/app/services/communication.service.ts:34:96
     }
 
     getGameFile(title: string, original: boolean): Observable<string> {
-        return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: 'arraybuffer' }).pipe(
+        return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? "" : '2'}`, { responseType: 'arraybuffer' }).pipe(
             map((file) => {
                 return URL.createObjectURL(new Blob([file]));
killedBy: CommunicationService should return a source for the original BMP image
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:3000/api/data/game/file?title=Hello&image=1", found none. Requests received are: GET http://localhost:3000/api/data/game/file?title=Hello&image=.

[Killed] BlockStatement
src/app/services/communication.service.ts:35:27
 
     getGameFile(title: string, original: boolean): Observable<string> {
         return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: 'arraybuffer' }).pipe(
-            map((file) => {
-                return URL.createObjectURL(new Blob([file]));
-            }),
+            map((file) => {}),
         );
     }
killedBy: CommunicationService should return a source for the original BMP image
statusReason: Expected undefined to equal 'test'.

[Survived] ArrayDeclaration
src/app/services/communication.service.ts:36:53
     getGameFile(title: string, original: boolean): Observable<string> {
         return this.http.get(`${this.baseUrl}/data/game/file?title=${title}&image=${original ? '1' : '2'}`, { responseType: 'arraybuffer' }).pipe(
             map((file) => {
-                return URL.createObjectURL(new Blob([file]));
+                return URL.createObjectURL(new Blob([]));
             }),
         );

[Killed] BlockStatement
src/app/services/communication.service.ts:41:63
         );
     }
 
-    getGameFiles(title: string): Observable<[string, string]> {
-        return forkJoin([this.getGameFile(title, true), this.getGameFile(title, false)]);
-    }
+    getGameFiles(title: string): Observable<[string, string]> {}
 
     getGames(pageIndex: number): Observable<PageDetails> {
killedBy: CommunicationService should return an observable of two game files
statusReason: Expected spy getGameFile to have been called 2 times. It was called 0 times.

[Survived] BooleanLiteral
src/app/services/communication.service.ts:42:50
     }
 
     getGameFiles(title: string): Observable<[string, string]> {
-        return forkJoin([this.getGameFile(title, true), this.getGameFile(title, false)]);
+        return forkJoin([this.getGameFile(title, false), this.getGameFile(title, false)]);
     }
 

[Survived] BooleanLiteral
src/app/services/communication.service.ts:42:81
     }
 
     getGameFiles(title: string): Observable<[string, string]> {
-        return forkJoin([this.getGameFile(title, true), this.getGameFile(title, false)]);
+        return forkJoin([this.getGameFile(title, true), this.getGameFile(title, true)]);
     }
 

[Killed] BlockStatement
src/app/services/communication.service.ts:45:58
         return forkJoin([this.getGameFile(title, true), this.getGameFile(title, false)]);
     }
 
-    getGames(pageIndex: number): Observable<PageDetails> {
-        return this.http
-            .get(`${this.baseUrl}/data/games?pageIndex=${pageIndex}`, { observe: 'body', responseType: 'text' })
-            .pipe(map((body) => JSON.parse(body)));
-    }
+    getGames(pageIndex: number): Observable<PageDetails> {}
 
     getHistory(): Observable<GameArchive[]> {
killedBy: CommunicationService should return the page details
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/services/communication.service.ts:48:23
     getGames(pageIndex: number): Observable<PageDetails> {
         return this.http
             .get(`${this.baseUrl}/data/games?pageIndex=${pageIndex}`, { observe: 'body', responseType: 'text' })
-            .pipe(map((body) => JSON.parse(body)));
+            .pipe(map(() => undefined));
     }
 
killedBy: CommunicationService should return the page details
statusReason: Expected undefined to equal Object({ games: [  ], isLastPage: true, pageIndex: 0 }).

[Killed] BlockStatement
src/app/services/communication.service.ts:51:45
             .pipe(map((body) => JSON.parse(body)));
     }
 
-    getHistory(): Observable<GameArchive[]> {
-        return this.http.get(`${this.baseUrl}/data/history`, { observe: 'body', responseType: 'text' }).pipe(map((body) => JSON.parse(body)));
-    }
+    getHistory(): Observable<GameArchive[]> {}
 
     deleteGame(title: string) {
killedBy: CommunicationService should return getHistory
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
src/app/services/communication.service.ts:52:114
     }
 
     getHistory(): Observable<GameArchive[]> {
-        return this.http.get(`${this.baseUrl}/data/history`, { observe: 'body', responseType: 'text' }).pipe(map((body) => JSON.parse(body)));
+        return this.http.get(`${this.baseUrl}/data/history`, { observe: 'body', responseType: 'text' }).pipe(map(() => undefined));
     }
 
killedBy: CommunicationService should return getHistory
statusReason: Expected undefined to equal [  ].

[Killed] StringLiteral
src/app/services/communication.service.ts:52:30
     }
 
     getHistory(): Observable<GameArchive[]> {
-        return this.http.get(`${this.baseUrl}/data/history`, { observe: 'body', responseType: 'text' }).pipe(map((body) => JSON.parse(body)));
+        return this.http.get(``, { observe: 'body', responseType: 'text' }).pipe(map((body) => JSON.parse(body)));
     }
 
killedBy: CommunicationService should return getHistory
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:3000/api/data/history", found none. Requests received are: GET .

[Killed] BlockStatement
src/app/services/communication.service.ts:55:31
         return this.http.get(`${this.baseUrl}/data/history`, { observe: 'body', responseType: 'text' }).pipe(map((body) => JSON.parse(body)));
     }
 
-    deleteGame(title: string) {
-        return this.http.delete(`${this.baseUrl}/data/game?title=${title}`);
-    }
+    deleteGame(title: string) {}
 
     deleteAllGames() {
killedBy: CommunicationService deleteGame should send delete request to the correct path
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/services/communication.service.ts:59:22
         return this.http.delete(`${this.baseUrl}/data/game?title=${title}`);
     }
 
-    deleteAllGames() {
-        return this.http.delete(`${this.baseUrl}/data/games`);
-    }
+    deleteAllGames() {}
 
     deleteHistory() {
killedBy: CommunicationService deleteAllGames should send delete request to the correct path
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/services/communication.service.ts:60:33
     }
 
     deleteAllGames() {
-        return this.http.delete(`${this.baseUrl}/data/games`);
+        return this.http.delete(``);
     }
 
killedBy: CommunicationService deleteAllGames should send delete request to the correct path
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:3000/api/data/games", found none. Requests received are: DELETE .

[Killed] BlockStatement
src/app/services/communication.service.ts:63:21
         return this.http.delete(`${this.baseUrl}/data/games`);
     }
 
-    deleteHistory() {
-        return this.http.delete(`${this.baseUrl}/data/history`);
-    }
+    deleteHistory() {}
 }
 
killedBy: CommunicationService deleteAllGames should send delete request to the correct path
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
src/app/services/communication.service.ts:64:33
     }
 
     deleteHistory() {
-        return this.http.delete(`${this.baseUrl}/data/history`);
+        return this.http.delete(``);
     }
 }
killedBy: CommunicationService deleteAllGames should send delete request to the correct path
statusReason: Error: Expected one matching request for criteria "Match URL: http://localhost:3000/api/data/history", found none. Requests received are: DELETE .
