[Killed] BlockStatement
src/app/services/compare.service.ts:36:68
     private virtualContext1: CanvasRenderingContext2D;
     private virtualContext2: CanvasRenderingContext2D;
 
-    constructor(public communicationService: CommunicationService) {
-        this.virtualCanvas1 = document.createElement('canvas');
-        this.virtualCanvas2 = document.createElement('canvas');
-        this.differencesCoords = [];
-    }
+    constructor(public communicationService: CommunicationService) {}
 
     get isComparable() {
killedBy: CreationComponent should iniitialize the canvases; CompareService should be created
statusReason: TypeError: Cannot set properties of undefined (setting 'width')

[Killed] StringLiteral
src/app/services/compare.service.ts:37:54
     private virtualContext2: CanvasRenderingContext2D;
 
     constructor(public communicationService: CommunicationService) {
-        this.virtualCanvas1 = document.createElement('canvas');
+        this.virtualCanvas1 = document.createElement("");
         this.virtualCanvas2 = document.createElement('canvas');
         this.differencesCoords = [];
killedBy: DownloadButtonComponent should create; ImageInputComponent calls compareService.drawImage if there is a file in the input; ToolbarComponent should create
statusReason: InvalidCharacterError: Failed to execute 'createElement' on 'Document': The tag name provided ('') is not a valid name.

[Killed] StringLiteral
src/app/services/compare.service.ts:38:54
 
     constructor(public communicationService: CommunicationService) {
         this.virtualCanvas1 = document.createElement('canvas');
-        this.virtualCanvas2 = document.createElement('canvas');
+        this.virtualCanvas2 = document.createElement("");
         this.differencesCoords = [];
     }
killedBy: DownloadButtonComponent should create; ImageInputComponent calls compareService.drawImage if there is a file in the input; ToolbarComponent should create
statusReason: InvalidCharacterError: Failed to execute 'createElement' on 'Document': The tag name provided ('') is not a valid name.

[Survived] ArrayDeclaration
src/app/services/compare.service.ts:39:34
     constructor(public communicationService: CommunicationService) {
         this.virtualCanvas1 = document.createElement('canvas');
         this.virtualCanvas2 = document.createElement('canvas');
-        this.differencesCoords = [];
+        this.differencesCoords = ["Stryker was here"];
     }
 

[Killed] BlockStatement
src/app/services/compare.service.ts:42:24
         this.differencesCoords = [];
     }
 
-    get isComparable() {
-        return (
-            this.baseContext1 &&
-            this.baseContext2 &&
-            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
-            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
-        );
-    }
+    get isComparable() {}
 
     /**
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected undefined to be truthy.

[Killed] LogicalOperator
src/app/services/compare.service.ts:44:13
 
     get isComparable() {
         return (
-            this.baseContext1 &&
-            this.baseContext2 &&
-            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
+            this.baseContext1 && this.baseContext2 || this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some(channel => channel !== 0) &&
             this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
         );
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected true to be falsy.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:44:13
 
     get isComparable() {
         return (
-            this.baseContext1 &&
-            this.baseContext2 &&
-            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
-            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
+            false
         );
     }
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected false to be truthy.

[Killed] ArrowFunction
src/app/services/compare.service.ts:46:119
         return (
             this.baseContext1 &&
             this.baseContext2 &&
-            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
+            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some(() => undefined) &&
             this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
         );
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected false to be truthy.

[Killed] MethodExpression
src/app/services/compare.service.ts:46:13
         return (
             this.baseContext1 &&
             this.baseContext2 &&
-            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
+            this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.every(channel => channel !== 0) &&
             this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
         );
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected false to be truthy.

[Killed] ArrowFunction
src/app/services/compare.service.ts:47:119
             this.baseContext1 &&
             this.baseContext2 &&
             this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
-            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
+            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some(() => undefined)
         );
     }
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:47:132
             this.baseContext1 &&
             this.baseContext2 &&
             this.baseContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0) &&
-            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => channel !== 0)
+            this.baseContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data.some((channel) => false)
         );
     }
killedBy: CompareService isComparable getter should return true when both canvas display
statusReason: Expected false to be truthy.

[Killed] BlockStatement
src/app/services/compare.service.ts:65:13
         originalLayer2: CanvasRenderingContext2D,
         modifiedLayer1: CanvasRenderingContext2D,
         modifiedLayer2: CanvasRenderingContext2D,
-    ): void {
-        this.baseContext1 = originalLayer1;
-        this.baseContext2 = modifiedLayer1;
-
-        this.overContext1 = originalLayer2;
-        this.overContext2 = modifiedLayer2;
-
-        this.setVirtualCanvasSize();
-
-        this.virtualContext1 = this.virtualCanvas1.getContext('2d') as CanvasRenderingContext2D;
-        this.virtualContext2 = this.virtualCanvas2.getContext('2d') as CanvasRenderingContext2D;
-    }
+    ): void {}
 
     /**
killedBy: CompareService drawImage method should display image_7_diff.bmp with given context only and return ''; CompareService clearImage method should clear canvas; CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Error: <spyOn> : could not find an object to spy upon for drawImage()
Usage: spyOn(<object>, <methodName>)

[Survived] BlockStatement
src/app/services/compare.service.ts:84:79
      *
      * @param differencesContext The context of the canvas to be used to draw the differences.
      */
-    initDifferencesCanvas(differencesContext: CanvasRenderingContext2D): void {
-        this.differencesContext = differencesContext;
-    }
+    initDifferencesCanvas(differencesContext: CanvasRenderingContext2D): void {}
 
     /**

[Timeout] BlockStatement
src/app/services/compare.service.ts:100:63
         // Reads file
         const reader = new FileReader();
         reader.readAsArrayBuffer(file);
-        const view = await new Promise<DataView>((resolve) => {
-            reader.onload = () => resolve(new DataView(reader.result as ArrayBuffer));
-        });
+        const view = await new Promise<DataView>((resolve) => {});
 
         // Verifies BMP format

[Timeout] ArrowFunction
src/app/services/compare.service.ts:101:29
         const reader = new FileReader();
         reader.readAsArrayBuffer(file);
         const view = await new Promise<DataView>((resolve) => {
-            reader.onload = () => resolve(new DataView(reader.result as ArrayBuffer));
+            reader.onload = () => undefined;
         });
 

[Killed] ConditionalExpression
src/app/services/compare.service.ts:105:13
         });
 
         // Verifies BMP format
-        if (view.getUint8(0) !== ImageConstants.BmpFormat0 || view.getUint8(1) !== ImageConstants.BmpFormat1)
+        if (true)
             return 'Le fichier doit être dans un format BMP';
 
killedBy: CompareService drawImage method should not display and return 'Le fichier BMP doit être 24-bit' with 'image_wrong_bit_depth.bmp'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected 'Le fichier doit être dans un format BMP' to equal 'Le fichier BMP doit être 24-bit'.

[Killed] EqualityOperator
src/app/services/compare.service.ts:105:13
         });
 
         // Verifies BMP format
-        if (view.getUint8(0) !== ImageConstants.BmpFormat0 || view.getUint8(1) !== ImageConstants.BmpFormat1)
+        if (view.getUint8(0) === ImageConstants.BmpFormat0 || view.getUint8(1) !== ImageConstants.BmpFormat1)
             return 'Le fichier doit être dans un format BMP';
 
killedBy: CompareService drawImage method should not display and return 'Le fichier BMP doit être 24-bit' with 'image_wrong_bit_depth.bmp'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected 'Le fichier doit être dans un format BMP' to equal 'Le fichier BMP doit être 24-bit'.

[Killed] EqualityOperator
src/app/services/compare.service.ts:109:13
             return 'Le fichier doit être dans un format BMP';
 
         // Verifies 24 bit depth
-        if (view.getUint16(ImageConstants.BitDepthOffset, true) !== ImageConstants.BitDepth24) return 'Le fichier BMP doit être 24-bit';
+        if (view.getUint16(ImageConstants.BitDepthOffset, true) === ImageConstants.BitDepth24) return 'Le fichier BMP doit être 24-bit';
 
         // Generates image
killedBy: CompareService drawImage method should not display and return 'Le fichier BMP doit être 24-bit' with 'image_wrong_bit_depth.bmp'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected '' to equal 'Le fichier BMP doit être 24-bit'.

[Killed] BooleanLiteral
src/app/services/compare.service.ts:109:59
             return 'Le fichier doit être dans un format BMP';
 
         // Verifies 24 bit depth
-        if (view.getUint16(ImageConstants.BitDepthOffset, true) !== ImageConstants.BitDepth24) return 'Le fichier BMP doit être 24-bit';
+        if (view.getUint16(ImageConstants.BitDepthOffset, false) !== ImageConstants.BitDepth24) return 'Le fichier BMP doit être 24-bit';
 
         // Generates image
killedBy: CompareService drawImage method should not display and return 'L'image doit être de résolution 640 x 480 pixels' with 'image_wrong_res.bmp'; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected 'Le fichier BMP doit être 24-bit' to equal 'L'image doit être de résolution 640 x 480 pixels'.

[Timeout] BlockStatement
src/app/services/compare.service.ts:114:58
         // Generates image
         const newImage = new Image();
         newImage.src = window.URL.createObjectURL(file);
-        await new Promise<HTMLImageElement>((resolve) => {
-            newImage.onload = () => resolve(newImage);
-        });
+        await new Promise<HTMLImageElement>((resolve) => {});
 
         // Verifies resolution

[Timeout] ArrowFunction
src/app/services/compare.service.ts:115:31
         const newImage = new Image();
         newImage.src = window.URL.createObjectURL(file);
         await new Promise<HTMLImageElement>((resolve) => {
-            newImage.onload = () => resolve(newImage);
+            newImage.onload = () => undefined;
         });
 

[Killed] EqualityOperator
src/app/services/compare.service.ts:119:13
         });
 
         // Verifies resolution
-        if (newImage.naturalWidth !== ImageConstants.DefaultWidth || newImage.naturalHeight !== ImageConstants.DefaultHeight)
+        if (newImage.naturalWidth === ImageConstants.DefaultWidth || newImage.naturalHeight !== ImageConstants.DefaultHeight)
             return "L'image doit être de résolution 640 x 480 pixels";
 
killedBy: CompareService drawImage method should display image_7_diff.bmp with given context only and return ''; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected 'L'image doit être de résolution 640 x 480 pixels' to equal ''.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:119:13
         });
 
         // Verifies resolution
-        if (newImage.naturalWidth !== ImageConstants.DefaultWidth || newImage.naturalHeight !== ImageConstants.DefaultHeight)
+        if (true)
             return "L'image doit être de résolution 640 x 480 pixels";
 
killedBy: CompareService drawImage method should display image_7_diff.bmp with given context only and return ''; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected 'L'image doit être de résolution 640 x 480 pixels' to equal ''.

[Killed] StringLiteral
src/app/services/compare.service.ts:120:20
 
         // Verifies resolution
         if (newImage.naturalWidth !== ImageConstants.DefaultWidth || newImage.naturalHeight !== ImageConstants.DefaultHeight)
-            return "L'image doit être de résolution 640 x 480 pixels";
+            return "";
 
         // Draws image(s)
killedBy: CompareService drawImage method should not display and return 'L'image doit être de résolution 640 x 480 pixels' with 'image_wrong_res.bmp'
statusReason: Expected '' to equal 'L'image doit être de résolution 640 x 480 pixels'.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:123:13
             return "L'image doit être de résolution 640 x 480 pixels";
 
         // Draws image(s)
-        if (context) context.drawImage(newImage, 0, 0);
+        if (false) context.drawImage(newImage, 0, 0);
         else {
             this.baseContext1.drawImage(newImage, 0, 0);
killedBy: CompareService drawImage method should display image_7_diff.bmp with given context only and return ''; CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference
statusReason: Expected spy drawImage not to have been called.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:123:13
             return "L'image doit être de résolution 640 x 480 pixels";
 
         // Draws image(s)
-        if (context) context.drawImage(newImage, 0, 0);
+        if (true) context.drawImage(newImage, 0, 0);
         else {
             this.baseContext1.drawImage(newImage, 0, 0);
killedBy: CompareService drawImage method should display image_7_diff.bmp on both contexts if none are given
statusReason: TypeError: Cannot read properties of undefined (reading 'drawImage')

[Killed] BlockStatement
src/app/services/compare.service.ts:124:14
 
         // Draws image(s)
         if (context) context.drawImage(newImage, 0, 0);
-        else {
-            this.baseContext1.drawImage(newImage, 0, 0);
-            this.baseContext2.drawImage(newImage, 0, 0);
-        }
+        else {}
         return '';
     }
killedBy: CompareService drawImage method should display image_7_diff.bmp on both contexts if none are given
statusReason: Expected spy drawImage to have been called.

[Killed] BlockStatement
src/app/services/compare.service.ts:136:57
      *
      * @param context The context of the canvas to be reset.
      */
-    clearImage(context: CanvasRenderingContext2D): void {
-        context.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-    }
+    clearImage(context: CanvasRenderingContext2D): void {}
 
     /**
killedBy: CompareService clearImage method should clear canvas; CompareService isComparable getter should return true when both canvas display
statusReason: Expected spy clearRect to have been called.

[Killed] StringLiteral
src/app/services/compare.service.ts:149:45
         // Resets the differences canvas
         this.differencesContext.fillStyle = 'white';
         this.differencesContext.fillRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-        this.differencesContext.fillStyle = 'black';
+        this.differencesContext.fillStyle = "";
 
         // Gets original and modified images data
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:155:25
         const originalData = this.virtualContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
         const modifiedData = this.virtualContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
-        for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
+        for (let y = 0; y >= ImageConstants.DefaultHeight; y++) {
             for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
                 // Converts x and y coordinates into an RGBA array index
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] BlockStatement
src/app/services/compare.service.ts:155:64
         const originalData = this.virtualContext1.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
         const modifiedData = this.virtualContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
-        for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
-                // Converts x and y coordinates into an RGBA array index
-                const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
-
-                // Compares pixels under an arbitrary tolerance
-                if (
-                    Math.abs(originalData[i] - modifiedData[i]) +
-                        Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
-                        Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
-                    ImageConstants.RgbaTolerance
-                )
-                    // Draws the difference according to enlargement
-                    this.differencesContext.fillRect(
-                        Math.max(x - enlargement, 0),
-                        Math.max(y - enlargement, 0),
-                        1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
-                        1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
-                    );
-            }
-        }
+        for (let y = 0; y < ImageConstants.DefaultHeight; y++) {}
     }
 
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:156:29
         const modifiedData = this.virtualContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
+            for (let x = 0; false; x++) {
                 // Converts x and y coordinates into an RGBA array index
                 const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:156:29
         const modifiedData = this.virtualContext2.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
+            for (let x = 0; x >= ImageConstants.DefaultWidth; x++) {
                 // Converts x and y coordinates into an RGBA array index
                 const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:158:28
         for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
             for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
                 // Converts x and y coordinates into an RGBA array index
-                const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
+                const i = (x - y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
 
                 // Compares pixels under an arbitrary tolerance
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:158:27
         for (let y = 0; y < ImageConstants.DefaultHeight; y++) {
             for (let x = 0; x < ImageConstants.DefaultWidth; x++) {
                 // Converts x and y coordinates into an RGBA array index
-                const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
+                const i = (x + y * ImageConstants.DefaultWidth) / ImageConstants.RgbaComponentsPerPixel;
 
                 // Compares pixels under an arbitrary tolerance
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 4 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:162:21
 
                 // Compares pixels under an arbitrary tolerance
                 if (
-                    Math.abs(originalData[i] - modifiedData[i]) +
-                        Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
-                        Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
-                    ImageConstants.RgbaTolerance
+                    true
                 )
                     // Draws the difference according to enlargement
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 307201 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:162:21
 
                 // Compares pixels under an arbitrary tolerance
                 if (
-                    Math.abs(originalData[i] - modifiedData[i]) +
-                        Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
-                        Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
-                    ImageConstants.RgbaTolerance
+                    false
                 )
                     // Draws the difference according to enlargement
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:163:47
                 // Compares pixels under an arbitrary tolerance
                 if (
                     Math.abs(originalData[i] - modifiedData[i]) +
-                        Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
+                        Math.abs(originalData[i - 1] - modifiedData[i + 1]) +
                         Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
                     ImageConstants.RgbaTolerance
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:163:69
                 // Compares pixels under an arbitrary tolerance
                 if (
                     Math.abs(originalData[i] - modifiedData[i]) +
-                        Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
+                        Math.abs(originalData[i + 1] - modifiedData[i - 1]) +
                         Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
                     ImageConstants.RgbaTolerance
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:164:47
                 if (
                     Math.abs(originalData[i] - modifiedData[i]) +
                         Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
-                        Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
+                        Math.abs(originalData[i - 2] - modifiedData[i + 2]) >
                     ImageConstants.RgbaTolerance
                 )
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.
