[Killed] ArithmeticOperator
src/app/services/compare.service.ts:164:69
                 if (
                     Math.abs(originalData[i] - modifiedData[i]) +
                         Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
-                        Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
+                        Math.abs(originalData[i + 2] - modifiedData[i - 2]) >
                     ImageConstants.RgbaTolerance
                 )
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 0, 17, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:169:34
                 )
                     // Draws the difference according to enlargement
                     this.differencesContext.fillRect(
-                        Math.max(x - enlargement, 0),
+                        Math.max(x + enlargement, 0),
                         Math.max(y - enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 15, 0, 16, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] MethodExpression
src/app/services/compare.service.ts:169:25
                 )
                     // Draws the difference according to enlargement
                     this.differencesContext.fillRect(
-                        Math.max(x - enlargement, 0),
+                        Math.min(x - enlargement, 0),
                         Math.max(y - enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ -15, 0, 16, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:170:34
                     // Draws the difference according to enlargement
                     this.differencesContext.fillRect(
                         Math.max(x - enlargement, 0),
-                        Math.max(y - enlargement, 0),
+                        Math.max(y + enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
                         1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 15, 16, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] MethodExpression
src/app/services/compare.service.ts:170:25
                     // Draws the difference according to enlargement
                     this.differencesContext.fillRect(
                         Math.max(x - enlargement, 0),
-                        Math.max(y - enlargement, 0),
+                        Math.min(y - enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
                         1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, -15, 16, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:171:25
                     this.differencesContext.fillRect(
                         Math.max(x - enlargement, 0),
                         Math.max(y - enlargement, 0),
-                        1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
+                        1 - Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
                         1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
                     );
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 0, -14, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] MethodExpression
src/app/services/compare.service.ts:171:90
                     this.differencesContext.fillRect(
                         Math.max(x - enlargement, 0),
                         Math.max(y - enlargement, 0),
-                        1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
+                        1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.max(x, enlargement),
                         1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
                     );
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 0, 31, 16 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] MethodExpression
src/app/services/compare.service.ts:172:29
                         Math.max(x - enlargement, 0),
                         Math.max(y - enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
-                        1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
+                        1 + Math.max(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
                     );
             }
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 0, 16, 640 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] MethodExpression
src/app/services/compare.service.ts:172:90
                         Math.max(x - enlargement, 0),
                         Math.max(y - enlargement, 0),
                         1 + Math.min(ImageConstants.DefaultWidth - x - 1, enlargement) + Math.min(x, enlargement),
-                        1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.min(y, enlargement),
+                        1 + Math.min(ImageConstants.DefaultWidth - y - 1, enlargement) + Math.max(y, enlargement),
                     );
             }
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called with:
  [ 0, 0, 16, 16 ]
but actual calls were:
  [ 0, 0, 640, 480 ],
  [ 0, 0, 16, 31 ].

Call 0:
  Expected $[2] = 640 to equal 16.

[Killed] BlockStatement
src/app/services/compare.service.ts:183:27
      *
      * @returns An object containing the computed difficulty and number of differences.
      */
-    validateDifferences() {
-        this.differencesCoords = [];
-        let data = this.differencesContext.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-
-        for (let y = 0; y < ImageConstants.DefaultHeight; y++)
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++)
-                if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
-
-        return { difficulty: this.getDifficulty(), nbDifferences: this.differencesCoords.length };
-    }
+    validateDifferences() {}
 
     /**
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:187:25
         this.differencesCoords = [];
         let data = this.differencesContext.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
-        for (let y = 0; y < ImageConstants.DefaultHeight; y++)
+        for (let y = 0; false; y++)
             for (let x = 0; x < ImageConstants.DefaultWidth; x++)
                 if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:187:25
         this.differencesCoords = [];
         let data = this.differencesContext.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
-        for (let y = 0; y < ImageConstants.DefaultHeight; y++)
+        for (let y = 0; y >= ImageConstants.DefaultHeight; y++)
             for (let x = 0; x < ImageConstants.DefaultWidth; x++)
                 if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:188:29
         let data = this.differencesContext.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++)
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++)
+            for (let x = 0; x >= ImageConstants.DefaultWidth; x++)
                 if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
 
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:188:29
         let data = this.differencesContext.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++)
-            for (let x = 0; x < ImageConstants.DefaultWidth; x++)
+            for (let x = 0; false; x++)
                 if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
 
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:189:27
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++)
             for (let x = 0; x < ImageConstants.DefaultWidth; x++)
-                if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
+                if (data[(x - y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
 
         return { difficulty: this.getDifficulty(), nbDifferences: this.differencesCoords.length };
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:189:31
 
         for (let y = 0; y < ImageConstants.DefaultHeight; y++)
             for (let x = 0; x < ImageConstants.DefaultWidth; x++)
-                if (data[(x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
+                if (data[(x + y / ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel] === 0) data = this.floodFill(x, y, data);
 
         return { difficulty: this.getDifficulty(), nbDifferences: this.differencesCoords.length };
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 0 times.

[Killed] BlockStatement
src/app/services/compare.service.ts:205:53
     createGame(gameTitle: string, diff: string): Observable<boolean> {
         const myObservable = this.communicationService.titleExistsGet(gameTitle);
 
-        myObservable.subscribe((exists: boolean) => {
-            if (!exists) {
-                const firstImage = this.virtualCanvas1.toDataURL();
-                const secondImage = this.virtualCanvas2.toDataURL();
-
-                const game: Game = {
-                    title: gameTitle,
-                    image1: firstImage,
-                    image2: secondImage,
-                    differences: this.differencesCoords,
-                    bestTimes: {
-                        solo: [],
-                        versus: [],
-                    },
-                    isHard: diff === 'difficile',
-                };
-                this.communicationService.createGamePost(game).subscribe();
-                this.clearImage(this.virtualContext1);
-                this.clearImage(this.virtualContext2);
-            }
-        });
+        myObservable.subscribe((exists: boolean) => {});
         return myObservable;
     }
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:206:17
         const myObservable = this.communicationService.titleExistsGet(gameTitle);
 
         myObservable.subscribe((exists: boolean) => {
-            if (!exists) {
+            if (false) {
                 const firstImage = this.virtualCanvas1.toDataURL();
                 const secondImage = this.virtualCanvas2.toDataURL();
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but it was never called.

[Killed] BlockStatement
src/app/services/compare.service.ts:206:26
         const myObservable = this.communicationService.titleExistsGet(gameTitle);
 
         myObservable.subscribe((exists: boolean) => {
-            if (!exists) {
-                const firstImage = this.virtualCanvas1.toDataURL();
-                const secondImage = this.virtualCanvas2.toDataURL();
-
-                const game: Game = {
-                    title: gameTitle,
-                    image1: firstImage,
-                    image2: secondImage,
-                    differences: this.differencesCoords,
-                    bestTimes: {
-                        solo: [],
-                        versus: [],
-                    },
-                    isHard: diff === 'difficile',
-                };
-                this.communicationService.createGamePost(game).subscribe();
-                this.clearImage(this.virtualContext1);
-                this.clearImage(this.virtualContext2);
-            }
+            if (!exists) {}
         });
         return myObservable;
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but it was never called.

[Killed] ArrayDeclaration
src/app/services/compare.service.ts:216:31
                     image2: secondImage,
                     differences: this.differencesCoords,
                     bestTimes: {
-                        solo: [],
+                        solo: ["Stryker was here"],
                         versus: [],
                     },
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but actual calls were:

Call 0:
  Expected $[0].bestTimes.solo.length = 1 to equal 0.
  Unexpected $[0].bestTimes.solo[0] = 'Stryker was here' in array.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:219:29
                         solo: [],
                         versus: [],
                     },
-                    isHard: diff === 'difficile',
+                    isHard: true,
                 };
                 this.communicationService.createGamePost(game).subscribe();
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but actual calls were:

Call 0:
  Expected $[0].isHard = true to equal false.
Error: Expected spy createGamePost to have been called with:

[Killed] EqualityOperator
src/app/services/compare.service.ts:219:29
                         solo: [],
                         versus: [],
                     },
-                    isHard: diff === 'difficile',
+                    isHard: diff !== 'difficile',
                 };
                 this.communicationService.createGamePost(game).subscribe();
killedBy: CompareService createGame method should create if title does not exist
statusReason: Expected spy createGamePost to have been called with:
  [ Object({ title: '1', image1: <jasmine.any(String)>, image2: <jasmine.any(String)>, differences: [  ], bestTimes: Object({ solo: [  ], versus: [  ] }), isHard: false }) ]
but actual calls were:

Call 0:
  Expected $[0].isHard = true to equal false.
Error: Expected spy createGamePost to have been called with:

[Killed] BlockStatement
src/app/services/compare.service.ts:236:27
      * @param originalLayer the second layer of the left ImageInputComponent.
      * @param modifiedLayer the second layer of the right ImageInputComponent.
      */
-    mergeCanvases(): void {
-        this.virtualContext1.drawImage(this.baseContext1.canvas, 0, 0);
-        this.virtualContext1.drawImage(this.overContext1.canvas, 0, 0);
-        this.virtualContext2.drawImage(this.baseContext2.canvas, 0, 0);
-        this.virtualContext2.drawImage(this.overContext2.canvas, 0, 0);
-    }
+    mergeCanvases(): void {}
 
     /**
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 1 times.

[Timeout] ArrayDeclaration
src/app/services/compare.service.ts:253:24
      * @returns The image data updated with marked found pixels.
      */
     private floodFill(x0: number, y0: number, data: Uint8ClampedArray): Uint8ClampedArray {
-        const queue = [[x0, y0]]; // Queues the initial pixel
+        const queue = [[]]; // Queues the initial pixel
         const differenceCoords: Pixel[] = [];
         while (queue.length) {

[Timeout] ArrayDeclaration
src/app/services/compare.service.ts:253:23
      * @returns The image data updated with marked found pixels.
      */
     private floodFill(x0: number, y0: number, data: Uint8ClampedArray): Uint8ClampedArray {
-        const queue = [[x0, y0]]; // Queues the initial pixel
+        const queue = []; // Queues the initial pixel
         const differenceCoords: Pixel[] = [];
         while (queue.length) {

[Killed] ConditionalExpression
src/app/services/compare.service.ts:255:16
     private floodFill(x0: number, y0: number, data: Uint8ClampedArray): Uint8ClampedArray {
         const queue = [[x0, y0]]; // Queues the initial pixel
         const differenceCoords: Pixel[] = [];
-        while (queue.length) {
+        while (false) {
             const [x, y] = queue.pop() as number[];
             const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Timeout] BlockStatement
src/app/services/compare.service.ts:255:30
     private floodFill(x0: number, y0: number, data: Uint8ClampedArray): Uint8ClampedArray {
         const queue = [[x0, y0]]; // Queues the initial pixel
         const differenceCoords: Pixel[] = [];
-        while (queue.length) {
-            const [x, y] = queue.pop() as number[];
-            const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
-            // Evaluates if pixel has been visited
-            if (data[i] === 0) {
-                differenceCoords.push({ x, y });
-                data[i] = 1;
-
-                // Queues adjacent pixels
-                [
-                    [x - 1, y],
-                    [x + 1, y],
-                    [x, y - 1],
-                    [x, y + 1],
-                    [x - 1, y - 1],
-                    [x + 1, y - 1],
-                    [x - 1, y + 1],
-                    [x + 1, y + 1],
-                ].forEach(([xx, yy]) => {
-                    const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
-                    const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
-                    if (xxInBounds && yyInBounds) queue.push([xx, yy]);
-                });
-            }
-        }
+        while (queue.length) {}
         this.differencesCoords.push(differenceCoords); // Adds difference to the set
         return data;

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:257:24
         const differenceCoords: Pixel[] = [];
         while (queue.length) {
             const [x, y] = queue.pop() as number[];
-            const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
+            const i = (x - y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
             // Evaluates if pixel has been visited
             if (data[i] === 0) {
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:257:28
         const differenceCoords: Pixel[] = [];
         while (queue.length) {
             const [x, y] = queue.pop() as number[];
-            const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
+            const i = (x + y / ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
             // Evaluates if pixel has been visited
             if (data[i] === 0) {
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] BlockStatement
src/app/services/compare.service.ts:259:32
             const [x, y] = queue.pop() as number[];
             const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
             // Evaluates if pixel has been visited
-            if (data[i] === 0) {
-                differenceCoords.push({ x, y });
-                data[i] = 1;
-
-                // Queues adjacent pixels
-                [
-                    [x - 1, y],
-                    [x + 1, y],
-                    [x, y - 1],
-                    [x, y + 1],
-                    [x - 1, y - 1],
-                    [x + 1, y - 1],
-                    [x - 1, y + 1],
-                    [x + 1, y + 1],
-                ].forEach(([xx, yy]) => {
-                    const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
-                    const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
-                    if (xxInBounds && yyInBounds) queue.push([xx, yy]);
-                });
-            }
+            if (data[i] === 0) {}
         }
         this.differencesCoords.push(differenceCoords); // Adds difference to the set
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:259:17
             const [x, y] = queue.pop() as number[];
             const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
             // Evaluates if pixel has been visited
-            if (data[i] === 0) {
+            if (data[i] !== 0) {
                 differenceCoords.push({ x, y });
                 data[i] = 1;
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Survived] ObjectLiteral
src/app/services/compare.service.ts:260:39
             const i = (x + y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel; // Computes RGBA index
             // Evaluates if pixel has been visited
             if (data[i] === 0) {
-                differenceCoords.push({ x, y });
+                differenceCoords.push({});
                 data[i] = 1;
 
