[Killed] ArrayDeclaration
src/app/services/compare.service.ts:264:17
                 data[i] = 1;
 
                 // Queues adjacent pixels
-                [
-                    [x - 1, y],
-                    [x + 1, y],
-                    [x, y - 1],
-                    [x, y + 1],
-                    [x - 1, y - 1],
-                    [x + 1, y - 1],
-                    [x - 1, y + 1],
-                    [x + 1, y + 1],
-                ].forEach(([xx, yy]) => {
+                [].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
                     const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:265:22
 
                 // Queues adjacent pixels
                 [
-                    [x - 1, y],
+                    [x + 1, y],
                     [x + 1, y],
                     [x, y - 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:266:22
                 // Queues adjacent pixels
                 [
                     [x - 1, y],
-                    [x + 1, y],
+                    [x - 1, y],
                     [x, y - 1],
                     [x, y + 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:267:25
                 [
                     [x - 1, y],
                     [x + 1, y],
-                    [x, y - 1],
+                    [x, y + 1],
                     [x, y + 1],
                     [x - 1, y - 1],

[Survived] ArrayDeclaration
src/app/services/compare.service.ts:267:21
                 [
                     [x - 1, y],
                     [x + 1, y],
-                    [x, y - 1],
+                    [],
                     [x, y + 1],
                     [x - 1, y - 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:268:25
                     [x - 1, y],
                     [x + 1, y],
                     [x, y - 1],
-                    [x, y + 1],
+                    [x, y - 1],
                     [x - 1, y - 1],
                     [x + 1, y - 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:269:29
                     [x + 1, y],
                     [x, y - 1],
                     [x, y + 1],
-                    [x - 1, y - 1],
+                    [x - 1, y + 1],
                     [x + 1, y - 1],
                     [x - 1, y + 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:269:22
                     [x + 1, y],
                     [x, y - 1],
                     [x, y + 1],
-                    [x - 1, y - 1],
+                    [x + 1, y - 1],
                     [x + 1, y - 1],
                     [x - 1, y + 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:270:22
                     [x, y - 1],
                     [x, y + 1],
                     [x - 1, y - 1],
-                    [x + 1, y - 1],
+                    [x - 1, y - 1],
                     [x - 1, y + 1],
                     [x + 1, y + 1],

[Survived] ArithmeticOperator
src/app/services/compare.service.ts:270:29
                     [x, y - 1],
                     [x, y + 1],
                     [x - 1, y - 1],
-                    [x + 1, y - 1],
+                    [x + 1, y + 1],
                     [x - 1, y + 1],
                     [x + 1, y + 1],

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:271:22
                     [x, y + 1],
                     [x - 1, y - 1],
                     [x + 1, y - 1],
-                    [x - 1, y + 1],
+                    [x + 1, y + 1],
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
killedBy: CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected 12 to equal 8.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:271:29
                     [x, y + 1],
                     [x - 1, y - 1],
                     [x + 1, y - 1],
-                    [x - 1, y + 1],
+                    [x - 1, y - 1],
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
killedBy: CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected 12 to equal 8.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:272:29
                     [x - 1, y - 1],
                     [x + 1, y - 1],
                     [x - 1, y + 1],
-                    [x + 1, y + 1],
+                    [x + 1, y - 1],
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
killedBy: CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected 10 to equal 8.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:272:22
                     [x - 1, y - 1],
                     [x + 1, y - 1],
                     [x - 1, y + 1],
-                    [x + 1, y + 1],
+                    [x - 1, y + 1],
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
killedBy: CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected 10 to equal 8.

[Killed] BlockStatement
src/app/services/compare.service.ts:273:41
                     [x + 1, y - 1],
                     [x - 1, y + 1],
                     [x + 1, y + 1],
-                ].forEach(([xx, yy]) => {
-                    const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
-                    const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
-                    if (xxInBounds && yyInBounds) queue.push([xx, yy]);
-                });
+                ].forEach(([xx, yy]) => {});
             }
         }
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:274:40
                     [x - 1, y + 1],
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
-                    const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
+                    const xxInBounds = false;
                     const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
                     if (xxInBounds && yyInBounds) queue.push([xx, yy]);
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:274:40
                     [x - 1, y + 1],
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
-                    const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
+                    const xxInBounds = xx < 0 && xx < ImageConstants.DefaultWidth;
                     const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
                     if (xxInBounds && yyInBounds) queue.push([xx, yy]);
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:275:40
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
-                    const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
+                    const yyInBounds = false;
                     if (xxInBounds && yyInBounds) queue.push([xx, yy]);
                 });
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] EqualityOperator
src/app/services/compare.service.ts:275:51
                     [x + 1, y + 1],
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
-                    const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
+                    const yyInBounds = yy >= 0 && yy >= ImageConstants.DefaultHeight;
                     if (xxInBounds && yyInBounds) queue.push([xx, yy]);
                 });
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:276:25
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
                     const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
-                    if (xxInBounds && yyInBounds) queue.push([xx, yy]);
+                    if (false) queue.push([xx, yy]);
                 });
             }
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 8329 times.

[Survived] ConditionalExpression
src/app/services/compare.service.ts:276:25
                 ].forEach(([xx, yy]) => {
                     const xxInBounds = xx >= 0 && xx < ImageConstants.DefaultWidth;
                     const yyInBounds = yy >= 0 && yy < ImageConstants.DefaultHeight;
-                    if (xxInBounds && yyInBounds) queue.push([xx, yy]);
+                    if (true) queue.push([xx, yy]);
                 });
             }

[Killed] BlockStatement
src/app/services/compare.service.ts:289:37
      *
      * @returns The game's difficulty.
      */
-    private getDifficulty(): string {
-        if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
-            return 'invalide';
-        return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
-            (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
-            ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
-            ? 'difficile'
-            : 'facile';
-    }
+    private getDifficulty(): string {}
 
     /**
killedBy: CompareService getDifficulty method should return 'facile' for 6 or less differences
statusReason: Expected undefined to equal 'facile'.

[Killed] LogicalOperator
src/app/services/compare.service.ts:290:13
      * @returns The game's difficulty.
      */
     private getDifficulty(): string {
-        if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
+        if (this.differencesCoords.length < ImageConstants.NbDifferencesMin && this.differencesCoords.length > ImageConstants.NbDifferencesMax)
             return 'invalide';
         return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
killedBy: CompareService getDifficulty method should return 'invalide' for differences not between 3 and 9
statusReason: Expected 'facile' to equal 'invalide'.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:290:13
      * @returns The game's difficulty.
      */
     private getDifficulty(): string {
-        if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
+        if (true)
             return 'invalide';
         return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
killedBy: CompareService getDifficulty method should return 'facile' for 6 or less differences
statusReason: Expected 'invalide' to equal 'facile'.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:292:16
     private getDifficulty(): string {
         if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
             return 'invalide';
-        return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
-            (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
-            ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
+        return true
             ? 'difficile'
             : 'facile';
killedBy: CompareService getDifficulty method should return 'facile' for 6 or less differences
statusReason: Expected 'difficile' to equal 'facile'.

[Killed] ConditionalExpression
src/app/services/compare.service.ts:292:16
     private getDifficulty(): string {
         if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
             return 'invalide';
-        return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
-            (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
-            ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
+        return true && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
             ? 'difficile'
             : 'facile';
killedBy: CompareService getDifficulty method should return 'facile' for more then 15% different pixels
statusReason: Expected 'difficile' to equal 'facile'.

[Killed] ArithmeticOperator
src/app/services/compare.service.ts:293:14
         if (this.differencesCoords.length < ImageConstants.NbDifferencesMin || this.differencesCoords.length > ImageConstants.NbDifferencesMax)
             return 'invalide';
         return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
-            (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
+            (ImageConstants.DefaultWidth / ImageConstants.DefaultHeight) <=
             ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
             ? 'difficile'
killedBy: CompareService getDifficulty method should return 'difficile' for more than 6 differences and less than 15% different pixels
statusReason: Expected 'facile' to equal 'difficile'.

[Killed] EqualityOperator
src/app/services/compare.service.ts:294:52
             return 'invalide';
         return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
             (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
-            ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
+            ImageConstants.DifficultyPercentage && this.differencesCoords.length > ImageConstants.NbDifferencesHardDifficulty
             ? 'difficile'
             : 'facile';
killedBy: CompareService getDifficulty method should return 'difficile' for more than 6 differences and less than 15% different pixels
statusReason: Expected 'facile' to equal 'difficile'.

[Killed] EqualityOperator
src/app/services/compare.service.ts:294:52
             return 'invalide';
         return this.differencesCoords.reduce((acc, difference) => acc + difference.length, 0) /
             (ImageConstants.DefaultWidth * ImageConstants.DefaultHeight) <=
-            ImageConstants.DifficultyPercentage && this.differencesCoords.length >= ImageConstants.NbDifferencesHardDifficulty
+            ImageConstants.DifficultyPercentage && this.differencesCoords.length < ImageConstants.NbDifferencesHardDifficulty
             ? 'difficile'
             : 'facile';
killedBy: CompareService getDifficulty method should return 'facile' for 6 or less differences
statusReason: Expected 'difficile' to equal 'facile'.

[Killed] BlockStatement
src/app/services/compare.service.ts:302:42
     /**
      * Sets the height and width of the virtual canvases to the default image size (640px x 480px).
      */
-    private setVirtualCanvasSize(): void {
-        this.virtualCanvas1.width = ImageConstants.DefaultWidth;
-        this.virtualCanvas1.height = ImageConstants.DefaultHeight;
-        this.virtualCanvas2.width = ImageConstants.DefaultWidth;
-        this.virtualCanvas2.height = ImageConstants.DefaultHeight;
-    }
+    private setVirtualCanvasSize(): void {}
 }
 
killedBy: CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy floodFill to have been called 7 times. It was called 2 times.
