[Killed] BlockStatement
src/app/services/counter.service.ts:15:63
 
     private handleDifferenceFound: (difference: Pixel[]) => void;
 
-    constructor(private gameSocketService: GameSocketService) {
-        this.count = 0;
-        this.differenceCounter = new Subject<number>();
-    }
+    constructor(private gameSocketService: GameSocketService) {}
 
     init(playerName: string): void {
killedBy: DifferenceCounterComponent should create; CounterService should handle difference found; PlaybackService startPlayback
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
src/app/services/counter.service.ts:20:36
         this.differenceCounter = new Subject<number>();
     }
 
-    init(playerName: string): void {
-        this.handleDifferenceFound = ((difference: Pixel[]) => {
-            this.handleWithoutSave(difference);
-            this.gameSocketService.handleDifferenceFound(playerName, difference);
-        }).bind(this);
-        this.gameSocketService.socketService.on(`differenceFound${playerName}`, this.handleDifferenceFound);
-    }
+    init(playerName: string): void {}
 
     handleWithoutSave(difference: Pixel[]): void {
killedBy: CounterService should handle difference found
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BlockStatement
src/app/services/counter.service.ts:21:64
     }
 
     init(playerName: string): void {
-        this.handleDifferenceFound = ((difference: Pixel[]) => {
-            this.handleWithoutSave(difference);
-            this.gameSocketService.handleDifferenceFound(playerName, difference);
-        }).bind(this);
+        this.handleDifferenceFound = ((difference: Pixel[]) => {}).bind(this);
         this.gameSocketService.socketService.on(`differenceFound${playerName}`, this.handleDifferenceFound);
     }
killedBy: CounterService should handle difference found
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] StringLiteral
src/app/services/counter.service.ts:25:49
             this.handleWithoutSave(difference);
             this.gameSocketService.handleDifferenceFound(playerName, difference);
         }).bind(this);
-        this.gameSocketService.socketService.on(`differenceFound${playerName}`, this.handleDifferenceFound);
+        this.gameSocketService.socketService.on(``, this.handleDifferenceFound);
     }
 
killedBy: CounterService should handle difference found
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BlockStatement
src/app/services/counter.service.ts:28:50
         this.gameSocketService.socketService.on(`differenceFound${playerName}`, this.handleDifferenceFound);
     }
 
-    handleWithoutSave(difference: Pixel[]): void {
-        this.gameSocketService.playFeedbackSound(true);
-        this.gameSocketService.gameFeedbackService.drawDifference(difference);
-        this.differenceCounter.next(++this.count);
-    }
+    handleWithoutSave(difference: Pixel[]): void {}
 
     destroy(playerName: string) {
killedBy: CounterService should handle difference found
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/counter.service.ts:29:50
     }
 
     handleWithoutSave(difference: Pixel[]): void {
-        this.gameSocketService.playFeedbackSound(true);
+        this.gameSocketService.playFeedbackSound(false);
         this.gameSocketService.gameFeedbackService.drawDifference(difference);
         this.differenceCounter.next(++this.count);
killedBy: CounterService should handle difference found
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but actual calls were:
  [ false ].

Call 0:
  Expected $[0] = false to equal true.
Error: Expected spy GameSocketService.playFeedbackSound to have been called with:

[Killed] UpdateOperator
src/app/services/counter.service.ts:31:37
     handleWithoutSave(difference: Pixel[]): void {
         this.gameSocketService.playFeedbackSound(true);
         this.gameSocketService.gameFeedbackService.drawDifference(difference);
-        this.differenceCounter.next(++this.count);
+        this.differenceCounter.next(--this.count);
     }
 
killedBy: CounterService should handle difference found
statusReason: Expected -1 to equal 1.

[Survived] BlockStatement
src/app/services/counter.service.ts:34:33
         this.differenceCounter.next(++this.count);
     }
 
-    destroy(playerName: string) {
-        this.gameSocketService.socketService.socket.off(`differenceFound${playerName}`, this.handleDifferenceFound);
-    }
+    destroy(playerName: string) {}
 }
 
