[Killed] BlockStatement
src/app/services/draw.service.ts:22:57
     private activeTool: Tool | undefined;
     private tools: { [key: string]: Tool };
 
-    constructor(private historyService: HistoryService) {
-        this.tools = {
-            pencil: new Pencil(),
-            eraser: new Eraser(),
-            rectangle: new Rectangle(),
-        };
-    }
+    constructor(private historyService: HistoryService) {}
 
     get tool() {
killedBy: DrawService changeShapeType method should return immediately if active tool is not rectangle
statusReason: TypeError: Cannot set properties of undefined (setting 'rectangle')

[Survived] ObjectLiteral
src/app/services/draw.service.ts:23:22
     private tools: { [key: string]: Tool };
 
     constructor(private historyService: HistoryService) {
-        this.tools = {
-            pencil: new Pencil(),
-            eraser: new Eraser(),
-            rectangle: new Rectangle(),
-        };
+        this.tools = {};
     }
 

[Killed] BlockStatement
src/app/services/draw.service.ts:30:16
         };
     }
 
-    get tool() {
-        return this.activeTool ? this.activeTool.toString() : '';
-    }
+    get tool() {}
 
     /**
killedBy: DrawService should have a getter for the active tool
statusReason: Expected undefined to equal ''.

[Survived] BlockStatement
src/app/services/draw.service.ts:43:80
      * @param canvas1 the left canvas.
      * @param canvas2 the right canvas.
      */
-    initContexts(canvas1: HTMLCanvasElement, canvas2: HTMLCanvasElement): void {
-        Tool.drawColor = DrawConstants.DefaultColor;
-        Tool.drawWidth = DrawConstants.DefaultWidth;
-        Tool.rectangleColor = DrawConstants.DefaultColor;
-        Tool.eraserWidth = DrawConstants.DefaultWidth;
-
-        this.middleCtxLeft = (canvas1.querySelector('canvas#layer-2') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-        this.middleCtxRight = (canvas2.querySelector('canvas#layer-2') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-        this.topCtxLeft = (canvas1.querySelector('canvas#layer-3') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-        this.topCtxRight = (canvas2.querySelector('canvas#layer-3') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
-
-        this.topCtxLeft.lineJoin = 'round';
-        this.topCtxLeft.lineCap = 'round';
-        this.topCtxRight.lineJoin = 'round';
-        this.topCtxRight.lineCap = 'round';
-        this.middleCtxLeft.lineCap = 'square';
-        this.middleCtxRight.lineCap = 'square';
-
-        this.topCtxLeft.canvas.addEventListener('mousedown', this.startTool);
-        this.topCtxRight.canvas.addEventListener('mousedown', this.startTool);
-        window.addEventListener('mouseup', this.stopTool);
-        window.addEventListener('keydown', this.changeShapeType);
-        window.addEventListener('keyup', this.changeShapeType);
-    }
+    initContexts(canvas1: HTMLCanvasElement, canvas2: HTMLCanvasElement): void {}
 
     /**

[Survived] StringLiteral
src/app/services/draw.service.ts:55:35
         this.topCtxRight = (canvas2.querySelector('canvas#layer-3') as HTMLCanvasElement).getContext('2d') as CanvasRenderingContext2D;
 
         this.topCtxLeft.lineJoin = 'round';
-        this.topCtxLeft.lineCap = 'round';
+        this.topCtxLeft.lineCap = "";
         this.topCtxRight.lineJoin = 'round';
         this.topCtxRight.lineCap = 'round';

[Survived] StringLiteral
src/app/services/draw.service.ts:56:37
 
         this.topCtxLeft.lineJoin = 'round';
         this.topCtxLeft.lineCap = 'round';
-        this.topCtxRight.lineJoin = 'round';
+        this.topCtxRight.lineJoin = "";
         this.topCtxRight.lineCap = 'round';
         this.middleCtxLeft.lineCap = 'square';

[Survived] StringLiteral
src/app/services/draw.service.ts:64:33
         this.topCtxLeft.canvas.addEventListener('mousedown', this.startTool);
         this.topCtxRight.canvas.addEventListener('mousedown', this.startTool);
         window.addEventListener('mouseup', this.stopTool);
-        window.addEventListener('keydown', this.changeShapeType);
+        window.addEventListener("", this.changeShapeType);
         window.addEventListener('keyup', this.changeShapeType);
     }

[Killed] BlockStatement
src/app/services/draw.service.ts:73:36
      *
      * @param tool The tool to enable. Values can be 'pencil', 'rectangle' or 'eraser'.
      */
-    toggleTool(tool: string): void {
-        const newTool = this.tools[tool];
-        this.activeTool = this.activeTool === newTool ? undefined : newTool;
-    }
+    toggleTool(tool: string): void {}
 
     /**
killedBy: DrawService toggleTool should toggle tool according to active tool
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:75:27
      */
     toggleTool(tool: string): void {
         const newTool = this.tools[tool];
-        this.activeTool = this.activeTool === newTool ? undefined : newTool;
+        this.activeTool = false ? undefined : newTool;
     }
 
killedBy: DrawService toggleTool should toggle tool according to active tool
statusReason: Expected false to be truthy.

[Killed] EqualityOperator
src/app/services/draw.service.ts:75:27
      */
     toggleTool(tool: string): void {
         const newTool = this.tools[tool];
-        this.activeTool = this.activeTool === newTool ? undefined : newTool;
+        this.activeTool = this.activeTool !== newTool ? undefined : newTool;
     }
 
killedBy: DrawService toggleTool should toggle tool according to active tool
statusReason: Expected false to be truthy.

[Killed] BlockStatement
src/app/services/draw.service.ts:84:48
      *
      * @param event the mousedown event.
      */
-    private startTool = (event: MouseEvent) => {
-        if (!this.activeTool) return;
-
-        if (event.target === this.topCtxLeft.canvas) {
-            Tool.currentMiddleCtx = this.middleCtxLeft;
-            Tool.currentTopCtx = this.topCtxLeft;
-        } else {
-            Tool.currentMiddleCtx = this.middleCtxRight;
-            Tool.currentTopCtx = this.topCtxRight;
-        }
-
-        this.usingTool = true;
-        this.historyService.saveState(this.historyService.undoArr, true);
-        Tool.currentTopCtx.canvas.addEventListener('mousemove', this.activeTool.move);
-        Tool.currentTopCtx.canvas.addEventListener('mouseover', this.activeTool.enter);
-        this.activeTool.start(event);
-    };
+    private startTool = (event: MouseEvent) => {};
 
     /**
killedBy: DrawService function properties should resolve correctly
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:85:13
      * @param event the mousedown event.
      */
     private startTool = (event: MouseEvent) => {
-        if (!this.activeTool) return;
+        if (false) return;
 
         if (event.target === this.topCtxLeft.canvas) {
killedBy: DrawService should return immediately when tool is undefined when the tool starts
statusReason: TypeError: Cannot read properties of undefined (reading 'move')

[Killed] BooleanLiteral
src/app/services/draw.service.ts:85:13
      * @param event the mousedown event.
      */
     private startTool = (event: MouseEvent) => {
-        if (!this.activeTool) return;
+        if (this.activeTool) return;
 
         if (event.target === this.topCtxLeft.canvas) {
killedBy: DrawService function properties should resolve correctly
statusReason: Expected false to be truthy.

[Survived] EqualityOperator
src/app/services/draw.service.ts:87:13
     private startTool = (event: MouseEvent) => {
         if (!this.activeTool) return;
 
-        if (event.target === this.topCtxLeft.canvas) {
+        if (event.target !== this.topCtxLeft.canvas) {
             Tool.currentMiddleCtx = this.middleCtxLeft;
             Tool.currentTopCtx = this.topCtxLeft;

[Survived] ConditionalExpression
src/app/services/draw.service.ts:87:13
     private startTool = (event: MouseEvent) => {
         if (!this.activeTool) return;
 
-        if (event.target === this.topCtxLeft.canvas) {
+        if (false) {
             Tool.currentMiddleCtx = this.middleCtxLeft;
             Tool.currentTopCtx = this.topCtxLeft;

[Survived] BlockStatement
src/app/services/draw.service.ts:90:16
         if (event.target === this.topCtxLeft.canvas) {
             Tool.currentMiddleCtx = this.middleCtxLeft;
             Tool.currentTopCtx = this.topCtxLeft;
-        } else {
-            Tool.currentMiddleCtx = this.middleCtxRight;
-            Tool.currentTopCtx = this.topCtxRight;
-        }
+        } else {}
 
         this.usingTool = true;

[Killed] BooleanLiteral
src/app/services/draw.service.ts:95:26
             Tool.currentTopCtx = this.topCtxRight;
         }
 
-        this.usingTool = true;
+        this.usingTool = false;
         this.historyService.saveState(this.historyService.undoArr, true);
         Tool.currentTopCtx.canvas.addEventListener('mousemove', this.activeTool.move);
killedBy: DrawService function properties should resolve correctly
statusReason: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/services/draw.service.ts:96:68
         }
 
         this.usingTool = true;
-        this.historyService.saveState(this.historyService.undoArr, true);
+        this.historyService.saveState(this.historyService.undoArr, false);
         Tool.currentTopCtx.canvas.addEventListener('mousemove', this.activeTool.move);
         Tool.currentTopCtx.canvas.addEventListener('mouseover', this.activeTool.enter);
killedBy: DrawService function properties should resolve correctly
statusReason: Expected spy HistoryService.saveState to have been called with:
  [ [ 1, 2, 3 ], true ]
but actual calls were:
  [ [ 1, 2, 3 ], false ].

Call 0:
  Expected $[1] = false to equal true.
Error: Expected spy HistoryService.saveState to have been called with:

[Killed] StringLiteral
src/app/services/draw.service.ts:98:52
         this.usingTool = true;
         this.historyService.saveState(this.historyService.undoArr, true);
         Tool.currentTopCtx.canvas.addEventListener('mousemove', this.activeTool.move);
-        Tool.currentTopCtx.canvas.addEventListener('mouseover', this.activeTool.enter);
+        Tool.currentTopCtx.canvas.addEventListener("", this.activeTool.enter);
         this.activeTool.start(event);
     };
killedBy: DrawService function properties should resolve correctly
statusReason: Expected spy HTMLCanvasElement.addEventListener to have been called with:
  [ 'mouseover', Function ]
but actual calls were:
  [ 'mousemove', Function ],
  [ '', Function ].

Call 0:
  Expected $[0] = 'mousemove' to equal 'mouseover'.

[Killed] BlockStatement
src/app/services/draw.service.ts:106:30
      * Global event handler that resolves which tool's functions to call for mouseup and
      * to remove from event handlers for mousemove and mouseover.
      */
-    private stopTool = () => {
-        if (!this.activeTool) return;
-        this.usingTool = false;
-        Tool.currentTopCtx.canvas.removeEventListener('mousemove', this.activeTool.move);
-        Tool.currentTopCtx.canvas.removeEventListener('mouseover', this.activeTool.enter);
-        this.activeTool.stop();
-    };
+    private stopTool = () => {};
 
     /**
killedBy: DrawService function properties should resolve correctly
statusReason: Expected true to be falsy.

[Killed] BooleanLiteral
src/app/services/draw.service.ts:107:13
      * to remove from event handlers for mousemove and mouseover.
      */
     private stopTool = () => {
-        if (!this.activeTool) return;
+        if (this.activeTool) return;
         this.usingTool = false;
         Tool.currentTopCtx.canvas.removeEventListener('mousemove', this.activeTool.move);
killedBy: DrawService should return immediately when tool is undefined when the tool stops
statusReason: TypeError: Cannot read properties of undefined (reading 'move')

[Killed] ConditionalExpression
src/app/services/draw.service.ts:107:13
      * to remove from event handlers for mousemove and mouseover.
      */
     private stopTool = () => {
-        if (!this.activeTool) return;
+        if (true) return;
         this.usingTool = false;
         Tool.currentTopCtx.canvas.removeEventListener('mousemove', this.activeTool.move);
killedBy: DrawService function properties should resolve correctly
statusReason: Expected true to be falsy.

[Killed] BooleanLiteral
src/app/services/draw.service.ts:108:26
      */
     private stopTool = () => {
         if (!this.activeTool) return;
-        this.usingTool = false;
+        this.usingTool = true;
         Tool.currentTopCtx.canvas.removeEventListener('mousemove', this.activeTool.move);
         Tool.currentTopCtx.canvas.removeEventListener('mouseover', this.activeTool.enter);
killedBy: DrawService function properties should resolve correctly
statusReason: Expected true to be falsy.

[Killed] StringLiteral
src/app/services/draw.service.ts:110:55
         if (!this.activeTool) return;
         this.usingTool = false;
         Tool.currentTopCtx.canvas.removeEventListener('mousemove', this.activeTool.move);
-        Tool.currentTopCtx.canvas.removeEventListener('mouseover', this.activeTool.enter);
+        Tool.currentTopCtx.canvas.removeEventListener("", this.activeTool.enter);
         this.activeTool.stop();
     };
killedBy: DrawService function properties should resolve correctly
statusReason: Expected spy HTMLCanvasElement.removeEventListener to have been called with:
  [ 'mouseover', Function ]
but actual calls were:
  [ 'mousemove', Function ],
  [ '', Function ].

Call 0:
  Expected $[0] = 'mousemove' to equal 'mouseover'.

[Killed] BlockStatement
src/app/services/draw.service.ts:119:57
      *
      * @param event the KeyBoardEvent
      */
-    private changeShapeType = (event: KeyboardEvent) => {
-        if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
-            const rectangle = this.activeTool as Rectangle;
-            rectangle.isSquare = event.type === 'keydown';
-            if (!this.usingTool) return;
-            if (rectangle.isSquare) rectangle.drawSquare();
-            else rectangle.drawRectangle();
-        }
-    };
+    private changeShapeType = (event: KeyboardEvent) => {};
 }
 
killedBy: DrawService changeShapeType method should not draw shape if tool is not being used
statusReason: Expected undefined to be truthy.

[Killed] LogicalOperator
src/app/services/draw.service.ts:120:13
      * @param event the KeyBoardEvent
      */
     private changeShapeType = (event: KeyboardEvent) => {
-        if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
+        if (this.activeTool === this.tools.rectangle || event.key === 'Shift') {
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
killedBy: DrawService changeShapeType method should return immediately if pressed key is not Shift
statusReason: Expected true to be falsy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:120:13
      * @param event the KeyBoardEvent
      */
     private changeShapeType = (event: KeyboardEvent) => {
-        if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
+        if (false) {
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
killedBy: DrawService changeShapeType method should not draw shape if tool is not being used
statusReason: Expected undefined to be truthy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:122:34
     private changeShapeType = (event: KeyboardEvent) => {
         if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
             const rectangle = this.activeTool as Rectangle;
-            rectangle.isSquare = event.type === 'keydown';
+            rectangle.isSquare = true;
             if (!this.usingTool) return;
             if (rectangle.isSquare) rectangle.drawSquare();
killedBy: DrawService changeShapeType method should not draw shape if tool is not being used
statusReason: Expected true to be falsy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:122:34
     private changeShapeType = (event: KeyboardEvent) => {
         if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
             const rectangle = this.activeTool as Rectangle;
-            rectangle.isSquare = event.type === 'keydown';
+            rectangle.isSquare = false;
             if (!this.usingTool) return;
             if (rectangle.isSquare) rectangle.drawSquare();
killedBy: DrawService changeShapeType method should not draw shape if tool is not being used
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:123:17
         if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
-            if (!this.usingTool) return;
+            if (true) return;
             if (rectangle.isSquare) rectangle.drawSquare();
             else rectangle.drawRectangle();
killedBy: DrawService changeShapeType method should draw square on keydown
statusReason: Expected spy Rectangle.drawSquare to have been called.

[Killed] BooleanLiteral
src/app/services/draw.service.ts:123:17
         if (this.activeTool === this.tools.rectangle && event.key === 'Shift') {
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
-            if (!this.usingTool) return;
+            if (this.usingTool) return;
             if (rectangle.isSquare) rectangle.drawSquare();
             else rectangle.drawRectangle();
killedBy: DrawService changeShapeType method should not draw shape if tool is not being used
statusReason: Expected spy Rectangle.drawSquare not to have been called.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:124:17
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
             if (!this.usingTool) return;
-            if (rectangle.isSquare) rectangle.drawSquare();
+            if (false) rectangle.drawSquare();
             else rectangle.drawRectangle();
         }
killedBy: DrawService changeShapeType method should draw square on keydown
statusReason: Expected spy Rectangle.drawSquare to have been called.

[Killed] ConditionalExpression
src/app/services/draw.service.ts:124:17
             const rectangle = this.activeTool as Rectangle;
             rectangle.isSquare = event.type === 'keydown';
             if (!this.usingTool) return;
-            if (rectangle.isSquare) rectangle.drawSquare();
+            if (true) rectangle.drawSquare();
             else rectangle.drawRectangle();
         }
killedBy: DrawService changeShapeType method should draw rectangle on keyup
statusReason: Expected spy Rectangle.drawRectangle to have been called.
