[Timeout] BlockStatement
src/app/services/game-feedback.service.ts:39:19
     private flickerTimeoutId: ReturnType<typeof setTimeout>;
     private isFlickering: boolean;
 
-    constructor() {
-        this.isCheating = false;
-        this.flickerSpeed = GameFeedbackConstants.FlickerDelay;
-        this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay;
-
-        this.tempCanvas = document.createElement('canvas');
-        this.tempCanvas.width = ImageConstants.DefaultWidth;
-        this.tempCanvas.height = ImageConstants.DefaultHeight;
-        this.tempCtx = this.tempCanvas.getContext('2d') as CanvasRenderingContext2D;
-    }
+    constructor() {}
 
     get left(): PlayAreaLayers {

[Survived] BooleanLiteral
src/app/services/game-feedback.service.ts:40:27
     private isFlickering: boolean;
 
     constructor() {
-        this.isCheating = false;
+        this.isCheating = true;
         this.flickerSpeed = GameFeedbackConstants.FlickerDelay;
         this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay;

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:50:32
         this.tempCtx = this.tempCanvas.getContext('2d') as CanvasRenderingContext2D;
     }
 
-    get left(): PlayAreaLayers {
-        return this.leftLayers;
-    }
+    get left(): PlayAreaLayers {}
 
     get right(): PlayAreaLayers {
killedBy: gameFeedback getters  should get left layer; PlaybackService resumePlayback

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:54:33
         return this.leftLayers;
     }
 
-    get right(): PlayAreaLayers {
-        return this.rightLayers;
-    }
+    get right(): PlayAreaLayers {}
 
     /**
killedBy: gameFeedback getters  should get right layer; PlaybackService resumePlayback

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:65:71
      * @param leftLayers The original canvas image and differences layers, as CanvasRenderingContext2ds.
      * @param rightLayers The modified canvas image and differences layers, as CanvasRenderingContext2ds.
      */
-    initData(leftLayers: PlayAreaLayers, rightLayers: PlayAreaLayers) {
-        this.leftLayers = leftLayers;
-        this.leftData = leftLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-        this.rightLayers = rightLayers;
-        this.rightData = rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-    }
+    initData(leftLayers: PlayAreaLayers, rightLayers: PlayAreaLayers) {}
 
     setFlickerSpeed(speed: number) {
killedBy: gameFeedback initData method should set private properties; gameFeedback drawDifference method should call patchDifference if player is cheating; gameFeedback setFlickerSpeed method should set flickerspeed

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:72:36
         this.rightData = rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
     }
 
-    setFlickerSpeed(speed: number) {
-        this.flickerSpeed = GameFeedbackConstants.FlickerDelay / speed;
-        this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay / speed;
-        this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
-        this.leftLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
-    }
+    setFlickerSpeed(speed: number) {}
 
     /**
killedBy: gameFeedback setFlickerSpeed method should set flickerspeed
statusReason: Expected 50 to equal 0.5.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:73:29
     }
 
     setFlickerSpeed(speed: number) {
-        this.flickerSpeed = GameFeedbackConstants.FlickerDelay / speed;
+        this.flickerSpeed = GameFeedbackConstants.FlickerDelay * speed;
         this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay / speed;
         this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
killedBy: gameFeedback setFlickerSpeed method should set flickerspeed
statusReason: Expected 5000 to equal 0.5.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:74:30
 
     setFlickerSpeed(speed: number) {
         this.flickerSpeed = GameFeedbackConstants.FlickerDelay / speed;
-        this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay / speed;
+        this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay * speed;
         this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
         this.leftLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
killedBy: gameFeedback setFlickerSpeed method should set flickerspeed
statusReason: Expected 12500 to equal 1.25.

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:75:65
     setFlickerSpeed(speed: number) {
         this.flickerSpeed = GameFeedbackConstants.FlickerDelay / speed;
         this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay / speed;
-        this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
+        this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor * this.flickerSpeed).toLocaleString();
         this.leftLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
     }

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:76:64
         this.flickerSpeed = GameFeedbackConstants.FlickerDelay / speed;
         this.cheatingSpeed = GameFeedbackConstants.CheatFlickerDelay / speed;
         this.rightLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
-        this.leftLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor / this.flickerSpeed).toLocaleString();
+        this.leftLayers.clue.canvas.style.animationDuration = (GameFeedbackConstants.FlickerAnimationFactor * this.flickerSpeed).toLocaleString();
     }
 
killedBy: gameFeedback setFlickerSpeed method should set flickerspeed
statusReason: Expected '0,125' to equal '0,5'.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:84:41
      *
      * @param difference The array of pixels to draw.
      */
-    drawDifference(difference: Pixel[]) {
-        this.clearClueCanvas();
-        if (this.isCheating) this.patchDifference(difference, this.leftData);
-        else this.flicker(difference, GameFeedbackConstants.NbFlickers);
-    }
+    drawDifference(difference: Pixel[]) {}
 
     /**
killedBy: gameFeedback drawDifference method should call patchDifference if player is cheating
statusReason: Expected spy patchDifference to have been called with:
  [ [ Object({ x: 0, y: 0 }), Object({ x: 1, y: 0 }), Object({ x: 1, y: 1 }), Object({ x: 1, y: 2 }) ], Uint8ClampedArray [ 0, 0, 0, 0 ] ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:86:13
      */
     drawDifference(difference: Pixel[]) {
         this.clearClueCanvas();
-        if (this.isCheating) this.patchDifference(difference, this.leftData);
+        if (true) this.patchDifference(difference, this.leftData);
         else this.flicker(difference, GameFeedbackConstants.NbFlickers);
     }
killedBy: gameFeedback drawDifference method should call patchDifference if player is not cheating
statusReason: Expected spy flicker to have been called with:
  [ [ Object({ x: 0, y: 0 }), Object({ x: 1, y: 0 }), Object({ x: 1, y: 1 }), Object({ x: 1, y: 2 }) ], 10 ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:86:13
      */
     drawDifference(difference: Pixel[]) {
         this.clearClueCanvas();
-        if (this.isCheating) this.patchDifference(difference, this.leftData);
+        if (false) this.patchDifference(difference, this.leftData);
         else this.flicker(difference, GameFeedbackConstants.NbFlickers);
     }
killedBy: gameFeedback drawDifference method should call patchDifference if player is cheating
statusReason: Expected spy patchDifference to have been called with:
  [ [ Object({ x: 0, y: 0 }), Object({ x: 1, y: 0 }), Object({ x: 1, y: 1 }), Object({ x: 1, y: 2 }) ], Uint8ClampedArray [ 0, 0, 0, 0 ] ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:95:29
      *
      * @param pixel The position at which to draw word on currentErrorCtx.
      */
-    drawError(pixel: Pixel) {
-        this.currentErrorCtx.fillText('Erreur', pixel.x, pixel.y);
-    }
+    drawError(pixel: Pixel) {}
 
     /**
killedBy: gameFeedback drawError method should call currentErrorCtx's fillText method
statusReason: Expected spy CanvasRenderingContext2D.fillText to have been called with:
  [ 'Erreur', 0, 1 ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:103:18
      * Clears word 'Error' on currentErrorCtx. Should be called after user is unfrozen from an error.
      * currentErrorCtx should not have changed while user was frozen.
      */
-    clearError() {
-        this.currentErrorCtx.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-    }
+    clearError() {}
 
     /**
killedBy: gameFeedback clearError method should call currentErrorCtx's clearRect method
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called with:
  [ 0, 0, 640, 480 ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:111:19
      * Toggles cheating. isCheating should be set with this method to trigger differences flickering.
      * isCheating can be set directly to false if cheating shouldn't carry through multiple games.
      */
-    toggleCheat() {
-        this.isCheating = !this.isCheating;
-        if (this.isCheating && !this.isFlickering) this.flickerCheat();
-    }
+    toggleCheat() {}
 
     /**
killedBy: gameFeedback toggleCheat method should switch isCheating property
statusReason: Expected false to be truthy.

[Killed] BooleanLiteral
src/app/services/game-feedback.service.ts:112:27
      * isCheating can be set directly to false if cheating shouldn't carry through multiple games.
      */
     toggleCheat() {
-        this.isCheating = !this.isCheating;
+        this.isCheating = this.isCheating;
         if (this.isCheating && !this.isFlickering) this.flickerCheat();
     }
killedBy: gameFeedback toggleCheat method should switch isCheating property
statusReason: Expected false to be truthy.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:113:13
      */
     toggleCheat() {
         this.isCheating = !this.isCheating;
-        if (this.isCheating && !this.isFlickering) this.flickerCheat();
+        if (true) this.flickerCheat();
     }
 
killedBy: gameFeedback toggleCheat method should call flickerCheat when player is cheating
statusReason: Expected spy flickerCheat not to have been called.

[Killed] BooleanLiteral
src/app/services/game-feedback.service.ts:113:32
      */
     toggleCheat() {
         this.isCheating = !this.isCheating;
-        if (this.isCheating && !this.isFlickering) this.flickerCheat();
+        if (this.isCheating && this.isFlickering) this.flickerCheat();
     }
 
killedBy: gameFeedback toggleCheat method should call flickerCheat when player is cheating
statusReason: Expected spy flickerCheat to have been called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:121:30
      *
      * @param pixels The pixel from which to compute the clue quadrant, or pixels to shake for the third custom clue.
      */
-    useClue(pixels: Pixel[]) {
-        this.clearClueCanvas();
-        if (this.nbClues > 1) {
-            this.leftLayers.clue.canvas.classList.remove('shake');
-            this.rightLayers.clue.canvas.classList.remove('shake');
-            this.leftLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
-            this.rightLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
-
-            const sizeIndex = this.nbClues-- - 2;
-            const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
-            const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
-            this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
-            this.rightLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
-        } else if (this.nbClues-- === 1) {
-            this.leftData = this.leftLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-            this.rightData = this.rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-            this.patchDifference(pixels);
-            this.leftLayers.clue.canvas.classList.add('shake');
-            this.rightLayers.clue.canvas.classList.add('shake');
-        }
-    }
+    useClue(pixels: Pixel[]) {}
 
     /**
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: Expected spy clearClueCanvas to have been called.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:123:13
      */
     useClue(pixels: Pixel[]) {
         this.clearClueCanvas();
-        if (this.nbClues > 1) {
+        if (false) {
             this.leftLayers.clue.canvas.classList.remove('shake');
             this.rightLayers.clue.canvas.classList.remove('shake');
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues >1)
statusReason: Expected shake not to contain 'shake'.

[Killed] EqualityOperator
src/app/services/game-feedback.service.ts:123:13
      */
     useClue(pixels: Pixel[]) {
         this.clearClueCanvas();
-        if (this.nbClues > 1) {
+        if (this.nbClues <= 1) {
             this.leftLayers.clue.canvas.classList.remove('shake');
             this.rightLayers.clue.canvas.classList.remove('shake');
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: TypeError: Cannot read properties of undefined (reading 'width')

[Killed] StringLiteral
src/app/services/game-feedback.service.ts:124:58
     useClue(pixels: Pixel[]) {
         this.clearClueCanvas();
         if (this.nbClues > 1) {
-            this.leftLayers.clue.canvas.classList.remove('shake');
+            this.leftLayers.clue.canvas.classList.remove("");
             this.rightLayers.clue.canvas.classList.remove('shake');
             this.leftLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues >1)
statusReason: SyntaxError: Failed to execute 'remove' on 'DOMTokenList': The token provided must not be empty.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:129:31
             this.leftLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
             this.rightLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
 
-            const sizeIndex = this.nbClues-- - 2;
+            const sizeIndex = this.nbClues-- + 2;
             const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues >1)
statusReason: TypeError: Cannot read properties of undefined (reading 'width')

[Survived] UpdateOperator
src/app/services/game-feedback.service.ts:129:31
             this.leftLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
             this.rightLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
 
-            const sizeIndex = this.nbClues-- - 2;
+            const sizeIndex = this.nbClues++ - 2;
             const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:130:68
             this.rightLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
 
             const sizeIndex = this.nbClues-- - 2;
-            const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
+            const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x * QUADRANT_SIZES[sizeIndex].width);
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:130:23
             this.rightLayers.clue.fillStyle = 'rgba(0, 255, 0, 0.3)';
 
             const sizeIndex = this.nbClues-- - 2;
-            const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
+            const x = QUADRANT_SIZES[sizeIndex].width / Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:131:23
 
             const sizeIndex = this.nbClues-- - 2;
             const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
-            const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
+            const y = QUADRANT_SIZES[sizeIndex].height / Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
             this.rightLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:131:69
 
             const sizeIndex = this.nbClues-- - 2;
             const x = QUADRANT_SIZES[sizeIndex].width * Math.floor(pixels[0].x / QUADRANT_SIZES[sizeIndex].width);
-            const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
+            const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y * QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
             this.rightLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);

[Killed] EqualityOperator
src/app/services/game-feedback.service.ts:134:20
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
             this.rightLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
-        } else if (this.nbClues-- === 1) {
+        } else if (this.nbClues-- !== 1) {
             this.leftData = this.leftLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
             this.rightData = this.rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: Expected spy patch to have been called with:
  [ [ Object({ x: 0, y: 0 }), Object({ x: 1, y: 1 }) ] ]
but it was never called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:134:42
             const y = QUADRANT_SIZES[sizeIndex].height * Math.floor(pixels[0].y / QUADRANT_SIZES[sizeIndex].height);
             this.leftLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
             this.rightLayers.clue.fillRect(x, y, QUADRANT_SIZES[sizeIndex].width, QUADRANT_SIZES[sizeIndex].height);
-        } else if (this.nbClues-- === 1) {
-            this.leftData = this.leftLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-            this.rightData = this.rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
-            this.patchDifference(pixels);
-            this.leftLayers.clue.canvas.classList.add('shake');
-            this.rightLayers.clue.canvas.classList.add('shake');
-        }
+        } else if (this.nbClues-- === 1) {}
     }
 
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: Expected spy patch to have been called with:
  [ [ Object({ x: 0, y: 0 }), Object({ x: 1, y: 1 }) ] ]
but it was never called.

[Killed] StringLiteral
src/app/services/game-feedback.service.ts:138:55
             this.leftData = this.leftLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
             this.rightData = this.rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
             this.patchDifference(pixels);
-            this.leftLayers.clue.canvas.classList.add('shake');
+            this.leftLayers.clue.canvas.classList.add("");
             this.rightLayers.clue.canvas.classList.add('shake');
         }
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: SyntaxError: Failed to execute 'add' on 'DOMTokenList': The token provided must not be empty.

[Killed] StringLiteral
src/app/services/game-feedback.service.ts:139:56
             this.rightData = this.rightLayers.image.getImageData(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight).data;
             this.patchDifference(pixels);
             this.leftLayers.clue.canvas.classList.add('shake');
-            this.rightLayers.clue.canvas.classList.add('shake');
+            this.rightLayers.clue.canvas.classList.add("");
         }
     }
killedBy: gameFeedback LimitedTime methods useClue should call clearClueCanvas(nbClues == 1)
statusReason: SyntaxError: Failed to execute 'add' on 'DOMTokenList': The token provided must not be empty.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:147:27
      * Synchronizes clues and cheat flickering effects with the newly downloaded images, should be called on difference
      * found in limited time game.
      */
-    synchronizeNewSheet() {
-        this.clearClueCanvas();
-        clearTimeout(this.flickerTimeoutId);
-        if (this.isCheating) this.flickerCheat();
-    }
+    synchronizeNewSheet() {}
 
     /**
killedBy: gameFeedback LimitedTime methods synchronizedNewSheet shoould call clearClue Canvas
statusReason: Expected spy clearClueCanvas to have been called.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:150:13
     synchronizeNewSheet() {
         this.clearClueCanvas();
         clearTimeout(this.flickerTimeoutId);
-        if (this.isCheating) this.flickerCheat();
+        if (false) this.flickerCheat();
     }
 
killedBy: gameFeedback LimitedTime methods synchronizedNewSheet shoould call clearClue Canvas
statusReason: Expected spy flickerCheat to have been called.

[Survived] ConditionalExpression
src/app/services/game-feedback.service.ts:150:13
     synchronizeNewSheet() {
         this.clearClueCanvas();
         clearTimeout(this.flickerTimeoutId);
-        if (this.isCheating) this.flickerCheat();
+        if (true) this.flickerCheat();
     }
 

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:157:24
      * Removes all differences from the difference layers.
      * Called when a user starts the replay of a game to put the layers back to their original state.
      */
-    clearDifferences() {
-        this.leftLayers.diff.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-        this.rightLayers.diff.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-    }
+    clearDifferences() {}
 
     /**
killedBy: gameFeedback LimitedTime methods clearDifferences should call clearRect
statusReason: Expected spy CanvasRenderingContext2D.clearRect to have been called.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:166:21
      * Clears all timeouts set by this service when a difference flickers.
      * This is necessary to prevent flickering when a user viewing a replay presses the restart button while a difference is flickering.
      */
-    clearTimeouts() {
-        clearTimeout(this.flickerOuter);
-        clearTimeout(this.flickerInner);
-    }
+    clearTimeouts() {}
 
     /**
killedBy: gameFeedback LimitedTime methods clearTimeout should call cleartimeout
statusReason: Expected spy clearTimeout to have been called 2 times. It was called 0 times.

[Survived] BlockStatement
src/app/services/game-feedback.service.ts:174:23
     /**
      * Clears green quadrant overlay for clue, should be called when a difference is found or when the images change.
      */
-    clearClueCanvas() {
-        this.leftLayers.clue.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-        this.rightLayers.clue.clearRect(0, 0, ImageConstants.DefaultWidth, ImageConstants.DefaultHeight);
-    }
+    clearClueCanvas() {}
 
     /**

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:182:28
     /**
      * Swaps the image layers and repeats until isCheating is false.
      */
-    private flickerCheat() {
-        this.isFlickering = true;
-        this.flickerTimeoutId = setTimeout(() => {
-            this.tempCtx.drawImage(this.leftLayers.image.canvas, 0, 0);
-            this.leftLayers.image.drawImage(this.rightLayers.image.canvas, 0, 0);
-            this.rightLayers.image.drawImage(this.tempCanvas, 0, 0);
-            this.flickerTimeoutId = setTimeout(() => {
-                this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
-                this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
-                if (this.isCheating) this.flickerCheat();
-                else this.isFlickering = false;
-            }, this.cheatingSpeed);
-        }, this.cheatingSpeed);
-    }
+    private flickerCheat() {}
 
     /**
killedBy: gameFeedback flickerCheat method should call recursively while isCheating is true
statusReason: Expected spy flickerCheat to have been called 2 times. It was called 1 times.

[Survived] BooleanLiteral
src/app/services/game-feedback.service.ts:183:29
      * Swaps the image layers and repeats until isCheating is false.
      */
     private flickerCheat() {
-        this.isFlickering = true;
+        this.isFlickering = false;
         this.flickerTimeoutId = setTimeout(() => {
             this.tempCtx.drawImage(this.leftLayers.image.canvas, 0, 0);

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:184:50
      */
     private flickerCheat() {
         this.isFlickering = true;
-        this.flickerTimeoutId = setTimeout(() => {
-            this.tempCtx.drawImage(this.leftLayers.image.canvas, 0, 0);
-            this.leftLayers.image.drawImage(this.rightLayers.image.canvas, 0, 0);
-            this.rightLayers.image.drawImage(this.tempCanvas, 0, 0);
-            this.flickerTimeoutId = setTimeout(() => {
-                this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
-                this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
-                if (this.isCheating) this.flickerCheat();
-                else this.isFlickering = false;
-            }, this.cheatingSpeed);
-        }, this.cheatingSpeed);
+        this.flickerTimeoutId = setTimeout(() => {}, this.cheatingSpeed);
     }
 
killedBy: gameFeedback flickerCheat method should call recursively while isCheating is true
statusReason: Expected spy flickerCheat to have been called 2 times. It was called 1 times.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:188:54
             this.tempCtx.drawImage(this.leftLayers.image.canvas, 0, 0);
             this.leftLayers.image.drawImage(this.rightLayers.image.canvas, 0, 0);
             this.rightLayers.image.drawImage(this.tempCanvas, 0, 0);
-            this.flickerTimeoutId = setTimeout(() => {
-                this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
-                this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
-                if (this.isCheating) this.flickerCheat();
-                else this.isFlickering = false;
-            }, this.cheatingSpeed);
+            this.flickerTimeoutId = setTimeout(() => {}, this.cheatingSpeed);
         }, this.cheatingSpeed);
     }
killedBy: gameFeedback flickerCheat method should call recursively while isCheating is true
statusReason: Expected spy flickerCheat to have been called 2 times. It was called 1 times.
