[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:191:21
             this.flickerTimeoutId = setTimeout(() => {
                 this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
                 this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
-                if (this.isCheating) this.flickerCheat();
+                if (true) this.flickerCheat();
                 else this.isFlickering = false;
             }, this.cheatingSpeed);
killedBy: gameFeedback flickerCheat method should stop recursive calls after isCheating is toggled to false once
statusReason: Expected spy flickerCheat to have been called once. It was called 2 times.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:191:21
             this.flickerTimeoutId = setTimeout(() => {
                 this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
                 this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
-                if (this.isCheating) this.flickerCheat();
+                if (false) this.flickerCheat();
                 else this.isFlickering = false;
             }, this.cheatingSpeed);
killedBy: gameFeedback flickerCheat method should call recursively while isCheating is true
statusReason: Expected spy flickerCheat to have been called 2 times. It was called 1 times.

[Survived] BooleanLiteral
src/app/services/game-feedback.service.ts:192:42
                 this.rightLayers.image.drawImage(this.leftLayers.image.canvas, 0, 0);
                 this.leftLayers.image.drawImage(this.tempCanvas, 0, 0);
                 if (this.isCheating) this.flickerCheat();
-                else this.isFlickering = false;
+                else this.isFlickering = true;
             }, this.cheatingSpeed);
         }, this.cheatingSpeed);

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:203:57
      * @param difference The array of pixels to draw and swap.
      * @param count The remaining number of times to swap layers.
      */
-    private flicker(difference: Pixel[], count: number) {
-        this.flickerOuter = setTimeout(() => {
-            this.patchDifference(difference, this.rightData);
-            this.flickerInner = setTimeout(() => {
-                this.patchDifference(difference, this.leftData);
-                if (--count > 0) this.flicker(difference, count);
-            }, this.flickerSpeed);
-        }, this.flickerSpeed);
-    }
+    private flicker(difference: Pixel[], count: number) {}
 
     /**
killedBy: gameFeedback flicker method should call recursively for the initial count amount of times
statusReason: Expected spy flicker to have been called 10 times. It was called 1 times.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:204:46
      * @param count The remaining number of times to swap layers.
      */
     private flicker(difference: Pixel[], count: number) {
-        this.flickerOuter = setTimeout(() => {
-            this.patchDifference(difference, this.rightData);
-            this.flickerInner = setTimeout(() => {
-                this.patchDifference(difference, this.leftData);
-                if (--count > 0) this.flicker(difference, count);
-            }, this.flickerSpeed);
-        }, this.flickerSpeed);
+        this.flickerOuter = setTimeout(() => {}, this.flickerSpeed);
     }
 
killedBy: gameFeedback flicker method should call recursively for the initial count amount of times
statusReason: Expected spy flicker to have been called 10 times. It was called 1 times.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:206:50
     private flicker(difference: Pixel[], count: number) {
         this.flickerOuter = setTimeout(() => {
             this.patchDifference(difference, this.rightData);
-            this.flickerInner = setTimeout(() => {
-                this.patchDifference(difference, this.leftData);
-                if (--count > 0) this.flicker(difference, count);
-            }, this.flickerSpeed);
+            this.flickerInner = setTimeout(() => {}, this.flickerSpeed);
         }, this.flickerSpeed);
     }
killedBy: gameFeedback flicker method should call recursively for the initial count amount of times
statusReason: Expected spy flicker to have been called 10 times. It was called 1 times.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:208:21
             this.patchDifference(difference, this.rightData);
             this.flickerInner = setTimeout(() => {
                 this.patchDifference(difference, this.leftData);
-                if (--count > 0) this.flicker(difference, count);
+                if (true) this.flicker(difference, count);
             }, this.flickerSpeed);
         }, this.flickerSpeed);
killedBy: gameFeedback flicker method should call recursively for the initial count amount of times
statusReason: Expected spy flicker to have been called 10 times. It was called 11 times.

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:208:21
             this.patchDifference(difference, this.rightData);
             this.flickerInner = setTimeout(() => {
                 this.patchDifference(difference, this.leftData);
-                if (--count > 0) this.flicker(difference, count);
+                if (false) this.flicker(difference, count);
             }, this.flickerSpeed);
         }, this.flickerSpeed);
killedBy: gameFeedback flicker method should call recursively for the initial count amount of times
statusReason: Expected spy flicker to have been called 10 times. It was called 1 times.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:219:99
      * @param difference The pixels which to take from specified data.
      * @param data The canvas' image data to use for drawing on the difference layers.
      */
-    private patchDifference(difference: Pixel[], data: Uint8ClampedArray | undefined = undefined) {
-        let fillStyle;
-        difference.forEach((pixel) => {
-            const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
-            if (data) {
-                fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
-                this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
-                this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
-            } else {
-                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
-                this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
-                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
-                this.drawOnCanvas(this.leftLayers.clue, fillStyle, pixel);
-            }
-        });
-    }
+    private patchDifference(difference: Pixel[], data: Uint8ClampedArray | undefined = undefined) {}
 
     /**
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $.length = 0 to equal 4.
Expected $[0] = undefined to equal [ Object({ fillRect: spy on CanvasRenderingContext2D.fillRect, clearRect: spy on CanvasRenderingContext2D.clearRect }), 'rgb(0, 0, 1)', Object({ x: 0, y: 0 }) ].
Expected $[1] = undefined to equal [ Object({ fillRect: spy on CanvasRenderingContext2D.fillRect, clearRect: spy on CanvasRenderingContext2D.clearRect }), 'rgb(0, 0, 1)'

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:221:39
      */
     private patchDifference(difference: Pixel[], data: Uint8ClampedArray | undefined = undefined) {
         let fillStyle;
-        difference.forEach((pixel) => {
-            const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
-            if (data) {
-                fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
-                this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
-                this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
-            } else {
-                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
-                this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
-                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
-                this.drawOnCanvas(this.leftLayers.clue, fillStyle, pixel);
-            }
-        });
+        difference.forEach((pixel) => {});
     }
 
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $.length = 0 to equal 4.
Expected $[0] = undefined to equal [ Object({ fillRect: spy on CanvasRenderingContext2D.fillRect, clearRect: spy on CanvasRenderingContext2D.clearRect }), 'rgb(0, 0, 1)', Object({ x: 0, y: 0 }) ].
Expected $[1] = undefined to equal [ Object({ fillRect: spy on CanvasRenderingContext2D.fillRect, clearRect: spy on CanvasRenderingContext2D.clearRect }), 'rgb(0, 0, 1)'

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:222:23
     private patchDifference(difference: Pixel[], data: Uint8ClampedArray | undefined = undefined) {
         let fillStyle;
         difference.forEach((pixel) => {
-            const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
+            const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) / ImageConstants.RgbaComponentsPerPixel;
             if (data) {
                 fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[2][1] = 'rgb(undefined, undefined, undefined)' to equal 'rgb(2, 2, 3)'.
Expected $[3][1] = 'rgb(undefined, undefined, undefined)' to equal 'rgb(2, 2, 3)'.

[Survived] ArithmeticOperator
src/app/services/game-feedback.service.ts:222:34
     private patchDifference(difference: Pixel[], data: Uint8ClampedArray | undefined = undefined) {
         let fillStyle;
         difference.forEach((pixel) => {
-            const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
+            const i = (pixel.x + pixel.y / ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
             if (data) {
                 fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:223:17
         let fillStyle;
         difference.forEach((pixel) => {
             const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
-            if (data) {
+            if (false) {
                 fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[0][0] not to have properties
    canvas: spy on CanvasRenderingContext2D.canvas
    fillStyle: spy on CanvasRenderingContext2D.fillStyle
Expected $[0][1] = 'rgb(1, 1, 1)' to equal 'rgb(0, 0, 1)'.
Expected $[1][0] not to have properties
    canvas: spy on CanvasRenderingContext2D.canvas
    fillStyle: spy on CanvasRenderingContext2D.fillStyle
Expected $[1][1] = 'rgb(0, 0, 0)' to equal 'r

[Killed] ConditionalExpression
src/app/services/game-feedback.service.ts:223:17
         let fillStyle;
         difference.forEach((pixel) => {
             const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
-            if (data) {
+            if (true) {
                 fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: TypeError: Cannot read properties of undefined (reading '0')

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:224:53
         difference.forEach((pixel) => {
             const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
             if (data) {
-                fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
+                fillStyle = `rgb(${data[i]}, ${data[i - 1]}, ${data[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
                 this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[0][1] = 'rgb(0, undefined, 1)' to equal 'rgb(0, 0, 1)'.
Expected $[1][1] = 'rgb(0, undefined, 1)' to equal 'rgb(0, 0, 1)'.
Expected $[2][1] = 'rgb(2, 1, 3)' to equal 'rgb(2, 2, 3)'.
Expected $[3][1] = 'rgb(2, 1, 3)' to equal 'rgb(2, 2, 3)'.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:224:69
         difference.forEach((pixel) => {
             const i = (pixel.x + pixel.y * ImageConstants.DefaultWidth) * ImageConstants.RgbaComponentsPerPixel;
             if (data) {
-                fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
+                fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i - 2]})`;
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
                 this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[0][1] = 'rgb(0, 0, undefined)' to equal 'rgb(0, 0, 1)'.
Expected $[1][1] = 'rgb(0, 0, undefined)' to equal 'rgb(0, 0, 1)'.
Expected $[2][1] = 'rgb(2, 2, 1)' to equal 'rgb(2, 2, 3)'.
Expected $[3][1] = 'rgb(2, 2, 1)' to equal 'rgb(2, 2, 3)'.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:227:20
                 fillStyle = `rgb(${data[i]}, ${data[i + 1]}, ${data[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
                 this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
-            } else {
-                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
-                this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
-                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
-                this.drawOnCanvas(this.leftLayers.clue, fillStyle, pixel);
-            }
+            } else {}
         });
     }
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $.length = 0 to equal 4.
Expected $[0] = undefined to equal [ Object({ canvas: spy on CanvasRenderingContext2D.canvas, clearRect: spy on CanvasRenderingContext2D.clearRect, fillRect: spy on CanvasRenderingContext2D.fillRect, fillStyle: spy on CanvasRenderingContext2D.fillStyle }), 'rgb(1, 1, 1)', Object({ x: 0, y: 0 }) ].
Expected $[1] = undefined to equal [ Object({ canvas: spy on Canvas

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:228:73
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
                 this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
             } else {
-                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
+                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i - 1]}, ${this.rightData[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
                 fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[0][1] = 'rgb(1, undefined, 1)' to equal 'rgb(1, 1, 1)'.
Expected $[2][1] = 'rgb(undefined, 1, undefined)' to equal 'rgb(undefined, undefined, undefined)'.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:228:99
                 this.drawOnCanvas(this.rightLayers.diff, fillStyle, pixel);
                 this.drawOnCanvas(this.leftLayers.diff, fillStyle, pixel);
             } else {
-                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
+                fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i - 2]})`;
                 this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
                 fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[0][1] = 'rgb(1, 1, undefined)' to equal 'rgb(1, 1, 1)'.
Expected $[2][1] = 'rgb(undefined, undefined, 1)' to equal 'rgb(undefined, undefined, undefined)'.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:230:71
             } else {
                 fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
-                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
+                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i - 1]}, ${this.leftData[i + 2]})`;
                 this.drawOnCanvas(this.leftLayers.clue, fillStyle, pixel);
             }
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[1][1] = 'rgb(0, undefined, 0)' to equal 'rgb(0, 0, 0)'.
Expected $[3][1] = 'rgb(undefined, 0, undefined)' to equal 'rgb(undefined, undefined, undefined)'.

[Killed] ArithmeticOperator
src/app/services/game-feedback.service.ts:230:96
             } else {
                 fillStyle = `rgb(${this.rightData[i]}, ${this.rightData[i + 1]}, ${this.rightData[i + 2]})`;
                 this.drawOnCanvas(this.rightLayers.clue, fillStyle, pixel);
-                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i + 2]})`;
+                fillStyle = `rgb(${this.leftData[i]}, ${this.leftData[i + 1]}, ${this.leftData[i - 2]})`;
                 this.drawOnCanvas(this.leftLayers.clue, fillStyle, pixel);
             }
killedBy: gameFeedback patchDifference method should call drawOnCanvas with correct layer, fillStyle and pixel
statusReason: Expected $[1][1] = 'rgb(0, 0, undefined)' to equal 'rgb(0, 0, 0)'.
Expected $[3][1] = 'rgb(undefined, undefined, 0)' to equal 'rgb(undefined, undefined, undefined)'.

[Killed] BlockStatement
src/app/services/game-feedback.service.ts:243:100
      * @param fillStyle The color of the pixel to be drawn.
      * @param pixel The coordinate at which to draw on the layer.
      */
-    private drawOnCanvas(context: CanvasRenderingContext2D, fillStyle: string, pixel: Pixel): void {
-        context.fillStyle = fillStyle;
-        context.fillRect(pixel.x, pixel.y, 1, 1);
-    }
+    private drawOnCanvas(context: CanvasRenderingContext2D, fillStyle: string, pixel: Pixel): void {}
 }
 
killedBy: gameFeedback drawOnCanvas method should call fillRect with correct values
statusReason: Expected undefined to equal 'rgb(1, 2, 3)'.
