[Killed] BlockStatement
src/app/services/history.service.ts:19:19
      * Ctrl + Z calls the undoAction method which undoes the last action stored in the undoArr variable.
      * Ctrl + Shift + Z calls the redoAction method which redoes the last action stored in the redoArr variable.
      */
-    constructor() {
-        this.undoArr = [];
-        this.redoArr = [];
-        window.addEventListener('keydown', (event) => {
-            if (event.ctrlKey && event.key === 'z') {
-                this.undoAction();
-            } else if (event.ctrlKey && event.key === 'Z') {
-                this.redoAction();
-            }
-        });
-    }
+    constructor() {}
 
     /**
killedBy: CanvasManagerService should clear only the canvas that is being reset; HistoryService should add an event listener to the window
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/app/services/history.service.ts:22:55
     constructor() {
         this.undoArr = [];
         this.redoArr = [];
-        window.addEventListener('keydown', (event) => {
-            if (event.ctrlKey && event.key === 'z') {
-                this.undoAction();
-            } else if (event.ctrlKey && event.key === 'Z') {
-                this.redoAction();
-            }
-        });
+        window.addEventListener('keydown', (event) => {});
     }
 
killedBy: HistoryService ctrl + z should call undoAction
statusReason: Expected spy undoAction to have been called.

[Killed] ConditionalExpression
src/app/services/history.service.ts:23:17
         this.undoArr = [];
         this.redoArr = [];
         window.addEventListener('keydown', (event) => {
-            if (event.ctrlKey && event.key === 'z') {
+            if (false) {
                 this.undoAction();
             } else if (event.ctrlKey && event.key === 'Z') {
killedBy: HistoryService ctrl + z should call undoAction
statusReason: Expected spy undoAction to have been called.

[Killed] EqualityOperator
src/app/services/history.service.ts:23:34
         this.undoArr = [];
         this.redoArr = [];
         window.addEventListener('keydown', (event) => {
-            if (event.ctrlKey && event.key === 'z') {
+            if (event.ctrlKey && event.key !== 'z') {
                 this.undoAction();
             } else if (event.ctrlKey && event.key === 'Z') {
killedBy: HistoryService ctrl + z should call undoAction
statusReason: Expected spy undoAction to have been called.

[Killed] BlockStatement
src/app/services/history.service.ts:25:60
         window.addEventListener('keydown', (event) => {
             if (event.ctrlKey && event.key === 'z') {
                 this.undoAction();
-            } else if (event.ctrlKey && event.key === 'Z') {
-                this.redoAction();
-            }
+            } else if (event.ctrlKey && event.key === 'Z') {}
         });
     }
killedBy: HistoryService ctrl + shift + z should call redoAction
statusReason: Expected spy redoAction to have been called.

[Killed] EqualityOperator
src/app/services/history.service.ts:25:41
         window.addEventListener('keydown', (event) => {
             if (event.ctrlKey && event.key === 'z') {
                 this.undoAction();
-            } else if (event.ctrlKey && event.key === 'Z') {
+            } else if (event.ctrlKey && event.key !== 'Z') {
                 this.redoAction();
             }
killedBy: HistoryService ctrl + shift + z should call redoAction
statusReason: Expected spy redoAction to have been called.

[Killed] BlockStatement
src/app/services/history.service.ts:49:58
      * @param arr The array in which the current state of the canvases should be saved.
      * @param keepRedo A boolean value that indicates whether the redoArr array should be emptied.
      */
-    saveState(arr: string[][], clearRedo: boolean): void {
-        if (clearRedo) {
-            this.redoArr = [];
-        }
-
-        arr.push([this.context1.canvas.toDataURL(), this.context2.canvas.toDataURL()]);
-    }
+    saveState(arr: string[][], clearRedo: boolean): void {}
 
     /**
killedBy: HistoryService should save the state
statusReason: Expected 0 to be 1.

[Killed] ConditionalExpression
src/app/services/history.service.ts:50:13
      * @param keepRedo A boolean value that indicates whether the redoArr array should be emptied.
      */
     saveState(arr: string[][], clearRedo: boolean): void {
-        if (clearRedo) {
+        if (true) {
             this.redoArr = [];
         }
killedBy: HistoryService should save the state on redo action
statusReason: Expected 0 to be 1.

[Survived] BlockStatement
src/app/services/history.service.ts:50:24
      * @param keepRedo A boolean value that indicates whether the redoArr array should be emptied.
      */
     saveState(arr: string[][], clearRedo: boolean): void {
-        if (clearRedo) {
-            this.redoArr = [];
-        }
+        if (clearRedo) {}
 
         arr.push([this.context1.canvas.toDataURL(), this.context2.canvas.toDataURL()]);

[Killed] ArrayDeclaration
src/app/services/history.service.ts:51:28
      */
     saveState(arr: string[][], clearRedo: boolean): void {
         if (clearRedo) {
-            this.redoArr = [];
+            this.redoArr = ["Stryker was here"];
         }
 
killedBy: HistoryService should save the state
statusReason: Expected 1 to be 0.

[Survived] ArrayDeclaration
src/app/services/history.service.ts:54:18
             this.redoArr = [];
         }
 
-        arr.push([this.context1.canvas.toDataURL(), this.context2.canvas.toDataURL()]);
+        arr.push([]);
     }
 

[Killed] BlockStatement
src/app/services/history.service.ts:60:24
     /**
      * Undoes the user's previous action, which is the last value stored in the undoArr.
      */
-    undoAction(): void {
-        this.restoreState(this.undoArr, this.redoArr);
-    }
+    undoAction(): void {}
 
     /**
killedBy: HistoryService should call restoreState on undoAction
statusReason: Expected spy restoreState to have been called with:
  [ [  ], [  ] ]
but it was never called.

[Killed] BlockStatement
src/app/services/history.service.ts:67:24
     /**
      * Redoes the user's previous action, which is the last value stored in the redoArr.
      */
-    redoAction(): void {
-        this.restoreState(this.redoArr, this.undoArr);
-    }
+    redoAction(): void {}
 
     /**
killedBy: HistoryService should call restoreState on redoAction
statusReason: Expected spy restoreState to have been called with:
  [ [  ], [  ] ]
but it was never called.

[Killed] BlockStatement
src/app/services/history.service.ts:78:67
      * @param pop The array from which the last value should be taken.
      * @param push The array in which the last value should be saved.
      */
-    private restoreState(pop: string[][], push: string[][]): void {
-        if (pop.length) {
-            this.saveState(push, false);
-
-            const restoreState = pop.pop();
-
-            this.drawCanvas(this.context2, (restoreState as string[]).pop() as string);
-            this.drawCanvas(this.context1, (restoreState as string[]).pop() as string);
-        }
-    }
+    private restoreState(pop: string[][], push: string[][]): void {}
 
     /**
killedBy: HistoryService should restore the state
statusReason: Expected spy drawCanvas to have been called 2 times. It was called 0 times.

[Killed] BlockStatement
src/app/services/history.service.ts:79:25
      * @param push The array in which the last value should be saved.
      */
     private restoreState(pop: string[][], push: string[][]): void {
-        if (pop.length) {
-            this.saveState(push, false);
-
-            const restoreState = pop.pop();
-
-            this.drawCanvas(this.context2, (restoreState as string[]).pop() as string);
-            this.drawCanvas(this.context1, (restoreState as string[]).pop() as string);
-        }
+        if (pop.length) {}
     }
 
killedBy: HistoryService should restore the state
statusReason: Expected spy drawCanvas to have been called 2 times. It was called 0 times.

[Killed] ConditionalExpression
src/app/services/history.service.ts:79:13
      * @param push The array in which the last value should be saved.
      */
     private restoreState(pop: string[][], push: string[][]): void {
-        if (pop.length) {
+        if (false) {
             this.saveState(push, false);
 
killedBy: HistoryService should restore the state
statusReason: Expected spy drawCanvas to have been called 2 times. It was called 0 times.

[Killed] BooleanLiteral
src/app/services/history.service.ts:80:34
      */
     private restoreState(pop: string[][], push: string[][]): void {
         if (pop.length) {
-            this.saveState(push, false);
+            this.saveState(push, true);
 
             const restoreState = pop.pop();
killedBy: HistoryService should restore the state
statusReason: Expected 0 to be 1.

[Killed] BlockStatement
src/app/services/history.service.ts:96:81
      * @param context The context of the canvas on which the image should be drawn.
      * @param source The source of the image that should be drawn.
      */
-    private drawCanvas(context: CanvasRenderingContext2D, source: string): void {
-        const image = new Image();
-        image.src = source;
-        image.onload = () => {
-            context.clearRect(0, 0, context.canvas.width, context.canvas.height);
-            context.drawImage(image, 0, 0);
-        };
-    }
+    private drawCanvas(context: CanvasRenderingContext2D, source: string): void {}
 }
 
killedBy: HistoryService image.onload test
statusReason: Expected $.data['0'] = 0 to equal 255.
Expected $.data['3'] = 0 to equal 255.
Expected $.data['4'] = 0 to equal 255.
Expected $.data['7'] = 0 to equal 255.
Expected $.data['8'] = 0 to equal 255.
Expected $.data['11'] = 0 to equal 255.
Expected $.data['12'] = 0 to equal 255.
Expected $.data['15'] = 0 to equal 255.

[Killed] BlockStatement
src/app/services/history.service.ts:99:30
     private drawCanvas(context: CanvasRenderingContext2D, source: string): void {
         const image = new Image();
         image.src = source;
-        image.onload = () => {
-            context.clearRect(0, 0, context.canvas.width, context.canvas.height);
-            context.drawImage(image, 0, 0);
-        };
+        image.onload = () => {};
     }
 }
killedBy: HistoryService image.onload test
statusReason: Expected $.data['0'] = 0 to equal 255.
Expected $.data['3'] = 0 to equal 255.
Expected $.data['4'] = 0 to equal 255.
Expected $.data['7'] = 0 to equal 255.
Expected $.data['8'] = 0 to equal 255.
Expected $.data['11'] = 0 to equal 255.
Expected $.data['12'] = 0 to equal 255.
Expected $.data['15'] = 0 to equal 255.
