[Killed] BlockStatement
src/app/services/playback.service.ts:46:7
         private saveReplay: SaveReplayService,
         private gameSocketService: GameSocketService,
         private gameFeedbackService: GameFeedbackService,
-    ) {
-        // Set the class attributes to their initial value. Default spees is X1.
-        this.isPlaying = false;
-        this.currentTime = 0;
-        this.playbackSpeed = 1;
-        this.playbackSpeedSubject = new Subject<number>();
-        this.counters = new Map<string, CounterService>();
-        this.isThirdHintPaused = false;
-
-        // To allow the game page components to know if the playback is active and display the content accordingly
-        this.isPlaybackActive = false;
-    }
+    ) {}
 
     /**
killedBy: DifferenceCounterComponent should create; PlaybackOptionsComponent should create; PlaybackService startPlayback
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] BooleanLiteral
src/app/services/playback.service.ts:48:26
         private gameFeedbackService: GameFeedbackService,
     ) {
         // Set the class attributes to their initial value. Default spees is X1.
-        this.isPlaying = false;
+        this.isPlaying = true;
         this.currentTime = 0;
         this.playbackSpeed = 1;
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy resumePlayback to have been called.

[Survived] BooleanLiteral
src/app/services/playback.service.ts:53:34
         this.playbackSpeed = 1;
         this.playbackSpeedSubject = new Subject<number>();
         this.counters = new Map<string, CounterService>();
-        this.isThirdHintPaused = false;
+        this.isThirdHintPaused = true;
 
         // To allow the game page components to know if the playback is active and display the content accordingly

[Killed] BooleanLiteral
src/app/services/playback.service.ts:56:33
         this.isThirdHintPaused = false;
 
         // To allow the game page components to know if the playback is active and display the content accordingly
-        this.isPlaybackActive = false;
+        this.isPlaybackActive = true;
     }
 
killedBy: GameComponent handle keyboard event should start cheat mode if key is "t"
statusReason: Expected spy toggleCheat to have been called.

[Killed] BlockStatement
src/app/services/playback.service.ts:64:25
      *
      * @returns the value of the "isPlaying" attribute
      */
-    get play(): boolean {
-        return this.isPlaying;
-    }
+    get play(): boolean {}
 
     /**
killedBy: PlaybackOptionsComponent should togglePlay
statusReason: Expected spy pausePlayback to have been called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:72:13
      * Starts the playback of the game by intializing the attributes and starting the interval
      */
     startPlayback(): void {
-        if (this.gameFeedbackService.isCheating) this.gameFeedbackService.toggleCheat();
+        if (false) this.gameFeedbackService.toggleCheat();
         this.gameFeedbackService.clearTimeouts();
         // Notify the front-end that the playback is active to update the display
killedBy: PlaybackService startPlayback
statusReason: Expected spy toggleCheat to have been called.

[Survived] ConditionalExpression
src/app/services/playback.service.ts:72:13
      * Starts the playback of the game by intializing the attributes and starting the interval
      */
     startPlayback(): void {
-        if (this.gameFeedbackService.isCheating) this.gameFeedbackService.toggleCheat();
+        if (true) this.gameFeedbackService.toggleCheat();
         this.gameFeedbackService.clearTimeouts();
         // Notify the front-end that the playback is active to update the display

[Killed] BooleanLiteral
src/app/services/playback.service.ts:75:33
         if (this.gameFeedbackService.isCheating) this.gameFeedbackService.toggleCheat();
         this.gameFeedbackService.clearTimeouts();
         // Notify the front-end that the playback is active to update the display
-        this.isPlaybackActive = true;
+        this.isPlaybackActive = false;
         // Reset the difference counters to 0
         this.counters.forEach((counter) => {
killedBy: PlaybackService startPlayback
statusReason: Expected false to be truthy.

[Killed] BlockStatement
src/app/services/playback.service.ts:77:44
         // Notify the front-end that the playback is active to update the display
         this.isPlaybackActive = true;
         // Reset the difference counters to 0
-        this.counters.forEach((counter) => {
-            counter.differenceCounter.next(0);
-            counter.count = 0;
-        });
+        this.counters.forEach((counter) => {});
         if (this.gameSocketService.gameInstance.players.length === 1) {
             this.gameFeedbackService.nbClues = 3;
killedBy: PlaybackService startPlayback
statusReason: Expected spy next to have been called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:81:13
             counter.differenceCounter.next(0);
             counter.count = 0;
         });
-        if (this.gameSocketService.gameInstance.players.length === 1) {
+        if (false) {
             this.gameFeedbackService.nbClues = 3;
             this.gameFeedbackService.clearClueCanvas();
killedBy: PlaybackService startPlayback
statusReason: Expected 0 to equal 3.

[Killed] EqualityOperator
src/app/services/playback.service.ts:81:13
             counter.differenceCounter.next(0);
             counter.count = 0;
         });
-        if (this.gameSocketService.gameInstance.players.length === 1) {
+        if (this.gameSocketService.gameInstance.players.length !== 1) {
             this.gameFeedbackService.nbClues = 3;
             this.gameFeedbackService.clearClueCanvas();
killedBy: PlaybackService startPlayback
statusReason: Expected 0 to equal 3.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:101:26
         // Start the interval to increment the time and execute the events.
         // The interval updates every 100ms, which allows for better performance than updating every 1ms but remains mostly accurate to the eye
         this.playbackInterval = setInterval(this.incrementTime, PlaybackConstants.RefreshSpeed);
-        this.isPlaying = true;
+        this.isPlaying = false;
     }
 
killedBy: PlaybackService startPlayback
statusReason: Expected false to be truthy.

[Killed] BlockStatement
src/app/services/playback.service.ts:110:44
      *
      * @param openPopUp true if the method should open the dialog, false otherwise
      */
-    stopPlayback(openPopUp: boolean): void {
-        // Reset the interval and the currentTime to 0 to allow for a new replay to start
-        this.currentTime = 0;
-        clearInterval(this.playbackInterval);
-        this.isPlaying = false;
-
-        // If the call has been triggered by the restart or quit buttons, we don't want to open the dialog
-        if (!openPopUp) return;
-
-        // Open a dialog to ask the user if they want to replay the game or exit to the menu
-        this.dialog.open(EndReplayComponent, {
-            width: '30%',
-            panelClass: 'container',
-            disableClose: true,
-            autoFocus: false,
-        });
-    }
+    stopPlayback(openPopUp: boolean): void {}
 
     /**
killedBy: PlaybackService stopPlayback
statusReason: Expected spy open to have been called with:
  [ Function, Object({ width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:114:26
         // Reset the interval and the currentTime to 0 to allow for a new replay to start
         this.currentTime = 0;
         clearInterval(this.playbackInterval);
-        this.isPlaying = false;
+        this.isPlaying = true;
 
         // If the call has been triggered by the restart or quit buttons, we don't want to open the dialog
killedBy: PlaybackService stopPlayback
statusReason: Expected true to equal false.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:117:13
         this.isPlaying = false;
 
         // If the call has been triggered by the restart or quit buttons, we don't want to open the dialog
-        if (!openPopUp) return;
+        if (true) return;
 
         // Open a dialog to ask the user if they want to replay the game or exit to the menu
killedBy: PlaybackService stopPlayback
statusReason: Expected spy open to have been called with:
  [ Function, Object({ width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but it was never called.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:117:13
         this.isPlaying = false;
 
         // If the call has been triggered by the restart or quit buttons, we don't want to open the dialog
-        if (!openPopUp) return;
+        if (openPopUp) return;
 
         // Open a dialog to ask the user if they want to replay the game or exit to the menu
killedBy: PlaybackService stopPlayback
statusReason: Expected spy open to have been called with:
  [ Function, Object({ width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but it was never called.

[Killed] ObjectLiteral
src/app/services/playback.service.ts:120:46
         if (!openPopUp) return;
 
         // Open a dialog to ask the user if they want to replay the game or exit to the menu
-        this.dialog.open(EndReplayComponent, {
-            width: '30%',
-            panelClass: 'container',
-            disableClose: true,
-            autoFocus: false,
-        });
+        this.dialog.open(EndReplayComponent, {});
     }
 
killedBy: PlaybackService stopPlayback
statusReason: Expected spy open to have been called with:
  [ Function, Object({ width: '30%', panelClass: 'container', disableClose: true, autoFocus: false }) ]
but actual calls were:
  [ Function, Object({  }) ].

Call 0:
  Expected $[1] to have properties
      width: '30%'

[Killed] BlockStatement
src/app/services/playback.service.ts:132:28
      * Starts playing the game from the point at which the user paused the playback
      * Called when the user clicks the "play" button of the playback toolbar
      */
-    resumePlayback(): void {
-        if (this.isThirdHintPaused) {
-            this.gameFeedbackService.left.clue.canvas.classList.add('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.add('shake');
-            this.isThirdHintPaused = false;
-        }
-
-        this.playbackInterval = setInterval(this.incrementTime, PlaybackConstants.RefreshSpeed);
-        this.isPlaying = true;
-    }
+    resumePlayback(): void {}
 
     /**
killedBy: PlaybackService resumePlayback
statusReason: Expected false to equal true.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:133:13
      * Called when the user clicks the "play" button of the playback toolbar
      */
     resumePlayback(): void {
-        if (this.isThirdHintPaused) {
+        if (false) {
             this.gameFeedbackService.left.clue.canvas.classList.add('shake');
             this.gameFeedbackService.right.clue.canvas.classList.add('shake');
killedBy: PlaybackService resumePlayback
statusReason: Expected true to equal false.

[Killed] BlockStatement
src/app/services/playback.service.ts:133:37
      * Called when the user clicks the "play" button of the playback toolbar
      */
     resumePlayback(): void {
-        if (this.isThirdHintPaused) {
-            this.gameFeedbackService.left.clue.canvas.classList.add('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.add('shake');
-            this.isThirdHintPaused = false;
-        }
+        if (this.isThirdHintPaused) {}
 
         this.playbackInterval = setInterval(this.incrementTime, PlaybackConstants.RefreshSpeed);
killedBy: PlaybackService resumePlayback
statusReason: Expected true to equal false.

[Killed] StringLiteral
src/app/services/playback.service.ts:134:69
      */
     resumePlayback(): void {
         if (this.isThirdHintPaused) {
-            this.gameFeedbackService.left.clue.canvas.classList.add('shake');
+            this.gameFeedbackService.left.clue.canvas.classList.add("");
             this.gameFeedbackService.right.clue.canvas.classList.add('shake');
             this.isThirdHintPaused = false;
killedBy: PlaybackService resumePlayback
statusReason: SyntaxError: Failed to execute 'add' on 'DOMTokenList': The token provided must not be empty.

[Killed] StringLiteral
src/app/services/playback.service.ts:135:70
     resumePlayback(): void {
         if (this.isThirdHintPaused) {
             this.gameFeedbackService.left.clue.canvas.classList.add('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.add('shake');
+            this.gameFeedbackService.right.clue.canvas.classList.add("");
             this.isThirdHintPaused = false;
         }
killedBy: PlaybackService resumePlayback
statusReason: SyntaxError: Failed to execute 'add' on 'DOMTokenList': The token provided must not be empty.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:136:38
         if (this.isThirdHintPaused) {
             this.gameFeedbackService.left.clue.canvas.classList.add('shake');
             this.gameFeedbackService.right.clue.canvas.classList.add('shake');
-            this.isThirdHintPaused = false;
+            this.isThirdHintPaused = true;
         }
 
killedBy: PlaybackService resumePlayback
statusReason: Expected true to equal false.

[Killed] BlockStatement
src/app/services/playback.service.ts:147:27
      * Pauses the playback of the game by clearing the interval but keeps the currentTime attribute intact
      * Called when the user clicks the "pause" button of the playback toolbar
      */
-    pausePlayback(): void {
-        if (
-            this.gameFeedbackService.left.clue.canvas.classList.contains('shake') &&
-            this.gameFeedbackService.right.clue.canvas.classList.contains('shake')
-        ) {
-            this.gameFeedbackService.left.clue.canvas.classList.remove('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.remove('shake');
-            this.isThirdHintPaused = true;
-        }
-
-        clearInterval(this.playbackInterval);
-        this.isPlaying = false;
-    }
+    pausePlayback(): void {}
 
     /**
killedBy: PlaybackService pausePlayback
statusReason: Expected shake not to contain 'shake'.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:149:13
      */
     pausePlayback(): void {
         if (
-            this.gameFeedbackService.left.clue.canvas.classList.contains('shake') &&
-            this.gameFeedbackService.right.clue.canvas.classList.contains('shake')
+            false
         ) {
             this.gameFeedbackService.left.clue.canvas.classList.remove('shake');
killedBy: PlaybackService pausePlayback
statusReason: Expected shake not to contain 'shake'.

[Survived] ConditionalExpression
src/app/services/playback.service.ts:149:13
      */
     pausePlayback(): void {
         if (
-            this.gameFeedbackService.left.clue.canvas.classList.contains('shake') &&
-            this.gameFeedbackService.right.clue.canvas.classList.contains('shake')
+            true
         ) {
             this.gameFeedbackService.left.clue.canvas.classList.remove('shake');

[Killed] BlockStatement
src/app/services/playback.service.ts:151:11
         if (
             this.gameFeedbackService.left.clue.canvas.classList.contains('shake') &&
             this.gameFeedbackService.right.clue.canvas.classList.contains('shake')
-        ) {
-            this.gameFeedbackService.left.clue.canvas.classList.remove('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.remove('shake');
-            this.isThirdHintPaused = true;
-        }
+        ) {}
 
         clearInterval(this.playbackInterval);
killedBy: PlaybackService pausePlayback
statusReason: Expected shake not to contain 'shake'.

[Killed] StringLiteral
src/app/services/playback.service.ts:153:73
             this.gameFeedbackService.right.clue.canvas.classList.contains('shake')
         ) {
             this.gameFeedbackService.left.clue.canvas.classList.remove('shake');
-            this.gameFeedbackService.right.clue.canvas.classList.remove('shake');
+            this.gameFeedbackService.right.clue.canvas.classList.remove("");
             this.isThirdHintPaused = true;
         }
killedBy: PlaybackService pausePlayback
statusReason: SyntaxError: Failed to execute 'remove' on 'DOMTokenList': The token provided must not be empty.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:154:38
         ) {
             this.gameFeedbackService.left.clue.canvas.classList.remove('shake');
             this.gameFeedbackService.right.clue.canvas.classList.remove('shake');
-            this.isThirdHintPaused = true;
+            this.isThirdHintPaused = false;
         }
 
killedBy: PlaybackService pausePlayback
statusReason: Expected false to equal true.

[Killed] BlockStatement
src/app/services/playback.service.ts:167:43
      *
      * @param speed the new playback speed
      */
-    setPlaybackSpeed(speed: number): void {
-        this.playbackSpeed = speed;
-    }
+    setPlaybackSpeed(speed: number): void {}
 
     /**
killedBy: PlaybackService setPlaybackSpeed
statusReason: Expected 1 to equal 0.5.

[Survived] BlockStatement
src/app/services/playback.service.ts:176:27
      * Adds a time event at time 0 to the playback map to allow for the next game to start
      * Called whenever the user exits the game page ; this prevents the user from replaying the game after he has left the page
      */
-    clearPlayback(): void {
-        this.saveReplay.playback.clear();
-        this.counters.clear();
-        this.saveReplay.playback.set(0, { eventType: 'time', eventData: 0 });
-    }
+    clearPlayback(): void {}
 
     /**

[Killed] StringLiteral
src/app/services/playback.service.ts:179:54
     clearPlayback(): void {
         this.saveReplay.playback.clear();
         this.counters.clear();
-        this.saveReplay.playback.set(0, { eventType: 'time', eventData: 0 });
+        this.saveReplay.playback.set(0, { eventType: "", eventData: 0 });
     }
 
killedBy: PlaybackService clearPlayback
statusReason: Expected Map( [ 0, Object({ eventType: '', eventData: 0 }) ] ) to equal Map( [ 0, Object({ eventType: 'time', eventData: 0 }) ] ).

[Killed] BlockStatement
src/app/services/playback.service.ts:188:35
      * When we reach the end of the playback map, the playback is stopped
      * Called every 100ms by the interval
      */
-    private incrementTime = () => {
-        // Execute the events that are due at the current time and find the next event time
-        if (this.currentTime >= this.nextEventTime) {
-            this.handleGameEvent(this.saveReplay.playback.get(this.nextEventTime) as { eventType: string; eventData: unknown });
-            this.nextEventTime = this.playbackIterator.next().value;
-        }
-
-        // Stop the playback when we reach the end of the playback map
-        if (!this.nextEventTime) this.stopPlayback(true);
-
-        // Increment the current time by 100 times the playback speed
-        this.currentTime += this.playbackSpeed * PlaybackConstants.RefreshSpeed;
-    };
+    private incrementTime = () => {};
 
     /**
killedBy: PlaybackService incrementTime
statusReason: Expected spy handleGameEvent to have been called once. It was called 0 times.

[Killed] EqualityOperator
src/app/services/playback.service.ts:190:13
      */
     private incrementTime = () => {
         // Execute the events that are due at the current time and find the next event time
-        if (this.currentTime >= this.nextEventTime) {
+        if (this.currentTime > this.nextEventTime) {
             this.handleGameEvent(this.saveReplay.playback.get(this.nextEventTime) as { eventType: string; eventData: unknown });
             this.nextEventTime = this.playbackIterator.next().value;
killedBy: PlaybackService incrementTime
statusReason: Expected spy handleGameEvent to have been called once. It was called 0 times.

[Killed] EqualityOperator
src/app/services/playback.service.ts:190:13
      */
     private incrementTime = () => {
         // Execute the events that are due at the current time and find the next event time
-        if (this.currentTime >= this.nextEventTime) {
+        if (this.currentTime < this.nextEventTime) {
             this.handleGameEvent(this.saveReplay.playback.get(this.nextEventTime) as { eventType: string; eventData: unknown });
             this.nextEventTime = this.playbackIterator.next().value;
killedBy: PlaybackService incrementTime
statusReason: Expected spy handleGameEvent to have been called once. It was called 0 times.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:196:13
         }
 
         // Stop the playback when we reach the end of the playback map
-        if (!this.nextEventTime) this.stopPlayback(true);
+        if (this.nextEventTime) this.stopPlayback(true);
 
         // Increment the current time by 100 times the playback speed
killedBy: PlaybackService incrementTime
statusReason: Expected spy stopPlayback to have been called with:
  [ true ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:196:13
         }
 
         // Stop the playback when we reach the end of the playback map
-        if (!this.nextEventTime) this.stopPlayback(true);
+        if (false) this.stopPlayback(true);
 
         // Increment the current time by 100 times the playback speed
killedBy: PlaybackService incrementTime
statusReason: Expected spy stopPlayback to have been called with:
  [ true ]
but it was never called.

[Killed] AssignmentOperator
src/app/services/playback.service.ts:199:9
         if (!this.nextEventTime) this.stopPlayback(true);
 
         // Increment the current time by 100 times the playback speed
-        this.currentTime += this.playbackSpeed * PlaybackConstants.RefreshSpeed;
+        this.currentTime -= this.playbackSpeed * PlaybackConstants.RefreshSpeed;
     };
 
killedBy: PlaybackService incrementTime
statusReason: Expected -495 to equal 505.

[Killed] ArithmeticOperator
src/app/services/playback.service.ts:199:29
         if (!this.nextEventTime) this.stopPlayback(true);
 
         // Increment the current time by 100 times the playback speed
-        this.currentTime += this.playbackSpeed * PlaybackConstants.RefreshSpeed;
+        this.currentTime += this.playbackSpeed / PlaybackConstants.RefreshSpeed;
     };
 
killedBy: PlaybackService incrementTime
statusReason: Expected 5.05 to equal 505.

[Killed] BooleanLiteral
src/app/services/playback.service.ts:212:29
     private handleGameEvent(event: { eventType: string; eventData: unknown }): void {
         // isReplaying is set to true and passed to the handlers so they know that the event is being executed during a playback
         // This makes sure that the handlers do not save the data in the playback map again upon a replay
-        const isReplaying = true;
+        const isReplaying = false;
 
         switch (event.eventType) {
killedBy: PlaybackService handleGameEvent : serverMessage
statusReason: Expected spy handleGameEvent to have been called with:
  [ 'hello world', true, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ]
but actual calls were:
  [ 'hello world', false, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ].

Call 0:
  Expected $[1] = false to equal true.
Error: Expected spy handleGameEvent to

[Killed] ConditionalExpression
src/app/services/playback.service.ts:215:13
         const isReplaying = true;
 
         switch (event.eventType) {
-            case 'serverMessage':
-                this.gameSocketService.handleServerMessage(
-                    (event.eventData as MessageComponent).message.text,
-                    isReplaying,
-                    event.eventData as MessageComponent,
-                );
-                break;
+            case 'serverMessage':
 
             case 'chatMessageSent':
killedBy: PlaybackService handleGameEvent : serverMessage
statusReason: Expected spy handleGameEvent to have been called with:
  [ 'hello world', true, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:223:13
                 );
                 break;
 
-            case 'chatMessageSent':
-                this.gameSocketService.handleChatMessageSent(
-                    (event.eventData as MessageComponent).message.text,
-                    isReplaying,
-                    event.eventData as MessageComponent,
-                );
-                break;
+            case 'chatMessageSent':
 
             case 'chatMessageReceived':
killedBy: PlaybackService handleGameEvent : chatMessageSent
statusReason: Expected spy handleChatSentEvent to have been called with:
  [ 'hello world', true, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:231:13
                 );
                 break;
 
-            case 'chatMessageReceived':
-                this.gameSocketService.handleChatMessageReceived(
-                    (event.eventData as MessageComponent).message,
-                    isReplaying,
-                    event.eventData as MessageComponent,
-                );
-                break;
+            case 'chatMessageReceived':
 
             case 'time':
killedBy: PlaybackService handleGameEvent : chatMessageReceived
statusReason: Expected spy handleChatReceivedEvent to have been called with:
  [ Object({ sender: 'user', text: 'hello world' }), true, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ]
but it was never called.

[Killed] StringLiteral
src/app/services/playback.service.ts:231:18
                 );
                 break;
 
-            case 'chatMessageReceived':
+            case "":
                 this.gameSocketService.handleChatMessageReceived(
                     (event.eventData as MessageComponent).message,
killedBy: PlaybackService handleGameEvent : chatMessageReceived
statusReason: Expected spy handleChatReceivedEvent to have been called with:
  [ Object({ sender: 'user', text: 'hello world' }), true, Object({ message: Object({ sender: 'user', text: 'hello world' }), color: '', date: '' }) ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:243:13
                 this.gameSocketService.handleGameTimeUpdated(event.eventData as number, isReplaying);
                 break;
 
-            case 'error':
-                this.gameSocketService.handleErrorClick(event.eventData as Pixel, isReplaying);
-                break;
+            case 'error':
 
             case 'difference': {
killedBy: PlaybackService handleGameEvent : error
statusReason: TypeError: Cannot read properties of undefined (reading 'handleWithoutSave')

[Killed] ConditionalExpression
src/app/services/playback.service.ts:247:13
                 this.gameSocketService.handleErrorClick(event.eventData as Pixel, isReplaying);
                 break;
 
-            case 'difference': {
-                const data = event.eventData as { playerName: string; difference: Pixel[] };
-                (this.counters.get(data.playerName) as CounterService).handleWithoutSave(data.difference);
-                break;
-            }
+            case 'difference':
 
             case 'cheating':
killedBy: PlaybackService handleGameEvent : difference
statusReason: Expected spy handleWithoutSave to have been called with:
  [ [  ] ]
but it was never called.

[Killed] BlockStatement
src/app/services/playback.service.ts:247:32
                 this.gameSocketService.handleErrorClick(event.eventData as Pixel, isReplaying);
                 break;
 
-            case 'difference': {
-                const data = event.eventData as { playerName: string; difference: Pixel[] };
-                (this.counters.get(data.playerName) as CounterService).handleWithoutSave(data.difference);
-                break;
-            }
+            case 'difference': {}
 
             case 'cheating':
killedBy: PlaybackService handleGameEvent : difference
statusReason: Expected spy handleWithoutSave to have been called with:
  [ [  ] ]
but it was never called.

[Killed] ConditionalExpression
src/app/services/playback.service.ts:253:13
                 break;
             }
 
-            case 'cheating':
-                this.gameFeedbackService.toggleCheat();
-                break;
+            case 'cheating':
 
             case 'clue':
killedBy: PlaybackService handleGameEvent : cheating
statusReason: TypeError: Cannot read properties of undefined (reading 'hintPenalty')

[Killed] ConditionalExpression
src/app/services/playback.service.ts:257:13
                 this.gameFeedbackService.toggleCheat();
                 break;
 
-            case 'clue':
-                this.gameFeedbackService.useClue(event.eventData as Pixel[]);
-                this.currentTime += this.gameSocketService.gameInstance.hintPenalty * Time.SecToMs;
-                break;
+            case 'clue':
         }
     }
killedBy: PlaybackService handleGameEvent : clue
statusReason: Expected spy useClue to have been called with:
  [ [ Object({ x: 0, y: 0 }) ] ]
but it was never called.
