[Killed] StringLiteral
src/app/services/playback.service.ts:257:18
                 this.gameFeedbackService.toggleCheat();
                 break;
 
-            case 'clue':
+            case "":
                 this.gameFeedbackService.useClue(event.eventData as Pixel[]);
                 this.currentTime += this.gameSocketService.gameInstance.hintPenalty * Time.SecToMs;
killedBy: PlaybackService handleGameEvent : clue
statusReason: Expected spy useClue to have been called with:
  [ [ Object({ x: 0, y: 0 }) ] ]
but it was never called.

[Survived] ArithmeticOperator
src/app/services/playback.service.ts:259:37
 
             case 'clue':
                 this.gameFeedbackService.useClue(event.eventData as Pixel[]);
-                this.currentTime += this.gameSocketService.gameInstance.hintPenalty * Time.SecToMs;
+                this.currentTime += this.gameSocketService.gameInstance.hintPenalty / Time.SecToMs;
                 break;
         }

[Survived] AssignmentOperator
src/app/services/playback.service.ts:259:17
 
             case 'clue':
                 this.gameFeedbackService.useClue(event.eventData as Pixel[]);
-                this.currentTime += this.gameSocketService.gameInstance.hintPenalty * Time.SecToMs;
+                this.currentTime -= this.gameSocketService.gameInstance.hintPenalty * Time.SecToMs;
                 break;
         }
