[Killed] BlockStatement
src/app/services/progress-counter.service.ts:13:109
 export class ProgressCounterService {
     differenceCounter: BehaviorSubject<number>;
 
-    constructor(private gameSocketService: GameSocketService, private feedbackService: GameFeedbackService) {
-        this.differenceCounter = new BehaviorSubject(0);
-        this.gameSocketService.socketService.on(
-            'differenceFound',
-            (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {
-                if (files) {
-                    gameSocketService.image1 = URL.createObjectURL(new Blob([files.image1]));
-                    gameSocketService.image2 = URL.createObjectURL(new Blob([files.image2]));
-                    gameSocketService.gameInstance = files.gameData;
-                    this.gameSocketService.playFeedbackSound(true);
-                    this.feedbackService.synchronizeNewSheet();
-                }
-                this.differenceCounter.next(this.differenceCounter.getValue() + 1);
-            },
-        );
-
-        this.gameSocketService.socketService.on('playerLeft', (remainingPlayers: string[]) => {
-            gameSocketService.gameInstance.players = remainingPlayers;
-        });
-    }
+    constructor(private gameSocketService: GameSocketService, private feedbackService: GameFeedbackService) {}
 }
 
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected spy playSoundBack to have been called.

[Killed] StringLiteral
src/app/services/progress-counter.service.ts:16:13
     constructor(private gameSocketService: GameSocketService, private feedbackService: GameFeedbackService) {
         this.differenceCounter = new BehaviorSubject(0);
         this.gameSocketService.socketService.on(
-            'differenceFound',
+            "",
             (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {
                 if (files) {
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected spy playSoundBack to have been called.

[Killed] BlockStatement
src/app/services/progress-counter.service.ts:17:106
         this.differenceCounter = new BehaviorSubject(0);
         this.gameSocketService.socketService.on(
             'differenceFound',
-            (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {
-                if (files) {
-                    gameSocketService.image1 = URL.createObjectURL(new Blob([files.image1]));
-                    gameSocketService.image2 = URL.createObjectURL(new Blob([files.image2]));
-                    gameSocketService.gameInstance = files.gameData;
-                    this.gameSocketService.playFeedbackSound(true);
-                    this.feedbackService.synchronizeNewSheet();
-                }
-                this.differenceCounter.next(this.differenceCounter.getValue() + 1);
-            },
+            (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {},
         );
 
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected spy playSoundBack to have been called.

[Killed] BlockStatement
src/app/services/progress-counter.service.ts:18:28
         this.gameSocketService.socketService.on(
             'differenceFound',
             (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {
-                if (files) {
-                    gameSocketService.image1 = URL.createObjectURL(new Blob([files.image1]));
-                    gameSocketService.image2 = URL.createObjectURL(new Blob([files.image2]));
-                    gameSocketService.gameInstance = files.gameData;
-                    this.gameSocketService.playFeedbackSound(true);
-                    this.feedbackService.synchronizeNewSheet();
-                }
+                if (files) {}
                 this.differenceCounter.next(this.differenceCounter.getValue() + 1);
             },
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected spy playSoundBack to have been called.

[Killed] ConditionalExpression
src/app/services/progress-counter.service.ts:18:21
         this.gameSocketService.socketService.on(
             'differenceFound',
             (files: { image1: ArrayBuffer; image2: ArrayBuffer; gameData: GameInstance } | undefined) => {
-                if (files) {
+                if (false) {
                     gameSocketService.image1 = URL.createObjectURL(new Blob([files.image1]));
                     gameSocketService.image2 = URL.createObjectURL(new Blob([files.image2]));
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected spy playSoundBack to have been called.

[Survived] BooleanLiteral
src/app/services/progress-counter.service.ts:22:62
                     gameSocketService.image1 = URL.createObjectURL(new Blob([files.image1]));
                     gameSocketService.image2 = URL.createObjectURL(new Blob([files.image2]));
                     gameSocketService.gameInstance = files.gameData;
-                    this.gameSocketService.playFeedbackSound(true);
+                    this.gameSocketService.playFeedbackSound(false);
                     this.feedbackService.synchronizeNewSheet();
                 }

[Survived] ArithmeticOperator
src/app/services/progress-counter.service.ts:25:45
                     this.gameSocketService.playFeedbackSound(true);
                     this.feedbackService.synchronizeNewSheet();
                 }
-                this.differenceCounter.next(this.differenceCounter.getValue() + 1);
+                this.differenceCounter.next(this.differenceCounter.getValue() - 1);
             },
         );

[Killed] BlockStatement
src/app/services/progress-counter.service.ts:29:95
             },
         );
 
-        this.gameSocketService.socketService.on('playerLeft', (remainingPlayers: string[]) => {
-            gameSocketService.gameInstance.players = remainingPlayers;
-        });
+        this.gameSocketService.socketService.on('playerLeft', (remainingPlayers: string[]) => {});
     }
 }
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected $.length = 2 to equal 1.
Unexpected $[1] = 'user2' in array.

[Killed] StringLiteral
src/app/services/progress-counter.service.ts:29:49
             },
         );
 
-        this.gameSocketService.socketService.on('playerLeft', (remainingPlayers: string[]) => {
+        this.gameSocketService.socketService.on("", (remainingPlayers: string[]) => {
             gameSocketService.gameInstance.players = remainingPlayers;
         });
killedBy: ProgressCounterServiceService should init attributes 
statusReason: Expected $.length = 2 to equal 1.
Unexpected $[1] = 'user2' in array.
