[Killed] BlockStatement
src/app/services/save-replay.service.ts:13:19
      * Constructor of the SaveReplayService class.
      * Creates a new Map to store the game events and adds the first event to the map (time = 0).
      */
-    constructor() {
-        this.playbackMap = new Map<number, { eventType: string; eventData: unknown }>();
-        this.playbackMap.set(0, { eventType: 'time', eventData: 0 });
-    }
+    constructor() {}
 
     /**
killedBy: GameComponent handle keyboard event should start cheat mode if key is "t"; GameSocketService Receiving events should update time on gameTimeUpdated; GameSocketService Emiting events sendChatMessage should send a chatMessage event 
statusReason: TypeError: Cannot read properties of undefined (reading 'has')

[Killed] BlockStatement
src/app/services/save-replay.service.ts:23:76
      *
      * @returns the playbackMap
      */
-    get playback(): Map<number, { eventType: string; eventData: unknown }> {
-        return this.playbackMap;
-    }
+    get playback(): Map<number, { eventType: string; eventData: unknown }> {}
 
     /**
killedBy: PlaybackService startPlayback; SaveReplayService should return playbackMap on get playback
statusReason: TypeError: Cannot read properties of undefined (reading 'keys')

[Survived] BlockStatement
src/app/services/save-replay.service.ts:37:80
      * @param eventType the type of the event
      * @param eventData the data of the event, which varies depending on the event type
      */
-    saveAction(timestamp: number, eventType: string, eventData: unknown): void {
-        if (this.playbackMap.has(timestamp)) {
-            this.saveAction(timestamp + 1, eventType, eventData);
-        } else {
-            this.playbackMap.set(timestamp, { eventType, eventData });
-        }
-    }
+    saveAction(timestamp: number, eventType: string, eventData: unknown): void {}
 }
 

[Survived] ConditionalExpression
src/app/services/save-replay.service.ts:38:13
      * @param eventData the data of the event, which varies depending on the event type
      */
     saveAction(timestamp: number, eventType: string, eventData: unknown): void {
-        if (this.playbackMap.has(timestamp)) {
+        if (false) {
             this.saveAction(timestamp + 1, eventType, eventData);
         } else {

[Timeout] ConditionalExpression
src/app/services/save-replay.service.ts:38:13
      * @param eventData the data of the event, which varies depending on the event type
      */
     saveAction(timestamp: number, eventType: string, eventData: unknown): void {
-        if (this.playbackMap.has(timestamp)) {
+        if (true) {
             this.saveAction(timestamp + 1, eventType, eventData);
         } else {

[Survived] ArithmeticOperator
src/app/services/save-replay.service.ts:39:29
      */
     saveAction(timestamp: number, eventType: string, eventData: unknown): void {
         if (this.playbackMap.has(timestamp)) {
-            this.saveAction(timestamp + 1, eventType, eventData);
+            this.saveAction(timestamp - 1, eventType, eventData);
         } else {
             this.playbackMap.set(timestamp, { eventType, eventData });

[Survived] BlockStatement
src/app/services/save-replay.service.ts:40:16
     saveAction(timestamp: number, eventType: string, eventData: unknown): void {
         if (this.playbackMap.has(timestamp)) {
             this.saveAction(timestamp + 1, eventType, eventData);
-        } else {
-            this.playbackMap.set(timestamp, { eventType, eventData });
-        }
+        } else {}
     }
 }

[Survived] ObjectLiteral
src/app/services/save-replay.service.ts:41:45
         if (this.playbackMap.has(timestamp)) {
             this.saveAction(timestamp + 1, eventType, eventData);
         } else {
-            this.playbackMap.set(timestamp, { eventType, eventData });
+            this.playbackMap.set(timestamp, {});
         }
     }
