[Survived] BlockStatement
src/app/services/sheet-container.service.ts:17:95
     currentGames: Preview[];
     currentHistory: GameArchive[];
 
-    constructor(private communicationService: CommunicationService, public dialog: MatDialog) {
-        this.currentHistory = [];
-    }
+    constructor(private communicationService: CommunicationService, public dialog: MatDialog) {}
 
     async getSheets(pageIndex: number) {

[Survived] ArrayDeclaration
src/app/services/sheet-container.service.ts:18:31
     currentHistory: GameArchive[];
 
     constructor(private communicationService: CommunicationService, public dialog: MatDialog) {
-        this.currentHistory = [];
+        this.currentHistory = ["Stryker was here"];
     }
 

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:21:40
         this.currentHistory = [];
     }
 
-    async getSheets(pageIndex: number) {
-        this.communicationService.getGames(pageIndex).subscribe((pageDetails: PageDetails) => {
-            this.isLastPage = pageDetails.isLastPage;
-            this.pageIndex = pageDetails.pageIndex;
-
-            this.currentGames = [];
-            pageDetails.games.forEach((game: PreviewWithoutImage1) => {
-                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, true) });
-            });
-        });
-    }
+    async getSheets(pageIndex: number) {}
 
     async getHistory() {
killedBy: SheetContainerService getSheet() should set the service attributes according to the response
statusReason: Expected 3 to equal 1.

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:22:95
     }
 
     async getSheets(pageIndex: number) {
-        this.communicationService.getGames(pageIndex).subscribe((pageDetails: PageDetails) => {
-            this.isLastPage = pageDetails.isLastPage;
-            this.pageIndex = pageDetails.pageIndex;
-
-            this.currentGames = [];
-            pageDetails.games.forEach((game: PreviewWithoutImage1) => {
-                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, true) });
-            });
-        });
+        this.communicationService.getGames(pageIndex).subscribe((pageDetails: PageDetails) => {});
     }
 
killedBy: SheetContainerService getSheet() should set the service attributes according to the response
statusReason: Expected 3 to equal 1.

[Survived] BlockStatement
src/app/services/sheet-container.service.ts:27:71
             this.pageIndex = pageDetails.pageIndex;
 
             this.currentGames = [];
-            pageDetails.games.forEach((game: PreviewWithoutImage1) => {
-                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, true) });
-            });
+            pageDetails.games.forEach((game: PreviewWithoutImage1) => {});
         });
     }

[Survived] BooleanLiteral
src/app/services/sheet-container.service.ts:28:109
 
             this.currentGames = [];
             pageDetails.games.forEach((game: PreviewWithoutImage1) => {
-                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, true) });
+                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, false) });
             });
         });

[Survived] ObjectLiteral
src/app/services/sheet-container.service.ts:28:40
 
             this.currentGames = [];
             pageDetails.games.forEach((game: PreviewWithoutImage1) => {
-                this.currentGames.push({ ...game, image1: this.communicationService.getGameFile(game.title, true) });
+                this.currentGames.push({});
             });
         });

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:33:24
         });
     }
 
-    async getHistory() {
-        this.communicationService.getHistory().subscribe((history: GameArchive[]) => {
-            this.currentHistory = [];
-            history.forEach((gameHistory: GameArchive) => {
-                this.currentHistory.push(gameHistory);
-            });
-        });
-    }
+    async getHistory() {}
 
     async deleteHistory() {
killedBy: SheetContainerService getHistory() should set the service attributes according to the response
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }).

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:34:86
     }
 
     async getHistory() {
-        this.communicationService.getHistory().subscribe((history: GameArchive[]) => {
-            this.currentHistory = [];
-            history.forEach((gameHistory: GameArchive) => {
-                this.currentHistory.push(gameHistory);
-            });
-        });
+        this.communicationService.getHistory().subscribe((history: GameArchive[]) => {});
     }
 
killedBy: SheetContainerService getHistory() should set the service attributes according to the response
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }).

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:36:59
     async getHistory() {
         this.communicationService.getHistory().subscribe((history: GameArchive[]) => {
             this.currentHistory = [];
-            history.forEach((gameHistory: GameArchive) => {
-                this.currentHistory.push(gameHistory);
-            });
+            history.forEach((gameHistory: GameArchive) => {});
         });
     }
killedBy: SheetContainerService getHistory() should set the service attributes according to the response
statusReason: Expected $.length = 0 to equal 1.
Expected $[0] = undefined to equal Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }).

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:42:27
         });
     }
 
-    async deleteHistory() {
-        if (confirm("Êtes-vous sûr de vouloir supprimer l'historique?")) {
-            this.currentHistory = [];
-            this.communicationService.deleteHistory().subscribe();
-        }
-    }
+    async deleteHistory() {}
 
     nextIndex(): void {
killedBy: SheetContainerService deleteHistory() should set the service attributes according to the response
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }) in array.

[Killed] ConditionalExpression
src/app/services/sheet-container.service.ts:43:13
     }
 
     async deleteHistory() {
-        if (confirm("Êtes-vous sûr de vouloir supprimer l'historique?")) {
+        if (false) {
             this.currentHistory = [];
             this.communicationService.deleteHistory().subscribe();
killedBy: SheetContainerService deleteHistory() should set the service attributes according to the response
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }) in array.

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:43:74
     }
 
     async deleteHistory() {
-        if (confirm("Êtes-vous sûr de vouloir supprimer l'historique?")) {
-            this.currentHistory = [];
-            this.communicationService.deleteHistory().subscribe();
-        }
+        if (confirm("Êtes-vous sûr de vouloir supprimer l'historique?")) {}
     }
 
killedBy: SheetContainerService deleteHistory() should set the service attributes according to the response
statusReason: Expected $.length = 1 to equal 0.
Unexpected $[0] = Object({ gameTitle: 'test', startDate: 0, playingTime: 10, endClock: 10, gameMode: 'Classique', p1Name: 'p1', p2Name: '', isPlayer1: true, hasAbandoned: false }) in array.

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:49:23
         }
     }
 
-    nextIndex(): void {
-        this.getSheets(++this.pageIndex);
-    }
+    nextIndex(): void {}
 
     previousIndex(): void {
killedBy: SheetContainerService nextIndex() should call getSheets with pageIndex + 1
statusReason: Expected spy getSheets to have been called with:
  [ 2 ]
but it was never called.

[Killed] UpdateOperator
src/app/services/sheet-container.service.ts:50:24
     }
 
     nextIndex(): void {
-        this.getSheets(++this.pageIndex);
+        this.getSheets(--this.pageIndex);
     }
 
killedBy: SheetContainerService nextIndex() should call getSheets with pageIndex + 1
statusReason: Expected spy getSheets to have been called with:
  [ 2 ]
but actual calls were:
  [ 0 ].

Call 0:
  Expected $[0] = 0 to equal 2.
Error: Expected spy getSheets to have been called with:

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:53:27
         this.getSheets(++this.pageIndex);
     }
 
-    previousIndex(): void {
-        this.getSheets(--this.pageIndex);
-    }
+    previousIndex(): void {}
 
     deleteSheet(title: string): void {
killedBy: SheetContainerService previousIndex() should call getSheets with pageIndex - 1
statusReason: Expected spy getSheets to have been called with:
  [ 0 ]
but it was never called.

[Killed] UpdateOperator
src/app/services/sheet-container.service.ts:54:24
     }
 
     previousIndex(): void {
-        this.getSheets(--this.pageIndex);
+        this.getSheets(++this.pageIndex);
     }
 
killedBy: SheetContainerService previousIndex() should call getSheets with pageIndex - 1
statusReason: Expected spy getSheets to have been called with:
  [ 0 ]
but actual calls were:
  [ 2 ].

Call 0:
  Expected $[0] = 2 to equal 0.
Error: Expected spy getSheets to have been called with:

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:57:38
         this.getSheets(--this.pageIndex);
     }
 
-    deleteSheet(title: string): void {
-        if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {
-            this.currentGames = this.currentGames.filter((game) => game.title !== title);
-            this.communicationService
-                .deleteGame(title)
-                .subscribe()
-                .add(async () => await this.getSheets(this.pageIndex));
-        }
-    }
+    deleteSheet(title: string): void {}
 
     deleteAllSheets() {
killedBy: SheetContainerService deleteSheet() should delete sheet and call deleteGame of CommunicationService
statusReason: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.


Error: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:58:75
     }
 
     deleteSheet(title: string): void {
-        if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {
-            this.currentGames = this.currentGames.filter((game) => game.title !== title);
-            this.communicationService
-                .deleteGame(title)
-                .subscribe()
-                .add(async () => await this.getSheets(this.pageIndex));
-        }
+        if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {}
     }
 
killedBy: SheetContainerService deleteSheet() should delete sheet and call deleteGame of CommunicationService
statusReason: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.


Error: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.

[Killed] ConditionalExpression
src/app/services/sheet-container.service.ts:58:13
     }
 
     deleteSheet(title: string): void {
-        if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {
+        if (false) {
             this.currentGames = this.currentGames.filter((game) => game.title !== title);
             this.communicationService
killedBy: SheetContainerService deleteSheet() should delete sheet and call deleteGame of CommunicationService
statusReason: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.


Error: Expected spy CommunicationService.deleteGame to have been called only once, and with given args:
  [ '1' ]
But it was never called.

[Survived] EqualityOperator
src/app/services/sheet-container.service.ts:59:68
 
     deleteSheet(title: string): void {
         if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {
-            this.currentGames = this.currentGames.filter((game) => game.title !== title);
+            this.currentGames = this.currentGames.filter((game) => game.title === title);
             this.communicationService
                 .deleteGame(title)

[Survived] ConditionalExpression
src/app/services/sheet-container.service.ts:59:68
 
     deleteSheet(title: string): void {
         if (confirm('Êtes-vous sûr de vouloir supprimer cette feuille?')) {
-            this.currentGames = this.currentGames.filter((game) => game.title !== title);
+            this.currentGames = this.currentGames.filter((game) => false);
             this.communicationService
                 .deleteGame(title)

[Survived] ArrowFunction
src/app/services/sheet-container.service.ts:63:22
             this.communicationService
                 .deleteGame(title)
                 .subscribe()
-                .add(async () => await this.getSheets(this.pageIndex));
+                .add(() => undefined);
         }
     }

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:67:23
         }
     }
 
-    deleteAllSheets() {
-        if (confirm('Êtes-vous sûr de vouloir supprimer toutes les fiches?')) {
-            this.currentGames = [];
-            this.communicationService.deleteAllGames().subscribe();
-        }
-    }
+    deleteAllSheets() {}
 }
 
killedBy: SheetContainerService deleteAllSheets should delete all sheets
statusReason: Expected undefined to equal [  ].

[Killed] BlockStatement
src/app/services/sheet-container.service.ts:68:79
     }
 
     deleteAllSheets() {
-        if (confirm('Êtes-vous sûr de vouloir supprimer toutes les fiches?')) {
-            this.currentGames = [];
-            this.communicationService.deleteAllGames().subscribe();
-        }
+        if (confirm('Êtes-vous sûr de vouloir supprimer toutes les fiches?')) {}
     }
 }
killedBy: SheetContainerService deleteAllSheets should delete all sheets
statusReason: Expected undefined to equal [  ].

[Killed] ConditionalExpression
src/app/services/sheet-container.service.ts:68:13
     }
 
     deleteAllSheets() {
-        if (confirm('Êtes-vous sûr de vouloir supprimer toutes les fiches?')) {
+        if (false) {
             this.currentGames = [];
             this.communicationService.deleteAllGames().subscribe();
killedBy: SheetContainerService deleteAllSheets should delete all sheets
statusReason: Expected undefined to equal [  ].
