[Killed] BlockStatement
src/app/services/socket-client.service.ts:11:21
 export class SocketClientService {
     socket: Socket;
 
-    isSocketAlive() {
-        return this.socket && this.socket.connected;
-    }
+    isSocketAlive() {}
 
     connect() {
killedBy: SocketClientService isSocketAlive should return true if the socket is still connected
statusReason: Expected undefined to be truthy.

[Killed] LogicalOperator
src/app/services/socket-client.service.ts:12:16
     socket: Socket;
 
     isSocketAlive() {
-        return this.socket && this.socket.connected;
+        return this.socket || this.socket.connected;
     }
 
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'connected')

[Killed] ConditionalExpression
src/app/services/socket-client.service.ts:12:16
     socket: Socket;
 
     isSocketAlive() {
-        return this.socket && this.socket.connected;
+        return true;
     }
 
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'disconnect')

[Killed] BlockStatement
src/app/services/socket-client.service.ts:15:15
         return this.socket && this.socket.connected;
     }
 
-    connect() {
-        this.socket = io(environment.serverUrl, { transports: ['websocket'] });
-    }
+    connect() {}
 
     disconnect() {
killedBy: AbandonPopUpComponent should create; DifferenceCounterComponent should create; EndReplayComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'on')

[Survived] ArrayDeclaration
src/app/services/socket-client.service.ts:16:63
     }
 
     connect() {
-        this.socket = io(environment.serverUrl, { transports: ['websocket'] });
+        this.socket = io(environment.serverUrl, { transports: [] });
     }
 

[Killed] BlockStatement
src/app/services/socket-client.service.ts:19:18
         this.socket = io(environment.serverUrl, { transports: ['websocket'] });
     }
 
-    disconnect() {
-        this.socket.disconnect();
-    }
+    disconnect() {}
 
     on<T>(event: string, action: (data: T) => void): void {
killedBy: SocketClientService should disconnect
statusReason: Expected spy disconnect to have been called.

[Killed] BlockStatement
src/app/services/socket-client.service.ts:23:59
         this.socket.disconnect();
     }
 
-    on<T>(event: string, action: (data: T) => void): void {
-        this.socket.on(event, action);
-    }
+    on<T>(event: string, action: (data: T) => void): void {}
 
     send<T>(event: string, data?: T): void {
killedBy: CounterService should handle difference found; GameSocketService Receiving events should call next on usernameValidity; ProgressCounterServiceService should init attributes 
statusReason: Expected spy GameSocketService.playFeedbackSound to have been called with:
  [ true ]
but it was never called.

[Killed] BlockStatement
src/app/services/socket-client.service.ts:27:44
         this.socket.on(event, action);
     }
 
-    send<T>(event: string, data?: T): void {
-        if (data) {
-            this.socket.emit(event, data);
-        } else {
-            this.socket.emit(event);
-        }
-    }
+    send<T>(event: string, data?: T): void {}
 }
 
killedBy: SocketClientService should call emit with data when using send
statusReason: Expected spy emit to have been called.

[Killed] ConditionalExpression
src/app/services/socket-client.service.ts:28:13
     }
 
     send<T>(event: string, data?: T): void {
-        if (data) {
+        if (true) {
             this.socket.emit(event, data);
         } else {
killedBy: SocketClientService should call emit without data when using send if data is undefined
statusReason: Expected spy emit to have been called with:
  [ 'helloWorld' ]
but actual calls were:
  [ 'helloWorld', undefined ].

Call 0:
  Expected $.length = 2 to equal 1.
  Unexpected $[1] = undefined in array.

[Killed] BlockStatement
src/app/services/socket-client.service.ts:28:19
     }
 
     send<T>(event: string, data?: T): void {
-        if (data) {
-            this.socket.emit(event, data);
-        } else {
+        if (data) {} else {
             this.socket.emit(event);
         }
killedBy: SocketClientService should call emit with data when using send
statusReason: Expected spy emit to have been called.

[Killed] BlockStatement
src/app/services/socket-client.service.ts:30:16
     send<T>(event: string, data?: T): void {
         if (data) {
             this.socket.emit(event, data);
-        } else {
-            this.socket.emit(event);
-        }
+        } else {}
     }
 }
killedBy: SocketClientService should call emit without data when using send if data is undefined
statusReason: Expected spy emit to have been called.
