[Killed] BlockStatement
src/app/services/vs-option.service.ts:14:63
     joinFunction: () => void;
     leaveFunction: () => void;
 
-    constructor(private gameSocketService: GameSocketService) {
-        this.option = new Subject<string>();
-    }
+    constructor(private gameSocketService: GameSocketService) {}
 
     init(title: string) {
killedBy: VsOptionService should change option to Rejoindre
statusReason: Error: <spyOn> : could not find an object to spy upon for next()
Usage: spyOn(<object>, <methodName>)

[Killed] BlockStatement
src/app/services/vs-option.service.ts:18:25
         this.option = new Subject<string>();
     }
 
-    init(title: string) {
-        this.joinFunction = this.toggleJoin.bind(this);
-        this.leaveFunction = this.toggleCreate.bind(this);
-        this.gameSocketService.socketService.on(`joinWaitingRoom${title}`, this.joinFunction);
-        this.gameSocketService.socketService.on(`leaveWaitingRoom${title}`, this.leaveFunction);
-    }
+    init(title: string) {}
 
     destroy(title: string) {
killedBy: VsOptionService should handle joining a waitingroom
statusReason: Expected spy on to have been called.

[Killed] BlockStatement
src/app/services/vs-option.service.ts:25:28
         this.gameSocketService.socketService.on(`leaveWaitingRoom${title}`, this.leaveFunction);
     }
 
-    destroy(title: string) {
-        this.gameSocketService.socketService.socket.off(`joinWaitingRoom${title}`, this.joinFunction);
-        this.gameSocketService.socketService.socket.off(`leaveWaitingRoom${title}`, this.leaveFunction);
-    }
+    destroy(title: string) {}
 
     toggleJoin() {
killedBy: VsOptionService should destroy
statusReason: Expected spy off to have been called 2 times. It was called 0 times.

[Killed] BlockStatement
src/app/services/vs-option.service.ts:30:18
         this.gameSocketService.socketService.socket.off(`leaveWaitingRoom${title}`, this.leaveFunction);
     }
 
-    toggleJoin() {
-        this.option.next('Rejoindre');
-    }
+    toggleJoin() {}
 
     toggleCreate() {
killedBy: VsOptionService should change option to Rejoindre
statusReason: Expected spy next to have been called with:
  [ 'Rejoindre' ]
but it was never called.

[Killed] BlockStatement
src/app/services/vs-option.service.ts:34:20
         this.option.next('Rejoindre');
     }
 
-    toggleCreate() {
-        this.option.next('Créer');
-    }
+    toggleCreate() {}
 }
 
killedBy: VsOptionService should change option to Créer
statusReason: Expected spy next to have been called with:
  [ 'Créer' ]
but it was never called.

[Killed] StringLiteral
src/app/services/vs-option.service.ts:35:26
     }
 
     toggleCreate() {
-        this.option.next('Créer');
+        this.option.next("");
     }
 }
killedBy: VsOptionService should change option to Créer
statusReason: Expected spy next to have been called with:
  [ 'Créer' ]
but actual calls were:
  [ '' ].

Call 0:
  Expected $[0] = '' to equal 'Créer'.
Error: Expected spy next to have been called with:
