[Survived] ArithmeticOperator
src/app/constants/constants.ts:19:14
 export const QUADRANT_SIZES = [
     // The number 4 is only needed to divide the width and length of the image, sp we allow it in a constants file directly
     // eslint-disable-next-line @typescript-eslint/no-magic-numbers
-    { width: ImageConstants.DefaultWidth / 4, height: ImageConstants.DefaultHeight / 4 },
+    { width: ImageConstants.DefaultWidth * 4, height: ImageConstants.DefaultHeight / 4 },
     { width: ImageConstants.DefaultWidth / 2, height: ImageConstants.DefaultHeight / 2 },
 ];

[Survived] ArithmeticOperator
src/app/constants/constants.ts:19:55
 export const QUADRANT_SIZES = [
     // The number 4 is only needed to divide the width and length of the image, sp we allow it in a constants file directly
     // eslint-disable-next-line @typescript-eslint/no-magic-numbers
-    { width: ImageConstants.DefaultWidth / 4, height: ImageConstants.DefaultHeight / 4 },
+    { width: ImageConstants.DefaultWidth / 4, height: ImageConstants.DefaultHeight * 4 },
     { width: ImageConstants.DefaultWidth / 2, height: ImageConstants.DefaultHeight / 2 },
 ];

[Survived] ArithmeticOperator
src/app/constants/constants.ts:20:55
     // The number 4 is only needed to divide the width and length of the image, sp we allow it in a constants file directly
     // eslint-disable-next-line @typescript-eslint/no-magic-numbers
     { width: ImageConstants.DefaultWidth / 4, height: ImageConstants.DefaultHeight / 4 },
-    { width: ImageConstants.DefaultWidth / 2, height: ImageConstants.DefaultHeight / 2 },
+    { width: ImageConstants.DefaultWidth / 2, height: ImageConstants.DefaultHeight * 2 },
 ];
 

[Survived] ArithmeticOperator
src/app/constants/constants.ts:20:14
     // The number 4 is only needed to divide the width and length of the image, sp we allow it in a constants file directly
     // eslint-disable-next-line @typescript-eslint/no-magic-numbers
     { width: ImageConstants.DefaultWidth / 4, height: ImageConstants.DefaultHeight / 4 },
-    { width: ImageConstants.DefaultWidth / 2, height: ImageConstants.DefaultHeight / 2 },
+    { width: ImageConstants.DefaultWidth * 2, height: ImageConstants.DefaultHeight / 2 },
 ];
 
