[Survived] StringLiteral
src/app/modules/app-routing.module.ts:11:29
 import { SelectionPageComponent } from '@app/pages/selection-page/game-selection.component';
 
 const routes: Routes = [
-    { path: '', redirectTo: '/home', pathMatch: 'full' },
+    { path: '', redirectTo: "", pathMatch: 'full' },
     { path: 'home', component: MainPageComponent },
     { path: 'game', component: GamePageComponent },

[Survived] StringLiteral
src/app/modules/app-routing.module.ts:11:13
 import { SelectionPageComponent } from '@app/pages/selection-page/game-selection.component';
 
 const routes: Routes = [
-    { path: '', redirectTo: '/home', pathMatch: 'full' },
+    { path: "Stryker was here!", redirectTo: '/home', pathMatch: 'full' },
     { path: 'home', component: MainPageComponent },
     { path: 'game', component: GamePageComponent },

[Survived] ObjectLiteral
src/app/modules/app-routing.module.ts:12:5
 
 const routes: Routes = [
     { path: '', redirectTo: '/home', pathMatch: 'full' },
-    { path: 'home', component: MainPageComponent },
+    {},
     { path: 'game', component: GamePageComponent },
     { path: 'config', component: ConfigPageComponent },

[Survived] StringLiteral
src/app/modules/app-routing.module.ts:13:13
 const routes: Routes = [
     { path: '', redirectTo: '/home', pathMatch: 'full' },
     { path: 'home', component: MainPageComponent },
-    { path: 'game', component: GamePageComponent },
+    { path: "", component: GamePageComponent },
     { path: 'config', component: ConfigPageComponent },
     { path: 'creation', component: CreationComponent },

[Survived] StringLiteral
src/app/modules/app-routing.module.ts:14:13
     { path: '', redirectTo: '/home', pathMatch: 'full' },
     { path: 'home', component: MainPageComponent },
     { path: 'game', component: GamePageComponent },
-    { path: 'config', component: ConfigPageComponent },
+    { path: "", component: ConfigPageComponent },
     { path: 'creation', component: CreationComponent },
     { path: 'select', component: SelectionPageComponent },

[Survived] ObjectLiteral
src/app/modules/app-routing.module.ts:14:5
     { path: '', redirectTo: '/home', pathMatch: 'full' },
     { path: 'home', component: MainPageComponent },
     { path: 'game', component: GamePageComponent },
-    { path: 'config', component: ConfigPageComponent },
+    {},
     { path: 'creation', component: CreationComponent },
     { path: 'select', component: SelectionPageComponent },

[Survived] StringLiteral
src/app/modules/app-routing.module.ts:15:13
     { path: 'home', component: MainPageComponent },
     { path: 'game', component: GamePageComponent },
     { path: 'config', component: ConfigPageComponent },
-    { path: 'creation', component: CreationComponent },
+    { path: "", component: CreationComponent },
     { path: 'select', component: SelectionPageComponent },
     { path: 'history', component: HistoryPageComponent },

[Survived] StringLiteral
src/app/modules/app-routing.module.ts:18:13
     { path: 'creation', component: CreationComponent },
     { path: 'select', component: SelectionPageComponent },
     { path: 'history', component: HistoryPageComponent },
-    { path: '**', redirectTo: '/home' },
+    { path: "", redirectTo: '/home' },
 ];
 

[Survived] ObjectLiteral
src/app/modules/app-routing.module.ts:18:5
     { path: 'creation', component: CreationComponent },
     { path: 'select', component: SelectionPageComponent },
     { path: 'history', component: HistoryPageComponent },
-    { path: '**', redirectTo: '/home' },
+    {},
 ];
 
