[Killed] ArithmeticOperator
src/app/classes/eraser.ts:48:48
         if (deltaX > deltaY)
             this.eraseFixedAxis([signX * 2, 0, signX * DrawConstants.EraseSteps, signY * (deltaY / deltaX) * DrawConstants.EraseSteps], deltaX);
         else {
-            this.eraseFixedAxis([0, signY * 2, signX * (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
+            this.eraseFixedAxis([0, signY * 2, signX / (deltaX / deltaY) * DrawConstants.EraseSteps, signY * DrawConstants.EraseSteps], deltaY);
         }
     };
killedBy: Pencil move should call eraseFixedAxis according to the mouse moving horizontally
statusReason: Expected spy eraseFixedAxis to have been called with:
  [ [ 0, -2, -0, -4 ], 20 ]
but actual calls were:
  [ [ 0, -2, -Infinity, -4 ], 20 ].

Call 0:
  Expected $[0][2] = -Infinity to equal -0.
Error: Expected spy eraseFixedAxis to have been called with:
