[Killed] BlockStatement
src/app/services/game-socket.service.ts:375:23
      * @param message the message to display
      */
     handleNewBestTimeMessage = (text: string, isReplay?: boolean, message?: MessageComponent) => {
-        if (!message) {
-            message = new MessageComponent();
-            message.color = ChatColor.BestTime;
-            message.message = { sender: 'SERVEUR', text };
-            message.date = new Date().toLocaleTimeString('it-IT');
-        }
+        if (!message) {}
         this.messages.unshift(message);
         if (!isReplay) this.saveReplay.saveAction(this.currentTime, 'serverMessage', message);
statusReason: Expected [ undefined ] to contain MessageComponent({ color: '#50E9FE', date: <jasmine.any(String)>, message: Object({ sender: 'SERVEUR', text: 'test' }) }).
