[Killed] ArithmeticOperator
src/app/services/compare.service.ts:162:30
 
                 // Compares pixels under an arbitrary tolerance
                 if (
-                    Math.abs(originalData[i] - modifiedData[i]) +
+                    Math.abs(originalData[i] + modifiedData[i]) +
                         Math.abs(originalData[i + 1] - modifiedData[i + 1]) +
                         Math.abs(originalData[i + 2] - modifiedData[i + 2]) >
killedBy: CompareService drawDifferences method should draw different pixel within canvas' bounds; CompareService validateDifferences method should call floodFill once per difference; CompareService floodFill method should consider corner-touching pixels as part of one difference
statusReason: Expected spy fillRect to have been called 2 times. It was called 307201 times.
